Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: WeeChat 0.0.9 is available! News since last version are: - auto reconnection to server when disconnected (and fixed bug: 100% CPU usage after disconnection), - new "/buffer close" command (lets you close a server buffer), - "/notice" command fixed, - colors delete in incoming messages (existing option "look_remove_colors_from_msgs"), - new keys Ctrl-A, Ctrl-E, Ctrl-W, Alt-S, Alt-X, - new setup options: server_autoreconnect, sserver_autoreconnect_delay, server_command_delay. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.81">v0.0.9 ChangeLog</a>
fr: WeeChat 0.0.9 est disponible ! Les nouveautés depuis la dernière version sont : - reconnexion automatique au serveur en cas de déconnexion (et correction d'un bug qui faisait que WeeChat utilisait 100% du CPU après une déconnexion), - nouvelle commande "/buffer close" (qui permet de fermer un tampon de serveur), - commande /notice corrigée, - suppression des couleurs dans les messages entrants (option existante "look_remove_colors_from_msgs"), - nouvelles touches Ctrl-A, Ctrl-E, Ctrl-W, Alt-S, Alt-X, - nouvelles options de configuration: server_autoreconnect, sserver_autoreconnect_delay, server_command_delay. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.81">ChangeLog v0.0.9</a>

source: W3Blacklist open
fr: Ouverture de W3Blacklist

source: W3Blacklist is now open, after almost one year of interruption. Original website (created by Cédric Malherbe), at w3blacklist.tuxfamily.org has been rewritten. Database has been kept and will be slowly updated (any help welcome, contact webmaster if interested). This website is here to make the W3C standards respected. It denounces any website (commercial or governemt) which discriminate visitors according to their operating system or web browser. There is regular mailings to webmasters, in the hope the website will me modified to be compliant with standards. Letters templates are available for your mails. Features of old website are still there: - websites list with search bar, - new website submit (gives place to tests and moderation), - documentation about standards and their importance, - letters templates to send to webmasters, - FAQ about website, - support with mail and IRC. New features have been added: - mail alert when changes on a selected website, - follow-up of the mails sent to webmasters, and answers received. &bull; <a href="/w3blacklist/">Websites list</a> &bull; <a href="/w3blacklist/doc/">Documentation</a> &bull; <a href="/w3blacklist/letters/">Letters templates</a> &bull; <a href="/w3blacklist/faq/">FAQ</a>
fr: Le site W3Blacklist est désormais ouvert, après une interruption de près d'un an. Le site original (créé par Cédric Malherbe), dont l'url était w3blacklist.tuxfamily.org a été complètement réécrit. La base de données a été reprise et sera progressivement mise à jour (toute aide est la bienvenue, contactez le webmaster si vous êtes intéressé). Ce site a pour but de faire respecter les standards du W3C. Il dénonce tout site (commercial ou gouvernemental) qui discrimine les visiteurs en interdisant l'accès selon le navigateur ou l'OS utilisé. Il y a des envois réguliers de mails aux webmasters concernés, pour que le site soit modifié et conforme aux standards. Des modèles de lettres sont fournis pour vos propres mails. Les fonctionnalités de l'ancien site sont toujours présentes : - liste des sites avec barre de recherche, - soumission d'un nouveau site (donne lieu à tests et modération), - documentation sur les standards et leur importance, - modèles de lettres pour envoyer aux webmasters, - FAQ sur le site, - support par mail et IRC. De nouvelles fonctionnalités ont été ajoutées : - alertes par mail lorsqu'il y a du changement sur un site choisi, - suivi des envois de mails aux webmasters, et des réponses reçues. &bull; <a href="/w3blacklist/">Liste des sites</a> &bull; <a href="/w3blacklist/doc/">Documentation</a> &bull; <a href="/w3blacklist/letters/">Modèles de lettres</a> &bull; <a href="/w3blacklist/faq/">FAQ</a>

source: Driver version 0.10 is available. Among the news: - scripts have been renamed, prefixed by "eciadsl-", - new modems support (new Globespan chipsets are still supported by Nortek version, not yet merged), - USB 2.0 module (ehci-hcd) doesn't disturb eciadsl-start any more, - new packages for Fedora Core 2 and Debian PPC, - many bugs fixed. Please note: this version still requires patch for any kernel between 2.6.0 and 2.6.6. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version 0.10 du driver est disponible. Parmi les nouveautés : - les scripts ont tous été renommés, préfixés par "eciadsl-", - support de nouveaux modems (les nouveaux chipsets Globespan restent supportés par la version Nortek, non encore fusionnée), - le module USB 2.0 (ehci-hcd) ne perturbe plus eciadsl-start, - nouveaux paquets pour Fedora Core 2 et Debian PPC, - nombreux bugs corrigés. A noter: cette version n&eacute;cessite toujours de patcher tout noyau 2.6 entre les versions 2.6.0 et 2.6.6. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Story of a different driver
fr: Histoire d'un driver pas comme les autres

source: New page with whole EciAdsl story has been added: all from beginning (and even before) until today (and even after). &bull; <a href="/eciadsl/story/">EciAdsl, story of a different driver</a>
fr: Une nouvelle page retraçant l'histoire entière du driver EciAdsl a été ajoutée : tout depuis le début (et même avant) jusqu'à aujourd'hui (et même après). &bull; <a href="/eciadsl/story/">EciAdsl, histoire d'un driver pas comme les autres</a>

source: WeeChat 0.0.8 is available! News since last version are: - DCC incoming file, - away announced in channels, - logging buffers to disk (optional), - auto-join when kicked (optional), - Ctrl-L key: redraw terminal, - Alt-R key: clear hotlist, - improved or fixed commands: /buffer, /query, /kick, - many bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.75">v0.0.8 ChangeLog</a>
fr: WeeChat 0.0.8 est disponible ! Les nouveautés depuis la dernière version sont : - DCC de fichier en réception, - absences annoncées dans les canaux, - log des conversations sur disque (en option), - auto-join quand "kické" (en option), - touche Ctrl-L pour redessiner le terminal, - touche Alt-R pour réinitialiser la "hotlist", - commandes complétées ou corrigées: /buffer, /query, /kick, - nombreux bugs corrigés. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.75">ChangeLog v0.0.8</a>

source: Turkish documentation
fr: Documentation en turc

source: EciAdsl installation guide is now available in turkish version (thanks to Onur Kurt). &bull; <a href="/eciadsl/doc/">EciAdsl documentation</a>
fr: Le guide d'installation EciAdsl est désormais disponible en turc (merci à Onur Kurt). &bull; <a href="/eciadsl/doc/">Documentation EciAdsl</a>

source: German documentation
fr: Documentation en allemand

source: EciAdsl installation guide is now available in german version (thanks to Thorsten Hirsch). &bull; <a href="/eciadsl/doc/">EciAdsl documentation</a>
fr: Le guide d'installation EciAdsl est désormais disponible en allemand (merci à Thorsten Hirsch). &bull; <a href="/eciadsl/doc/">Documentation EciAdsl</a>

source: Help EciAdsl project
fr: Aider le projet EciAdsl

source: EciAdsl project is now accepting donations with Paypal account on Sourceforge project page (see link below). Donations will be used to maintain the computers used to develop up to date and to test the EciAdsl driver and other free projets developers contribute in. Thank you in advance for your donations. &bull; <a href="http://sourceforge.net/donate/index.php?group_id=30043">Help EciAdsl project</a>
fr: Le projet EciAdsl accepte désormais des dons via un compte Paypal accessible sur la page Sourceforge du projet (voir lien ci-dessous). Les dons seront utilisés pour maintenir à jour les ordinateurs utilisés pour développer et tester le driver EciAdsl ainsi que les autres projets libres auxquels contribuent les développeurs. Merci d'avance pour vos dons. &bull; <a href="http://sourceforge.net/donate/index.php?group_id=30043">Aider le projet EciAdsl</a>

source: WeeChat 0.0.7 is available! News since last version are: - new channels management, with numbered buffers, - multi-windows management with /window and /buffer commands, - auto jump to buffers with activity (Alt-A), - jump to buffers by number (Alt-number), - unique color for each nick (based on nickname), - history limit (saves memory). &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.61">v0.0.7 ChangeLog</a>
fr: WeeChat 0.0.7 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelle gestion de l'affichage des canaux par tampons numérotés, - gestion du multi-fenêtres avec les commandes /window et /buffer, - saut automatique vers les tampons avec activité (Alt-A), - saut vers les tampons par numéro (Alt-numéro), - couleur unique pour chaque pseudo (basé sur le pseudo lui-même), - limite pour l'historique (gain de mémoire). &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.61">ChangeLog v0.0.7</a>

source: Major new features
fr: Nouvelles fonctionnalités majeures

source: WeeChat has many new important features since some weeks: - multi-windows management (with horizontal and vertical window split) - buffers managed by number, with direct access by Alt+digit key or with new /buffer command - auto jump to buffers with activity (Alt-A) All new features are in CVS and development version. /window and /buffer commands are still under development. Feel free to report any problem or suggestion to improve navigation between buffers/windows. &bull; <a href="/files/weechat/shots/">Last version screenshot</a> &bull; <a href="/weechat/download/devel/">WeeChat download page, development version</a>
fr: WeeChat a subi de profonds changements ces dernières semaines : - gestion du multi-fenêtres (avec découpage horizontal et vertical de la fenêtre) - gestion des tampons par numéro, avec accès direct par Alt+N° ou par la nouvelle commande /buffer - saut automatique vers les tampons avec activité (Alt-A) Toutes ces améliorations sont dans le CVS et la version de développement. Les commandes /window et /buffer sont toujours en développement. N'hésitez pas à remonter tout problème ou suggestion d'amélioration sur la navigation entre les tampons/fenêtres. &bull; <a href="/files/weechat/shots/">Capture d'écran de la dernière version</a> &bull; <a href="/weechat/download/devel/">Page téléchargement WeeChat, version de développement</a>

source: New EciAdsl 0.9 RPM
fr: Nouveau RPM EciAdsl 0.9

source: RPM for v0.9 of EciAdsl driver has been replaced by new version, old one was broken due to dependency to "perl-base" (package that does not exist). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Le RPM pour la version 0.9 du driver EciAdsl a été remplacé par une nouvelle version, l'ancien présentait un problème de dépendance avec "perl-base" (qui n'existe pas). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: EciAdsl and 2.6.x kernels
fr: EciAdsl et les noyaux 2.6.x

source: EciAdsl driver is compatible with 2.6 kernels since version 0.9. All 2.6 kernels between 2.6.0 and 2.6.6 have to be patched (look at link below). Update on 2004-06-23: 2.6.7 and 2.6.8.1 kernels are not stable with EciAdsl. Kernel 2.6.9-rc1 seems stable. Feel free to report us any stability problem with 2.6 kernels. Thanks. &bull; <a href="/files/eciadsl/beta/">Patch for 2.6 kernels (≥ 2.6.0 and ≤ 2.6.6)</a>
fr: Le driver EciAdsl est compatible avec les noyaux 2.6.x depuis sa version 0.9. Tous les noyaux 2.6 entre le 2.6.0 et le 2.6.6 sont à patcher (voir lien ci-dessous). MAJ le 28/08/2004 : les noyaux 2.6.7 et 2.6.8.1 ne sont pas stables avec EciAdsl. Le noyau 2.6.9-rc1 semble stable. N'hésitez pas à nous faire remonter tous les problèmes de stabilité rencontrés avec les noyaux 2.6. Merci. &bull; <a href="/files/eciadsl/beta/">Patch pour noyaux 2.6 (≥ 2.6.0 et ≤ 2.6.6)</a>

source: New synch .bin file
fr: Nouveau fichier .bin de synchronisation

source: New .bin file has been added (synch49.bin). It was created in Switzerland (Bern), with Sunrise provider (modulation Multimode). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch49.bin). Il a été créé en Suisse (Bern) avec le fournisseur Sunrise (modulation Multimode). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat 0.0.6 is available! News since last version are: - improved channel highlight (priority to message vs join/part) - fixed bug when opened private win and remote user changes his nick - /query command added (starts private conversation) - IRC messages 476, 477 added - /mode command is now ok and channel flags are displayed in status bar - fixed display bug (text was blinking when scrolling) - CTCP Version reply is now in English only and doesn't show host (security reason) &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.52">v0.0.6 ChangeLog</a>
fr: WeeChat 0.0.6 est disponible ! Les nouveautés depuis la dernière version sont : - surbrillance des canaux améliorée (priorité aux messages par rapport aux join/part) - bug corrigé quand une fenêtre privée est ouverte et que l'utilisateur distant change de pseudo - commande /query ajoutée (démarre une conversation privée) - messages IRC 476, 477 ajoutés - la commande /mode est maintenant ok et les drapeaux sont affichés dans la barre de statut - bug d'affichage corrigé (le texte clignotait lors du défilement) - le CTCP version répond en anglais et ne montre pas le nom de machine (raison de sécurité) &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.52">ChangeLog v0.0.6</a>

source: FlashTux.org new design
fr: Nouveau look FlashTux.org

source: FlashTux.org website has been redesigned: - conform to XHTML / CSS 2 W3C recommandations - nice colors - pages uniformity - comments system for news - language selection is on left menu, and is saved by a cookie. Future improvements: - website theme selection - global website prefs - news search function. Page with projects hosted by FlashTux.org has been added. &bull; <a href="/projects/">Projects hosted by FlashTux.org</a>
fr: Le site FlashTux.org a été relooké : - conformité aux standards XHTML / CSS 2 du W3C - couleurs plus agréables - uniformité des pages - système de commentaires pour les news - le choix de la langue est dans le menu de gauche et est mémorisé par un cookie. Améliorations à venir : - thème du site modifiable - préférences globales du site - fonction de recherche dans les "news". Une page référençant tous les projets hébergés sur FlashTux.org a été ajoutée. &bull; <a href="/projects/">Projets hébergés sur FlashTux.org</a>

source: New .bin file has been added (synch48.bin). It was created in France (Gouzangrez), with Tele2 provider (modulation T1.413). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch48.bin). Il a été créé en France (Gouzangrez) avec le fournisseur Tele2 (modulation T1.413). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat/WeeWM/Gmemo forums
fr: Forums WeeChat/WeeWM/Gmemo

source: FlashTux.org forums are now available for support and development about WeeChat, WeeWM and Gmemo. &bull; <a href="http://forums.flashtux.org">FlashTux.org forums</a>
fr: Les forums FlashTux.org sont désormais disponibles pour le support et le développement de WeeChat, WeeWM et Gmemo. &bull; <a href="http://forums.flashtux.org">Forums FlashTux.org</a>

source: EciAdsl with Mdk 10 and kernel 2.6.X - Install doc
fr: Doc install EciAdsl avec Mdk 10 et noyau 2.6.x

source: Installation doc for EciAdsl driver with Mandrake 10 and 2.6.x kernel has been written by karimj. &bull; <a href="/files/eciadsl/doc/eciadsl-mdk10.txt">EciAdsl with Mdk 10 installation doc</a>
fr: Une documentation sur l'installation du driver EciAdsl avec Mandrake 10 et noyau 2.6.x a été écrite par karimj. &bull; <a href="/files/eciadsl/doc/eciadsl-mdk10.txt">Doc installation EciAdsl sur Mdk 10</a>

source: New .bin file has been added (synch47.bin). It was created in France (Palaiseau), with Club Internet provider (modulation T1.413). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch47.bin). Il a été créé en France (Palaiseau) avec le fournisseur Club Internet (modulation T1.413). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Version 0.9 is available. This version now supports 2.4 and 2.6 kernels. Important: for 2.6 kernels, you need to patch the kernel to fix an USB bug. &bull; <a href="/eciadsl/download/">EciAdsl download page</a> &bull; <a href="/files/eciadsl/beta/">Patch for 2.6 kernels</a>
fr: La version 0.9 est disponible. Cette version supporte les noyaux 2.4 et 2.6. Important: pour les noyaux 2.6 il faut patcher le noyau pour corriger un bug USB. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a> &bull; <a href="/files/eciadsl/beta/">Patch pour noyaux 2.6</a>

source: New page about DSLAM
fr: Nouvelle page sur le DSLAM

source: New page has been created to show all possible modifications on DSLAM (look at previous news). Remember: we are not responsible of any data/hardware damage due to this feature. &bull; <a href="/files/eciadsl/dslam/">Remotely change DSLAM parameters</a>
fr: Une nouvelle page a été mise en place afin d'indiquer toutes les modifications possibles sur le DSLAM (voir news précédente). Rappel: nous dégageons toute responsabilité quant à toute perte de données ou dommage matériel découlant de cette fonctionnalité. &bull; <a href="/files/eciadsl/dslam/">Modification des paramètres du DSLAM</a>

source: DSLAM parameters
fr: Paramètres du DSLAM

source: New major feature has been added to CVS version of driver. It is now possible to modify DSLAM parameters remotely. Main goal is to modify his line speed. For example: from 128 kbits/sec to 512 or from 512 to 1024. Warning: no test has been made with degrouped line or another speed. Technically, we send 4 bytes (and 2 for speed) to the DSLAM, after authentication step. To activate this option, you have to install latest CVS version and add this line to your /etc/eciadsl/eciadsl.conf file: DSLAM=0x50 0x3A 0x67 0x00 0xZZ 0x00 To change speed from 128 to 512, replace ZZ by 02 (0x0200 = 512), from 512 to 1024 by 04 (0x0400 = 1024). Warning: all other value or incorrect data may prevent you from connecting definitively (manual intervention of your provider required). We are not responsible of any data/hardware damage due to this feature. For any question or to know more about other possible modifications (under test), feel free to contact us. Have a nice surf!
fr: Une nouvelle fonctionnalité majeure a été mise en place dans la version CVS du driver. Il est désormais possible de modifier des paramètres du DSLAM à distance. L'intérêt principal est de modifier le débit attribué à sa ligne. Par exemple : de 128 kbits/sec à 512 ou bien de 512 à 1024. Attention: le test a été effectué avec Free et Wanadoo, en France uniquement. De plus, aucun test n'a été effectué sur des lignes dégroupées ou d'autres débits. Techniquement cela consiste à envoyer une séquence de 4 octets (plus 2 pour le débit) au DSLAM après l'étape d'authentification. Pour activer cette option, il suffit d'installer la dernière version CVS et d'ajouter cette ligne dans le fichier /etc/eciadsl/eciadsl.conf : DSLAM=0x50 0x3A 0x67 0x00 0xZZ 0x00 Pour passer d'un débit de 128 à 512, remplacer ZZ par 02 (0x0200 = 512), de 512 à 1024 par 04 (0x0400 = 1024). Attention: toute autre valeur ou une suite de données incorrectes pourrait vous empêcher définitivement de vous connecter (intervention nécessaire du fournisseur). Nous dégageons toute responsabilité quant à toute perte de données ou dommage matériel découlant de cette fonctionnalité. Pour toute question complémentaire ou connaître les autres modifications possibles (en cours de test), n'hésitez pas à nous contacter. Bon surf !

source: EciAdsl and Free dégroupé
fr: EciAdsl et Free dégroupé

source: EciAdsl driver (version 0.8 or more) is compatible with Free dégroupé. Changes to do in driver config: - in /etc/eciadsl/eciadsl.conf (with eciconf.sh): MODE=VCM_RFC1483_ROUTED_IP, STATIC_IP=yes, VPI=8, VCI=36, setup static IP address and gateway (given by Free), - in /etc/ppp/peers/adsl: remove line with username. &bull; <a href="/files/eciadsl/doc/eciadsl-free-degroupe.txt">EciAdsl config for Free dégroupé</a>
fr: Le driver EciAdsl (version 0.8 ou plus) est compatible avec Free dégroupé. Changements à effectuer dans la configuration du driver : - dans /etc/eciadsl/eciadsl.conf (avec eciconf.sh): MODE=VCM_RFC1483_ROUTED_IP, STATIC_IP=yes, VPI=8, VCI=36, renseigner l'adresse IP fixe et la passerelle (fournis par Free), - dans /etc/ppp/peers/adsl: supprimer la ligne avec l'utilisateur. &bull; <a href="/files/eciadsl/doc/eciadsl-free-degroupe.txt">Config EciAdsl pour Free dégroupé</a>

source: New design for FlashTux.org
fr: Refonte du site FlashTux.org

source: FlashTux.org website is being rewritten from scratch. It will be compliant with XHTML 1.0 Strict, will be light and nice (for example non-aggressive colors). Feel free to give your opinion or suggestions, all remarks are welcome! Updated on 2004-05-30: new version is online.
fr: Le site FlashTux.org est en train d'être complètement réécrit, il sera conforme à la norme XHTML 1.0 Strict, plus léger et plus agréable (notamment couleurs moins agressives). N'hésitez pas à faire part de votre avis ou suggestions, toutes les remarques sont les bienvenues ! MAJ le 30/05/2004 : la nouvelle version est en place.

source: A documentation for installing EciAdsl driver on OpenBSD has been written by Benoit Papillault. This can be useful for installing driver on other BSD versions. &bull; <a href="/files/eciadsl/doc/eciadsl-on-openbsd.txt">Documentation EciAdsl / OpenBSD</a>
fr: Une documentation pour l'installation du driver EciAdsl sur OpenBSD a été écrite par Benoit Papillault. Celle-ci pourra également servir à l'installation du driver sur les autres versions de BSD. &bull; <a href="/files/eciadsl/doc/eciadsl-on-openbsd.txt">Documentation EciAdsl / OpenBSD</a>

source: Version 0.0.3 scheduled
fr: Version 0.0.3 programmée
