Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Maintenance: bring simplified code, separation of the content and presentation, only one version of the site for all browsers.
fr: Maintenance : code simplifié, séparation du contenu et de la présentation, une version unique du site pour tous les navigateurs.

source: Stability: forward and backward compatibility, code readable by all future browsers without modification, the rendering of pages stay correct even with outdated browsers.
fr: Stabilité : compatibilité ascendante et descendante, code lisible par tous les navigateurs dans le futur sans modification, le rendu des pages reste correct même avec des navigateurs obsolètes.

source: Possibilities of standards
fr: Possibilité des standards

source: A common misconception is that websites compliant to standards are dull, poorly designed and not eye-candy. That's completely wrong. The standards support a wide range of possibilites that match the most advanced HTML or JavaScript code. Just have a look at those links for examples:
fr: Une idée fausse est que les sites conformes aux standards sont pauvres en design et pas agréables è regarder. C'est complètement faux. Les standards supportent un éventail de possibilités qui équivalent au plus avancé des codes HTML ou JavaScript. Regardez ces liens par exemple :

source: Eric Meyer's CSS design:
fr: CSS design par Eric Meyer :

source: A designer's experience:
fr: Une expérience de designer :

source: An XHTML/CSS based site:
fr: Un site XHTML/CSS :

source: Why would people not just use the same browser? It'd fix problems
fr: Pourquoi tout le monde n'utilise pas le même navigateur ? Cela résoudrait les problèmes

source: There's many reasons why people don't use the same program to achieve the same task. Those reasons are pretty much the same as why we are not all dressed the same way or don't own the same brand and model of cars.
fr: Il y a plusieurs raisons qui font que tout le monde n'utilise pas le même programme pour accomplir la même tâche. Ces raisons sont similaires à celles qui font que nous ne sommes pas tous habillés pareil ou que nous n'avons pas tous la même voiture.

source: Those reasons are:
fr: Ces raisons sont les suivantes :

source: Personal tastes: one may like a browser's look but not the other, prefer the way options and features are integrated or their availability.
fr: Goûts personnels : quelqu'un peut aimer le look d'un navigateur mais pas d'un autre, préférer la façon dons les options et fonctionnalités sont intégrées.

source: Technically: some products are supperior to others, either on security, feature support, stability or performance. This evolves pretty quickly and a good browser may become obsolete in a short amount of time.
fr: Techniquement : certains produits sont techniquement supérieurs à d'autres, sur la sécurité, les fonctionnalités, la stabilité ou la performance. Ceci évolue assez vite et un bon navigateur peut devenir obsolète rapidement.

source: Availability: one browser may simply not be available on the platform used. Not everyone uses a Mac, Windows or even a computer to access the internet. Hand-held devices became so popular they're by now more numerous than personal computers (in Japan, most of internet access are not done through computers anymore but through PDAs, cellular phones and other kind of hand-held devices).
fr: Disponibilité : un navigateur peut tout simplement ne pas être disponible sur la plate-forme utilisée. Tout le monde n'utilise pas un Mac, Windows ou même un ordinateur pour accéder à internet. Les PDAs deviennent tellement populaires qu'ils sont plus nombreux que les ordinateurs (au Japon, la plupart des accès à internet ne sont pas effectués via des ordinateurs, mais via des PDA, téléphones cellulaires ou tout autre type de dispositif tenu dans la main).

source: Accessibility: disabled people can't use the same programs, simply because those programs are not at all adapted to their needs. Does this mean we should ban disabled people from the Web?
fr: Accessibilité : les personnes handicapées ne peuvent pas utiliser les mêmes programmes, simplement parce qu'ils ne sont pas adaptés à leurs besoins. Cela signifie-t-il pour autant que l'on doit bannir les personnes handicapées d'internet ?

source: Create your own site: the basic tips
fr: Création de votre propre site : les conseils de base

source: If you plan to write a new site from scratch, then it is highly adviced to use XHTML to write it. Don't be afraid, XHTML is pretty close to traditional HTML except on some major points.
fr: Si vous projetez d'écrire votre site à partir de zéro, alors il est fortement recommandé d'utiliser XHTML pour l'écrire. Ne soyez pas effrayé, XHTML est assez proche du traditionnel HTML excepté sur quelques points majeurs.

source: First, in XHTML, the layout & style are separeted from the content. Basically, XHTML pages only stored the content of your site and the style is stored in CSS pages. This means you should not use any &lt;font&gt; tags for text rendering and avoid using tables for the layout.
fr: Premièrement, dans XHTML, la mise en page et le style sont séparés du contenu. En fait, les pages XHTML n'ont que le contenu de votre site et le style est stocké dans des pages CSS. Cela signifie que vous ne devriez pas utiliser de balise &gt;font&lt; pour le texte et éviter les tables pour la mise en page.

source: The other main difference with HTML is that tags are case-sensitive and must be written in lower case (&lt;strong&gt; is correct, &lt;STRONG&gt; is not). Also, each tag opened must be closed (&lt;p&gt;&lt;/p&gt; is correct, &lt;p&gt; is not).
fr: L'autre différence avec HTML est que les balises sont sensibles à la casse et doivent être écrites en minuscules (&lt;strong&gt; est correct, &lt;STRONG&gt; ne l'est pas). De plus, chaque balise ouverte doit être fermée (&lt;p&gt;&lt;/p&gt; est correct, &lt;p&gt; ne l'est pas).

source: Tutorials about XHTML and CSS are available at http://www.w3schools.com. Practical CSS examples are available at digital-web.com, thenoodleincident.com and pompage.net (in French).
fr: Des tutoriels sur XHTML et CSS sont disponibles sur http://www.w3schools.com. Des exemples pratiques de CSS sont disponibles sur digital-web.com, thenoodleincident.com pompage.net (en français).

source: XHTML and CSS are not a problem for old browsers. The code they don't understand will simply be ignored and won't cause troubles accessing the site. Only the layout/design may be altered, but the site's content stays fully readable.
fr: XHTML et CSS ne sont pas un problème pour les navigateurs anciens. Le code qu'ils ne comprennent pas sera simplement ignoré et n'engendrera pas de problème pour accéder au site. Seul la mise en page sera affectée, mais le contenu restera lisible.

source: P.S.: don't lose your time with Internet Explorer 4 and Netscape 4 browsers, they're not conform at all, and should be forgotten forever.
fr: P.S. : ne perdez pas votre temps avec les navigateurs Internet Explorer 4 et Netscape 4, ils ne sont pas conformes du tout et doivent être oubliés pour toujours.

source: Contact the webmasters of problematical sites
fr: Contacter les webmasters des sites posant problème

source: See <a href="%(url_letters)s">here</a> for template letters.
fr: Voir <a href="%(url_letters)s">ici</a> pour les modèles de lettres.

source: What can I do to help?
fr: Que puis-je faire pour aider ?

source: You can contact webmasters of problematical websites and inform them about the troubles you encounter. There is some standard pre-written letters.
fr: Vous pouvez contacter les webmasters des sites posant problème et informez les des difficultés que vous rencontrez. Il y a des lettres pré-écrites.

source: What are red crosses near website title?
fr: Que signifient les croix rouges à coté du nom d'un site ?

source: This is severity of problem:
fr: Il s'agit de la sévérité du problème :

source: 1 = low: render is bad
fr: 1 = faible : le rendu est mauvais

source: 2 = medium: part of website not accessible
fr: 2 = moyen : une partie du site n'est pas accessible

source: 3 = high: entire website not accessible
fr: 3 = haute : le site entier n'est pas accessible

source: I found an interesting website in the list, is it possible to keep me informed when some changes are made on this website?
fr: J'ai trouvé un site intéressant dans la liste, est-il possible d'être informé dès qu'il y a du changement pour ce site ?

source: Yes!
fr: Oui !

source: You can enter your mail on detail page for each website you want to be informed about.
fr: Vous pouvez entrer votre mail sur la page de détail des sites pour lesquels vous souhaitez être informés.

source: I've seen some days ago a website in blacklist, and today I can't find it again! Where is it?
fr: J'ai vu un site il y a quelques jours et aujourd'hui je ne le trouve plus ! Où est-il passé ?

source: Website was probably fixed so it is in "whitelist". Click on appropriate link on homepage to see fixed websites.
fr: Le site a probablement été corrigé et est donc dans la "liste blanche". Cliquez sur le lien approprié sur la page d'accueil pour voir les sites corrigés.

source: If website is nowhere, please mail webmaster.
fr: Si le site n'est plus nulle part, merci d'envoyer un e-mail au webmaster.

source: I created alerts for 150 websites, I want to remove all, how can I do?
fr: J'ai créé des alertes pour 150 sites, mais je souhaite tout enlever, comment faire ?

source: You can remove them one by one. To remove all, send mail to webmaster with your mail in body, it will be removed ASAP.
fr: Vous pouvez les enlever une par une. Pour tout enlever, envoyez un mail au webmaster en précisant votre mail, la suppression sera effectuée dès que possible.

source: I know a website which has invalid code, but display is ok with all browsers/OS, can I submit it?
fr: Je connais un site qui a du code invalide, mais l'affichage est OK avec tous les navigateurs/OS, puis-je le soumettre ?

source: No, we're blacklisting websites with problems (render/access) with some browsers/OS.
fr: Non, nous blacklistons seulement les sites posant problème (affichage/accès) avec certains navigateurs/OS.

source: Website I submitted is rejected, why?
fr: Le site que j'ai soumis est rejeté, pourquoi ?

source: Many possible reasons:
fr: Plusieurs raisons possibles sont :

source: We could not reproduce the bug/annoyance. Thus we can't certify there's really a problem with the website.
fr: Nous ne pouvons pas reproduire le bug/problème. Donc nous ne pouvons pas certifier qu'il y a réellement un problème avec ce site.

source: The website is badly designed, hard to navigate but the reason isn't due to a will to prevent people from accessing it with a define browser or OS but only because of misconception (e.g. anyone suffers the same problems). Such a website would rather find its place in a "crappy websites" list.
fr: Le site est mal écrit, difficile pour la navigation mais il n'y a pas volonté de bloquer des personnes en fonction de leur navigateur ou système d'exploitation, il ne s'agit que d'une mauvaise conception (tout le monde souffre du même problème). Un tel site trouverait plutôt sa place dans une liste de "sites mauvais".

source: we do not list "Flash-only" websites for the only reason it's all made of Flash and requires a specific plug-in. If the website relies on Flash for presentation/decoration purpose only and blocks visitors because of this, then we'll list the website and contact its webmaster.
fr: Nous ne listons pas les sites en "Flash" uniquement" car ils nécessitent un plug-in spécifique. Si le site repose sur Flash pour la présentation/décoration seulement et qu'il bloque les visiteurs à cause de cela, alors nous listerons le site et nous contacterons son webmaster.

source: it's not a government or company's website. We do not list personal websites here.
fr: Il ne s'agit pas d'un site gouvernemental ou d'une entreprise, nous ne listons pas les sites personnels ici.

source: Anyway you'll receive a mail with reject reason.
fr: Dans tous les cas, vous serez prévenu par mail avec la raison du refus.

source: I submitted website some days ago. It isn't in the list and I have no news, what's happening?
fr: J'ai soumis un site il y a quelques jours. Il n'est pas dans la liste et je n'ai pas de nouvelle, que se passe-t-il ?

source: We need some time to test website with all OS and browsers. Moreover, webmaster is contacted, and we're waiting for his answer before adding website.
fr: Nous avons besoin de temps pour tester le site avec tous les OS et navigateurs. De plus le webmaster du site est contacté et nous attendons sa réponse avant d'ajouter le site.

source: Following steps must be done before displaying website in blacklist:
fr: Les étapes suivantes doivent être effectuées avant qu'un site soit affiché dans la liste noire :

source: reproduce problem (approx. delay: 1 day to 1 week)
fr: reproduction du problème (délai approximatif : 1 jour à 1 semaine)

source: send mail to webmaster and wait for reply (approx. delay: 1 to 3 weeks)
fr: envoi d'un mail au webmaster du site et attente de la réponse (délai approximatif : 1 à 3 semaines)

source: if webmaster doesn't want to modify website, it is blacklisted.
fr: si le webmaster ne veut pas modifier son site, il entre dans la liste noire.

source: Since your website will be accepted or rejected, you'll receive a mail.
fr: Dès que votre site sera accepté ou rejeté, vous recevrez un mail.

source: Why W3Blacklist?
fr: Pourquoi W3Blacklist ?

source: The World Wide Web has been created to ensure anyone can freely access information and share it. Some people or companies forget this goal and create websites that can only be accessed through a defined browser, operating system, or both.
fr: Le "World Wide Web" a été créé pour s'assurer que chacun puisse librement accéder à l'information et la partager. Certaines personnes oublient ce but et créént des sites qui ne sont accessibles que depuis un navigateur, un OS, ou bien les deux.

source: W3Blacklist is listing websites (companies, government or organizations; not personal pages) that discriminate visitors according to their operating system or web browser. Webmaster is contacted before adding website to this list. Our goal is that webmaster modify page to be readable by all, whatever browser or OS used.
fr: W3Blacklist liste les sites (commerciaux, gouvernementaux ou organisations ; pas de pages personnelles) qui discriminent les visiteurs selon leur système d'exploitation ou leur navigateur internet. Le webmaster est contacté avant d'ajouter le site à cette liste. Notre but est de faire modifier la page par le webmaster afin que tout le monde puisse la lire, quel que soit le navigateur et l'OS utilisés.

source: To help us you can submit website with problem or mail webmasters for websites in database.
fr: Pour nous aider vous pouvez soumettre un site qui pose problème ou envoyer des mails aux webmasters des sites de la base.

source: W3BlackList is released under the terms of the GNU General Public License version 3.
fr: W3BlackList est distribué sous licence GNU General Public License version 3.

source: Status:
fr: Statut :

source: <strong>%(count_blacklist)s</strong> blacklisted sites
fr: <strong>%(count_blacklist)s</strong> sites sur liste noire

source: <strong>%(count_fixed)s</strong> sites fixed
fr: <strong>%(count_fixed)s</strong> sites corrigés

source: <strong>%(count_approval)s</strong> waiting for approval (<strong>%(count_pending_approval)s</strong> in test by w3blacklist team, <strong>%(count_waiting_response)s</strong> waiting for a response from the webmaster).
fr: <strong>%(count_approval)s</strong> en attente d'approbation (<strong>%(count_pending_approval)s</strong> en test par l'équipe w3blacklist, <strong>%(count_waiting_response)s</strong> en attente d'une réponse du webmaster).

source: Blacklist
fr: Liste noire

# plural
source: Fixed
fr: Corrigés

source: Website has been fixed
fr: Le site a été corrigé

source: Problem:
fr: Problème :

source: Added:
fr: Ajouté :

source: Updated:
fr: Mis à jour :

source: Browsers
fr: Navigateurs

source: Website is OK with %(browser)s
fr: Le site est OK avec %(browser)s

source: Website doesn't work with %(browser)s
fr: Le site ne fonctionne pas avec %(browser)s

source: Website is OK with %(os)s
fr: Le site est OK avec %(os)s

source: Website doesn't work with %(os)s
fr: Le site ne fonctionne pas avec %(os)s

source: unknown
fr: inconnu

source: Sent to webmaster:
fr: Envoyé au webmaster :

source: No e-mails sent to webmaster.
fr: Pas d'e-mail envoyé au webmaster.

source: Received from webmaster:
fr: Reçu du webmaster :

source: No e-mails received from webmaster.
fr: Pas d'e-mail reçu du webmaster.

source: Comments
fr: Commentaires

source: Anonymous comment
fr: Commentaire anonyme

source: Back to blacklist
fr: Retour à la liste noire

source: Back to fixed sites
fr: Retour aux sites corrigés

source: Blacklisted websites
fr: Sites sur liste noire

source: Fixed websites
fr: Sites corrigés

source: Website
fr: Site

source: website fixed
fr: site corrigé

source: <strong>WeeChat</strong> is a fast, light and extensible chat client, with a text-based user interface.
fr: <strong>WeeChat</strong> est un client de discussion rapide, léger et extensible, avec une interface texte.

source: It is released under the terms of the GNU General Public License version 3.
fr: Il est distribué sous licence GNU General Public License version 3.

source: <strong>Important:</strong> since 2009, the official WeeChat website has moved to <a href="%(url_weechat)s">%(url_weechat)s</a>.
fr: <strong>Important :</strong> depuis 2009, le site officiel de WeeChat a été déplacé vers <a href="%(url_weechat)s">%(url_weechat)s</a>.

source: This version is <strong>0.0.3-pre2</strong>.
fr: Cette version est la <strong>0.0.3-pre2</strong>.

source: Added ./configure script, code cleanup & secured.
fr: Ajout du script ./configure, nettoyage et sécurisation du code.

source: WeeWM on Savannah:
fr: WeeWM sur Savannah :

source: <strong>WeeWM</strong> is a fast and ultra light window manager for XFree.
fr: <strong>WeeWM</strong> est un gestionnaire de fenêtres ultra léger pour XFree.

source: Madam, Sir, I have tested your website ([[URL]]) with various standard-compliant browsers, including Mozilla/Firefox and [[ANY OTHER W3C COMPLIANT BROWSER AFFECTED]]. And in the current state of things, your website does not work well (or at all) with those browsers. Problem is the following: [[PROBLEM DESCRIPTION]]. [[HOW TO FIX IT (OPTIONAL)]] By fixing this problem you allow your visitors to enjoy the content and services you offer. You probably know that Microsoft will not release any other version of Internet Explorer for Windows as a standalone application, but as part of each new release of Windows, which mean IE's next version is due on 2006 along with Windows "Vista". Until then, IE won't benefit from any technical improvement and is naturally going to loose marketshare to actively developed and more standard-compliant browsers such as Mozilla, Opera and Safari. By supporting Mozilla Gecko (the most W3C standard-compliant rendering engine to date), you also allow other browsers respectful of standards (Firefox, Camino, Epiphany, Galeon, Konqueror, Opera, Safari, etc.) to use your website, and therefore widen your audience. A XitiMonitor inquire shows that today almost 15% of net surfers are using Mozilla/Firefox everywhere in Europe (http://www.xitimonitor.com/etudes/equipement7.asp). I would like to hear from you regarding when you plan modifying your website to make it compatible. Best regards. [[SIGNATURE]]
fr: Madame, Monsieur, J'ai testé votre site ([[URL]]) avec différents navigateurs conformes aux standards, dont Mozilla/Firefox et [[AUTRES NAVIGATEURS CONFORMES W3C AFFECTÉS]]. Il se trouve que dans l'état actuel des choses, votre site fonctionne mal (ou pas du tout) avec ces navigateurs. Le problème est le suivant : [[DESCRIPTION DU PROBLÈME]]. [[COMMENT LE CORRIGER (FACULTATIF)]] En réglant ce problème vous permettez à vos utilisateurs d'apprécier le contenu et les services que vous offrez. Vous savez probablement que Microsoft ne fournira plus de nouvelle version d'Internet Explorer pour Windows en tant qu'application séparée, mais de manière indissociable et uniquement disponible avec les futures versions de Windows. Cela induit que la prochaine version d'IE sortira courant 2006, avec Windows "Vista". D'ici là, IE ne bénéficiera d'aucune amélioration technique et perdra naturellement des parts de marché face aux navigateurs activement développés et plus respectueux des standards que sont Mozilla, Opera ou Safari. En offrant le support de Mozilla Gecko (le moteur le plus conforme aux standards du W3C à l'heure actuelle), vous permettez aussi aux autres navigateurs respectant les standards (Firefox, Camino, Epiphany, Galeon, Konqueror, Opera, Safari, etc.) d'accéder à votre site, et vous élargissez d'autant votre audience. Une enquête XitiMonitor montre qu'aujourd'hui près de 15% des internautes utilisent Mozilla/Firefox partout en Europe (http://www.xitimonitor.com/etudes/equipement7.asp). Je souhaiterais être informé lorsque vous aurez modifié le site pour le rendre compatible. Veuillez agréer, Madame, Monsieur, l'expression de mes sentiments les meilleurs. [[SIGNATURE]]
