Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Not possible to perform a search: empty page.
fr: Impossible de faire une recherche : page vide.

source: CSS specific to Internet Explorer
fr: CSS spécifique à Internet Explorer

source: The RTBF website (and derivated websites for radio/TV) uses a CSS style which is removing left and upper margin in Internet Explorer, using the following style: BODY { margin:-8; } In other browsers, this causes a truncated upper/left menu. The webmaster has been notified in Autumn 2004 and January 2005, without answer.
fr: Le site de la RTBF (et sites dérivés des différentes radio/télés) utilisent un style CSS visant à supprimer les marges gauche et haut dans Internet Explorer en définissant le style suivant : BODY { margin:-8; } Dans les autres navigateurs cela implique un menu supérieur et/ou un menu latéral gauche coupé. Le webmester a déjà été notifié en automne 2004 puis en janvier 2005, sans réponse.

source: Problem loading page
fr: Problème de chargement de page

source: The website works only with Internet Explorer, unusable with Opera, Firefox and Netscape.
fr: Le site ne fonctionne bien que sous Internet Explorer, il est inutilisable sous Opera, Firefox et Netscape.

source: Links are working only with Internet Explorer
fr: Les liens ne fonctionnent qu'avec Internet Explorer

source: All website links (left menu or links at the bottom of page) are working only with Internet Explorer.
fr: Tous les liens du site (menu de gauche ou liens en bas de page) ne fonctionnent que sous Internet Explorer.

source: Empty page with Linux
fr: Page vide avec Linux

source: With Linux, the page is empty. No answer received.
fr: Sous Linux, la page d'accueil n'affiche rien. Aucune réponse reçue.

source: Login required Internet Explorer
fr: Le login nécessite Internet Explorer

source: Message displayed after a login attempt if the browser is not Internet Explorer: "Pour vous déplacer sur les Solutions bancaires par Internet, n'utilisez jamais les commandes de votre fureteur ou vos favoris. Afin de réduire les risques d'erreur, utilisez uniquement les commandes situées dans la marge de gauche ou dans la barre de navigation du haut de l'écran."
fr: Message affiché après la tentative de connexion si le navigateur n'est pas Internet Explorer : "Pour vous déplacer sur les Solutions bancaires par Internet, n'utilisez jamais les commandes de votre fureteur ou vos favoris. Afin de réduire les risques d'erreur, utilisez uniquement les commandes situées dans la marge de gauche ou dans la barre de navigation du haut de l'écran."

source: Not possible to browser the website without Internet Explorer on Windows.
fr: Impossible de naviguer sur le site sans Internet Explorer sous Windows.

source: With Linux, like Windows (without Internet Explorer), the site is completely broken (tested with Mozilla, Konqueror and Opera): only the left quarter is displayed. No answer from the webmaster.
fr: Sous Linux comme Windows (sans Internet Explorer), le site est inutilisable (testé avec Mozilla, Konqueror et Opera) : seul le quart gauche du site est affiché. Aucune réponse du webmaster contacté.

source: "The site requires that you use Internet Explorer 5.x. We have detected that you use a browser other than this. To take full advantage of IndustryAnswers.com, please use Internet Explorer 5.x. You can download the most current verison by visiting www.microsoft.com/windows/ie/" *** Updated on 2009-05-02 *** Website fixed.
fr: "The site requires that you use Internet Explorer 5.x. We have detected that you use a browser other than this. To take full advantage of IndustryAnswers.com, please use Internet Explorer 5.x. You can download the most current verison by visiting www.microsoft.com/windows/ie/" *** Mise à jour le 02/05/2009 *** Site corrigé.

source: "The MetLife India Website is not compatible with the browser that you have!! Please switch to Microsoft Internet Explorer Ver. 5.0 or Higher." *** Updated on 2009-05-02 *** Website fixed.
fr: "The MetLife India Website is not compatible with the browser that you have!! Please switch to Microsoft Internet Explorer Ver. 5.0 or Higher." *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Not possible to listen to the radio streaming with Linux
fr: Streaming radio impossible à écouter sous Linux

source: The online version of radio is accessible only in the WMP format, which is not compatible with Linux/Unix. *** Updated on 2005-01-16 *** Website is OK with Mozilla Firefox 1.0 + MPlayer plugin.
fr: La version en ligne de la radio n'est accessible qu'au format WMP, ce qui n'est pas compatible avec Linux/Unix. *** Mise à jour le 16/01/2005 *** Le site est OK avec Mozilla Firefox 1.0 + plugin MPlayer.

source: Message displayed: " Vous ne pouvez pas entrer dans le Juke-Box Wanadoo car votre ordinateur n'a pas la configuration adéquate: * Windows Internet Explorer 6.0 ou supérieur * Lecteur Windows Media Version 9 ou supérieur * Windows 98 SE, ME, 2000 ou XP" No answer from Wanadoo.
fr: Le message affiché est le suivant : " Vous ne pouvez pas entrer dans le Juke-Box Wanadoo car votre ordinateur n'a pas la configuration adéquate: * Windows Internet Explorer 6.0 ou supérieur * Lecteur Windows Media Version 9 ou supérieur * Windows 98 SE, ME, 2000 ou XP" Pas de réponse de Wanadoo.

source: Message displayed: "Votre configuration ne vous permet pas d'accéder à notre service. Reportez vous aux informations ci dessous pour connaître le profil minimum. Système d'exploitation Windows 98 Seconde Edition ou plus récent Windows 95, Windows 98 Première Edition, Windows NT, MacOs et Linux ne sont pas supportés. Navigateur Internet Internet Explorer version 6.0 ou plus récent Télécharger la dernière version d'Internet Explorer. Lecteur windows média Windows Media Player version 9 ou plus récent Télécharger la dernière version de Windows Media Player." No answer from Wanadoo.
fr: Message affiché : "Votre configuration ne vous permet pas d'accéder à notre service. Reportez vous aux informations ci dessous pour connaître le profil minimum. Système d'exploitation Windows 98 Seconde Edition ou plus récent Windows 95, Windows 98 Première Edition, Windows NT, MacOs et Linux ne sont pas supportés. Navigateur Internet Internet Explorer version 6.0 ou plus récent Télécharger la dernière version d'Internet Explorer. Lecteur windows média Windows Media Player version 9 ou plus récent Télécharger la dernière version de Windows Media Player." Pas de réponse de Wanadoo.

source: Broken layout with Opera
fr: Mise en page cassée avec Opera

source: The layout is broken with Opera: menus/info overlap. Navigation is possible but very hard. No way to contact them if we are not a customer.
fr: La mise en page est catastrophique avec Opera : des menus/infos se superposent. Il est possible mais très difficile de naviguer dans le site. Aucun moyen de les contacter si l'on est pas client.

source: Playing online is possible with Internet Explorer only
fr: Le jeu en ligne n'est possible qu'avec Internet Explorer

source: Following message: "Conditions requises pour s'inscrire (…) - Disposer d'un PC, Windows 95, 98, Millenium, XP, NT, 2000 ou plus, Pentium II ou plus, équipé d'un navigateur Microsoft Internet Explorer 4.01 et plus ou Netscape 4.xx." *** Updated on 2006-06-11 *** The website has been updated and is now compatible with: "Internet Explorer à partir de la version 5.5, AOL à partir de la version 8.0 et Firefox v1.0 et suivants". Flash 7 or higher is required to play. Tested, OK with Firefox 1.5.0.4 on GNU/Linux Debian.
fr: Message suivant: "Conditions requises pour s'inscrire (…) - Disposer d'un PC, Windows 95, 98, Millenium, XP, NT, 2000 ou plus, Pentium II ou plus, équipé d'un navigateur Microsoft Internet Explorer 4.01 et plus ou Netscape 4.xx." *** Mise à jour le 11/06/2006 *** Le site a été mis à jour et est désormais compatible avec: "Internet Explorer à partir de la version 5.5, AOL à partir de la version 8.0 et Firefox v1.0 et suivants". Il faut néanmoins Flash 7 ou supérieur pour jouer. Testé ok avec Firefox 1.5.0.4 sous GNU/Linux Debian.

source: Warning message for any browser different from Internet Explorer
fr: Message d'avertissement pour tout navigateur autre qu'Internet Explorer

source: When connecting to the website with a browser different from Internet Explorer, the following message is displayed after the Flash animation: "Our site has been developed and optimized for Microsoft Internet Explorer 5+ under Windows. Unfortunately, it does not seem to run on your computer. Feel free to contact us by email or phone and we'll gladly send you an information package by the traditional postal way. Note to Linux- and related activists : We know that trough the fact that our site only works correctly under Microsoft software, some 10% of the internet community will not be able to enjoy full surfing pleasure. Nevertheless, we DO NOT force anyone to do so, thus not forcing anyone to install Microsoft software. Nevertheless, if this seems unbearable to you, we will of course send you our files and scripts in order to allow you to set up a version of our site running under linux/netscape/opera/etc. by the way : we do not run Microsoft Server Software -- [ CLICK HERE TO ENTER ANYWAY ] --" The button "Click here to enter anyway" is a good thing: the website is correctly displayed.
fr: Si on se connecte au site avec autre chose qu'Internet Explorer, on est confronté, après l'animation flash, au message suivant : "Our site has been developed and optimized for Microsoft Internet Explorer 5+ under Windows. Unfortunately, it does not seem to run on your computer. Feel free to contact us by email or phone and we'll gladly send you an information package by the traditional postal way. Note to Linux- and related activists : We know that trough the fact that our site only works correctly under Microsoft software, some 10% of the internet community will not be able to enjoy full surfing pleasure. Nevertheless, we DO NOT force anyone to do so, thus not forcing anyone to install Microsoft software. Nevertheless, if this seems unbearable to you, we will of course send you our files and scripts in order to allow you to set up a version of our site running under linux/netscape/opera/etc. by the way : we do not run Microsoft Server Software -- [ CLICK HERE TO ENTER ANYWAY ] --" La présence du bouton "Click here to enter anyway" est une bonne chose : le site s'affiche normalement.

source: Unable to access to video archives
fr: Impossible d'accéder aux archives vidéos

source: The Windows Media Player plugin is required to access to new archives: "Sur France3.fr les nouvelles vidéos archivées sont désormais disponibles au format Windows Media Player. Pour optimiser votre consultation, téléchargez la dernière version. Les anciennes vidéos resteront accessibles en Real Media Player." *** Updated on 2004-12-28 *** Les nouvelles vidéos sont visualisables avec le plugin MPlayer pour Mozilla, cf: http://videojts.francetv.fr/player/aide.php
fr: Il faut le plugin Windows Media Player pour accéder aux nouvelles archives : "Sur France3.fr les nouvelles vidéos archivées sont désormais disponibles au format Windows Media Player. Pour optimiser votre consultation, téléchargez la dernière version. Les anciennes vidéos resteront accessibles en Real Media Player." *** Mise à jour le 28/12/2004 *** Les nouvelles vidéos sont visualisables avec le plugin MPlayer pour Mozilla, cf : http://videojts.francetv.fr/player/aide.php

source: Browser test with a JavaScript function: only Internet Explorer on Windows or Netscape 4 are allowed.
fr: Test du navigateur par une fonction JavaScript : seuls Internet Explorer sous Windows ou Netscape 4 sont autorisés.

source: Login page is not displayed
fr: La page de login ne s'affiche pas

source: The page contains a login form, but nothing is displayed with Konqueror and Mozilla/Firefox displays "undefined". The page is OK with Opera. Cause: utilisation of document.all and document.layers. *** Updated on 2009-05-02 *** Website fixed.
fr: La page contient un formulaire pour se loguer, mais rien ne s'affiche sous Konqueror et Mozilla/Firefox affiche "undefined". La page est OK sous Opera. Cause : utilisation de document.all et document.layers. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Message displayed on Linux and/or with a browser different from Internet Explorer: "Windows 95, Windows 98 Première Edition, Windows NT, MacOs et Linux ne sont pas supportés. Internet Explorer version 6.0 ou plus récent Windows Media Player version 9 ou plus récent." The contact form doesn't seem to work.
fr: Le message est affiché sous Linux et/ou avec un navigateur différent de Internet Explorer : "Windows 95, Windows 98 Première Edition, Windows NT, MacOs et Linux ne sont pas supportés. Internet Explorer version 6.0 ou plus récent Windows Media Player version 9 ou plus récent." Le formulaire de contact ne semble pas fonctionner.

source: Black page with a browser different from Internet Explorer
fr: Page noire pour un navigateur différent d'Internet Explorer

source: When choosing the language, if the user agent is not Internet Explorer, the page displayed is black. Problem with Mozilla/Firefox, Konqueror and Opera, on all operating systems. No answer from the webmaster.
fr: Après le choix de la langue, si le "user agent" n'est pas Internet Explorer, la page affichée est noire. Problème avec Mozilla/Firefox, Konqueror et Opera, sur tous les systèmes d'exploitation. Pas de réponse du webmaster.

source: Access refused with Mozilla/Firefox
fr: Accès refusé avec Mozilla/Firefox

source: The website refuses access with Mozilla/Firefox (Windows and Linux): only Internet Explorer 5 or higher are supported. Access is possible with Konqueror and Opera, but the layout is broken and we must scroll the page to see the website. When using Internet Explorer user agent, we can access to the website, but dynamic menus are not clickable (with Konqueror and Opera, submenus are not even displayed). No answer from webmaster.
fr: Le site refuse l'accès à Mozilla/Firefox (Windows et Linux) : seuls Internet Explorer 5 et supérieurs sont supportés. On peut tout de même accéder au site avec Konqueror et Opera mais là, la mise en page ne fonctionne pas et il faut descendre tout en bas de la scrollbar pour voir le site. En se faisant passer pour Internet Explorer, on peut accéder au site, mais il y a ensuite des problèmes avec les menus dynamiques sur lesquels on ne peut pas cliquer (dans Konqueror et Opera les sous-menus n'apparaissent même pas). Pas de réponse du webmaster.

source: Layers overlap with a browser different from Internet Explorer
fr: Calques superposés avec un navigateur différent de Internet Explorer

source: Layers are supposed to be displayed in the middle of the page, but are displayed on top right with Safari. No answer from webmaster. *** Updated on 2006-05-03 *** Website now managed by Alice Adsl, fixed.
fr: Des calques qui doivent s'afficher au milleu de la page s'affichent en haut à droite empilé l'un sur l'autre sous Safari. Pas de réponse du webmaster. *** Mise à jour le 03/05/2006 *** Site repris par Alice Adsl, corrigé.

source: Navigation issues with all browsers
fr: Problèmes de navigation avec tous les navigateurs

source: URL not found with Mozilla and Konqueror, top menus are not working with Opera. Even with Internet Explorer, there are JavaScript errors for the top menu and it is not possible to change page. No answer from webmaster.
fr: URL non trouvée avec Mozilla et Konqueror, les menus du haut ne fonctionnent pas avec Opera. De plus, même avec Internet Explorer, il y a des erreurs JavaScript pour le menu du haut et il est impossible de changer de page. Pas de réponse du webmaster.

source: To access the website, a PC is required with: Windows 2000 or XP, Internet Explorer (version 6.0 or higher), Windows Media Player (version 9.0 or higher), Flash (version 5 or higher).
fr: Pour accéder au site il faut un PC utilisant Windows 2000 ou XP, Internet Explorer (version 6.0 ou mieux), de Windows Media Player (version 9.0 ou mieux), Flash (version 5 ou mieux).

source: Problems with registration and search
fr: Problèmes avec l'inscription et la recherche

source: The registration is possible only with Internet Explorer. The search result is empty with FireFox/Mac.
fr: L'inscription n'est possible qu'avec Internet Explorer. Le résultat de la recherche est vide avec FireFox/Mac.

source: Only Internet Explorer and Firefox are allowed
fr: Seuls Internet Explorer et Firefox sont autorisés

source: Access to the website is blocked, except with Internet Explorer and Firefox. Konqueror and Opera are blocked.
fr: L'accès au site est bloqué, sauf avec Internet Explorer and Firefox. Konqueror et Opera sont bloqués.

source: Menu works only with Internet Explorer
fr: Le menu fonctionne seulement avec Internet Explorer

source: The menu works only with Internet Explorer, so a large part of the website is not accessible.
fr: Le menu ne fonctionne que sous Internet Explorer, donc une large partie du site n'est pas accessible.

source: The website redirects to a page inviting to download Internet Explorer (version 6.0). It is mentioned that no operating system is supported except Windows.
fr: Le site nous renvoie systématiquement sur une page nous invitant à télécharger Internet Explorer (version 6.0). Il est également bien précisé qu'aucun système n'est supporté en dehors de Windows.

source: The following is displayed with any browser except Internet Explorer: "ERROR PAGE Ce site ne fonctionne qu'avec Microsoft Internet Explorer à partir de la version 5.5."
fr: L'erreur suivante est affichée avec tous les navigateurs sauf Internet Explorer : "ERROR PAGE Ce site ne fonctionne qu'avec Microsoft Internet Explorer à partir de la version 5.5."

source: Menus not working with Mozilla and Konqueror
fr: Les menus ne fonctionnent pas avec Mozilla et Konqueror

source: When clicking on button "Je crée mon entreprise", there is an error, according to the browser: - Mozilla/Firefox: first line only - Konqueror: nothing - Opera and Internet Explorer: menus are OK.
fr: Lorsque l'on clique sur le bouton "Je crée mon entreprise", on a accès selon le navigateur : - Mozilla/Firefox : à la première ligne uniquement - Konqueror : rien du tout - Opera et Internet Explorer : les menus sont OK.

source: Page not found with Konqueror and Opera
fr: Page introuvable avec Konqueror et Opera

source: Not possible to enter on the website with Konqueror and Opera: redirection to the page http://www.joueclub.fr/boutique/includes/upgrade.html If the user agent is modified, the access is possible but menus are not working.
fr: Impossible d'entrer sur le site avec Konqueror et Opera, redirection sur une page http://www.joueclub.fr/boutique/includes/upgrade.html Si le "user agent" est modifié, l'accès est possible mais les menus ne fonctionnent pas.

source: "Le service que vous souhaitez utiliser nécessite dans sa configuration actuelle le navigateur Internet Explorer de Microsoft, à partir de sa version 5. Vous pouvez télécharger le navigateur Internet Explorer 6.0 pour Windows ou Internet Explorer 5.2 pour Mac OS suivant votre configuration." If the user agent is set to Internet Explorer, the access seems OK with Mozilla/Firefox, Konqueror and Opera (to be confirmed).
fr: "Le service que vous souhaitez utiliser nécessite dans sa configuration actuelle le navigateur Internet Explorer de Microsoft, à partir de sa version 5. Vous pouvez télécharger le navigateur Internet Explorer 6.0 pour Windows ou Internet Explorer 5.2 pour Mac OS suivant votre configuration." En s'identifiant comme IE, l'accès semble ok avec Mozilla/Firefox, Konqueror et Opera (à confirmer que l'envoi marche bien).

source: Menus not working with Mozilla
fr: Les menus ne fonctionnent pas avec Mozilla

source: Website optimized for Internet Explorer. For Netscape, changes are in progress. With Mozilla/Firefox, top menus are not working. OK with Konqueror and Opera.
fr: Ce site est optimisé pour le navigateur Internet Explorer. Pour le navigateur Netscape des modifications sont en cours. Sous Mozilla/Firefox les menus du haut ne fonctionnent pas. OK sous Konqueror et Opera.

source: Error with Konqueror
fr: Erreur avec Konqueror

source: Access to the website is not possible with Konqueror: the error page says "Ce site nécessite des versions plus récentes de votre navigateur."
fr: L'accès au site est impossible pour les utilisateurs de Konqueror : la page d'erreur indique "Ce site nécessite des versions plus récentes de votre navigateur."

source: Source code displayed for definitions
fr: Affichage du code source des définitions

source: When clicking on a definition, the source code of page is displayed. Page is sent as text/plain. *** Updated on 2005-08-17 *** Website fixed.
fr: Lorsque l'on clique sur une définition, le code source de la page s'affiche. La page est envoyée en text/plain. *** Mise à jour le 17/08/2005 *** Site corrigé.

source: The following message is displayed if the browser is not Internet Explorer: "[ B i e n v e n u e ] sur le site de notre agence immobilière ! Le site est en cours d'optimisation pour les navigateurs tels que Netscape et Oracle. Nous vous prions, en attendant, de bien vouloir utiliser Internet Explorer…" (Oracle?…) *** Updated on 2010-02-02 *** Website fixed.
fr: Le message est le suivant si on n'accède pas au site avec Internet Explorer : "[ B i e n v e n u e ] sur le site de notre agence immobilière ! Le site est en cours d'optimisation pour les navigateurs tels que Netscape et Oracle. Nous vous prions, en attendant, de bien vouloir utiliser Internet Explorer…" (Oracle ?…) *** Mise à jour le 02/02/2010 *** Site corrigé.

source: Internet Explorer 5.5 only. Mozilla: only dynamic menus and some other links are displayed. Content is not accessible. Konqueror: content is displayed but layout is random. Dynamic menus are behind the plan and therefore not usable. Same remark for Opera. Pages layout is better though. *** Updated on 2004-11-27 *** OK with Firefox 1.0, still same problems with Konqueror 3.3.1 and Opera 7.54. *** Mise à jour le 04/12/2004 *** With Firefox 1.0, welcome page is not OK, but once the login/password are sent, the website is broken. Webmaster was contacted again today.
fr: Internet Explorer 5.5 seulement. Mozilla : seul les menus dynamiques et quelques autres liens s'affichent. Le contenu n'est pas accessible. Konqueror : le contenu s'affiche mais la présentation est aléatoire. Quant aux menus dynamiques, ils s'affichent derrière le "plan" du contenu et sont dès lors inexploitables. Même remarque pour Opera. La présentation des pages est légèrement meilleure toutefois. *** Mise à jour le 27/11/2004 *** OK avec Firefox 1.0, toujours les mêmes problèmes avec Konqueror 3.3.1 et Opera 7.54. *** Mise à jour le 04/12/2004 *** Sous Firefox 1.0, la page d'acceuil fonctionne bien mais une fois l'identifiant et le mot de passe rentrés tout le site est sans dessus dessous. Le webmaster a été relancé ce jour.

source: Browser detection limited to Internet Explorer 4+
fr: Détection de navigateur limité à Internet Explorer 4+
