Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Version 0.6-pre5 is now available. News for this version: - fix for Eicon modems, - updated documentation, - fix for configuration scripts, - PPPoE and IPoATM patches, - other fixes. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a> &bull; <a href="http://sourceforge.net/tracker/index.php?func=detail&amp;aid=634469&amp;group_id=30043&amp;atid=398083">PPPoE patch</a> &bull; <a href="http://sourceforge.net/tracker/index.php?func=detail&amp;aid=634472&amp;group_id=30043&amp;atid=398083">IPoATM patch</a>
fr: La version 0.6-pre5 est disponible. Les nouveautés sont les suivantes : - correction pour les modems Eicon, - documentation mise à jour, - correction sur les scripts de configuration, - patchs PPPoE et IPoATM, - diverses autres corrections. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a> &bull; <a href="http://sourceforge.net/tracker/index.php?func=detail&amp;aid=634469&amp;group_id=30043&amp;atid=398083">Patch PPPoE</a> &bull; <a href="http://sourceforge.net/tracker/index.php?func=detail&amp;aid=634472&amp;group_id=30043&amp;atid=398083">Patch IPoATM</a>

source: Mirror site
fr: Site miroir

source: For any download problem on the "Download" page, a mirror site has been added; you can download any driver version and all other files. &bull; <a href="/eciadsl/download/">EciAdsl download page</a> &bull; <a href="http://flashcode.free.fr/flashtux/eciadsl/">Mirror site</a>
fr: En cas de problème sur la page téléchargement, un site miroir a été ajouté, sur lequel vous pouvez également télécharger toutes les versions du driver et tous les autres fichiers. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a> &bull; <a href="http://flashcode.free.fr/flashtux/eciadsl/">Le site miroir</a>

source: Technical problem on "Your opinion" page
fr: Incident sur la page "Votre avis"

source: Due to a technical problem, opinion given on the "Your opinion" page, were not sent to me. If you gave your opinion, I ask you to give it again from this page. Please excuse me for this problem. FlashTux webmaster.
fr: Suite à un incident technique indépendant de ma volonté, les avis qui ont été saisis sur la page "Votre avis" ne me sont pas parvenus. Si vous aviez donné votre avis, je vous invite à retourner sur cette page pour le resoumettre à nouveau. Veuillez m'excuser pour la gêne occasionnée. Le webmaster FlashTux.

source: Added 3 providers
fr: Ajout de 3 fournisseurs

source: Providers Infostrada, Sunrize and Econophone have been added to eciconf.sh and eciconftxt.sh. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Les fournisseurs Infostrada, Sunrise et Econophone ont été rajoutés à eciconf.sh et eciconftxt.sh. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: Added new synch .bin (synch14.bin) &bull; <a href="/eciadsl/download/">Synchronization files</a>
fr: Ajout d'un nouveau .bin (synch14.bin) &bull; <a href="/eciadsl/download/">Fichiers de synchronisation</a>

source: Troubleshooting in French
fr: Troubleshooting en français

source: The TROUBLESHOOTING.fr file of CVS version now contains French version of problems of installation/configuration/use of driver with their solutions. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version.</a>
fr: Le fichier TROUBLESHOOTING.fr de la version CVS contient désormais la version française des problèmes courants d'installation/configuration/utilisation du driver avec les solutions correspondantes. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS.</a>

source: Current CVS is now 0.6-pre4, major updates are a new packaging scheme (using ./configure), and configuration tools massive updates (redesign, more modems added). Minor updates to the shipped documentation (see the INSTALL and TROUBLESHOOTING files). &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>.
fr: Le CVS actuel contient la pre-release 0.6-pre4. Des modifications importantes ont été apportées (outils de configuration: nouveaux modems, redesign) et un script de configuration ajouté (son usage est obligatoire). Voir les fichiers INSTALL.fr et TROUBLESHOOTING (pas encore disponibles en français). &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>.

source: Version 0.6-pre3 has been merged to CVS. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a> &bull; <a href="/eciadsl/screenshots/">Eciconf screenshots</a>
fr: La version 0.6-pre3 a été fusionnée au CVS. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a> &bull; <a href="/eciadsl/screenshots/">Captures d'écrans Eciconf</a>

source: New synch .bin files
fr: Nouveaux fichiers .bin de synchronisation

source: Three new .bin files addes for sync. &bull; <a href="/eciadsl/download/">Synchronization files</a>
fr: Trois nouveaux .bin ont été ajoutés pour la synchronisation. &bull; <a href="/eciadsl/download/">Fichiers de synchronisation</a>

source: Configuration script for console / terminal
fr: Script de configuration pour console / terminal

source: A configuration script (eciconftxt.sh) has been added. It is the same goal as eciconf.sh, but can be run in a console or a terminal. Moreover, it lets you modify quickly your .bin file to sync. This script is in the CVS version. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Un script de configuration (eciconftxt.sh) a été créé. C'est l'équivalent d'eciconf.sh mais il peut être lancé en console ou dans un terminal. Il permet de plus de changer rapidement de fichier .bin pour la synchronisation. Ce script est dans la version CVS. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: New synchronization file (.bin) has been added. Created by an English user (thanks Oliverthered). &bull; <a href="/eciadsl/download/">Synchronization files</a>
fr: Un nouveau fichier de synchronisation (.bin) a été ajouté, créé par un utilisateur anglais (merci Oliverthered). &bull; <a href="/eciadsl/download/">Fichiers de synchronisation</a>

source: Italian .bin has been added for sync. &bull; <a href="/eciadsl/download/">Synchronization files</a>
fr: Un .bin italien a été rajouté pour la synchronisation. &bull; <a href="/eciadsl/download/">Fichiers de synchronisation</a>

source: Added 3 supported modems
fr: Ajout de 3 modems supportés

source: 3 modems added into eciconf.sh, driver now runs with 11 different modems. &bull; <a href="/eciadsl/modems/">Supported modems</a> &bull; <a href="/eciadsl/screenshots/">Eciconf screenshot</a> &bull; <a href="/eciadsl/download/devel/">Download page (development version)</a>
fr: 3 modems ont été rajoutés dans eciconf.sh, le driver fonctionne désormais avec 11 modems différents. &bull; <a href="/eciadsl/modems/">Modems supportés</a> &bull; <a href="/eciadsl/screenshots/">Aperçu Eciconf</a> &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl (version de développement)</a>

source: CVS version patched for preventing LCP timeouts
fr: Version CVS patchée pour éviter les LCP timeouts

source: CVS version patched for preventing LCP timeouts is available for download. &bull; <a href="/eciadsl/download/devel/">Download page, CVS part</a>
fr: La version CVS patchée pour le problème des LCP timeouts est disponible. &bull; <a href="/eciadsl/download/devel/">Page téléchargement, section CVS</a>

source: English documentation for driver
fr: Documentation du driver en anglais

source: Driver's documentation has been translated to English (thanks to Red Prophet). &bull; <a href="/eciadsl/doc/">Documentation page (English)</a>
fr: La documentation du driver a été traduite en anglais (merci à Red Prophet). &bull; <a href="/eciadsl/doc/">Page documentation (en anglais)</a>

source: Documentation updated
fr: Mise à jour de la documentation

source: Driver's documentation has been updated. &bull; <a href="/eciadsl/doc/">Documentation page</a>
fr: La documentation du driver a été mise à jour. &bull; <a href="/eciadsl/doc/">Page documentation</a>

source: ECI win 1.06 driver for sniffing
fr: Driver win ECI 1.06 pour sniffer

source: ECI windows driver v1.06 has been added. Only this version lets you create a .bin file that linux driver can read correctly. &bull; <a href="/eciadsl/download/">Download page</a>
fr: Le driver windows v1.06 pour le modem ECI a été ajouté. Seule cette version permet de sniffer et de produire un fichier .bin qui sera utilisable par le driver Linux. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Added "Linux today's slogan"
fr: Ajout du "slogan Linux du jour"

source: The today's Linux slogan has been added on welcome page. It will change every day.
fr: Le slogan Linux du jour a été ajouté sur la page d'accueil. Comme son nom l'indique, il changera tous les jours.

source: Official opening of FlashTux.org!
fr: Ouverture officielle de FlashTux.org !

source: After one month of hard work, here is the new version of my webpage :) New features: - hosted by Tuxfamily with domain name :) - new graphics - best menu organization - new rubriks - etc. (I let you see by yourself!) I hope you'll enjoy surfing on my webpage as much as I envoyed to build it. You can give me your opinion on FlashTux.org without faltering. FlashCode.
fr: Après un mois de travail, voici un nouveau site, tout beau et qui sent encore le neuf :) Au menu : - nouvel hébergeur (Tuxfamily) avec nom de domaine propre :) - nouveaux graphismes - menus réorganisés - nouvelles rubriques - etc. (à vous de découvrir !) J'espère que vous prendrez autant de plaisir à le parcourir que j'en ai pris à le construire. N'hésitez surtout pas à me laisser votre avis sur la page "Avis" afin d'améliorer encore FlashTux.org. FlashCode.

source: Game section
fr: Section jeux

source: This section is composed by all games (except FlashTris). These are multi-players games (for almost all), and you can play against computers.
fr: Cette section regroupe tous les jeux (sauf FlashTris). Petits jeux auxquels vous pouvez la plupart du temps jouer à plusieurs et contre des ordinateurs.

source: Coding section ready
fr: Section Prog terminée

source: Coding section is ready. New features: - new database, - page for searching programs, - programs sorted by theme.
fr: La section Prog est terminée. Au menu : - base de données toute neuve, - possibilité de recherche des programmes, - classification par thèmes.

source: List of supported modems
fr: Liste des modems supportés

source: Added list of supported modems. Warning: this list corresponds to CVS version of driver (version 0.5 runs only with ECI modem). &bull; <a href="/eciadsl/modems/">Supported modems</a>
fr: Ajout de la liste des modems supportés. Attention, cette liste correspond à la version CVS du driver (la version 0.5 n'est compatible qu'avec le modem ECI). &bull; <a href="/eciadsl/modems/">Modems supportés</a>

source: Gmemo: let's go!
fr: Gmemo : c'est parti !

source: And let's go for Gmemo! Gmemo is an applet for remember your memos with cusomizable alarms. It displays date, hour, today's and tomorrow"s feat.
fr: Et c'est parti pour Gmemo ! Gmemo est une applet qui permet de vous rappeler tous vos mémos avec des alarmes paramétrables. Il affiche aussi la date, l'heure, la fête du jour et du lendemain.

source: Monsoult .bin file has been added. &bull; <a href="/eciadsl/download/">Download page</a>
fr: Le .bin de Monsoult a été ajouté. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Readme for graphical tool Eciconf
fr: Manuel pour l'outil graphique Eciconf

source: Readme for graphical tool Eciconf is written and included into the last version of driver. &bull; <a href="/eciadsl/download/">Download page</a>
fr: Le manuel pour l'outil graphique Eciconf est écrit et inclus dans la dernière version du driver. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Added graphical tool for config
fr: Ajout outil graphique pour la config

source: With Crevetor, a graphical tool to configure driver has been developed. This one is included into the last version of driver. &bull; <a href="/eciadsl/download/">Download page</a>
fr: En collaboration avec Crevetor, un outil graphique de configuration du driver a été développé en Tcl/Tk. Celui-ci est inclus dans la dernière version du driver. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Link to EciAdsl forum
fr: Lien vers forum EciAdsl

source: Added link to EciAdsl forum. &bull; <a href="http://eciadsl.sourceforge.net/scripts/forum">EciAdsl forum</a>
fr: Un lien vers le forum EciAdsl a été ajouté. &bull; <a href="http://eciadsl.sourceforge.net/scripts/forum">Forum EciAdsl</a>

source: Updated v0.4, added doc and tools
fr: Version 0.4 MAJ, ajout doc et outils

source: Version 0.4 has been updated. Documentation and missing tools have been added. &bull; <a href="/eciadsl/download/">Download page</a>
fr: La version 0.4 du driver a été mise à jour. La documentation et les outils manquants ont été ajoutés. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Updated Howto
fr: Howto mis à jour

source: Howto has been updated. &bull; <a href="/eciadsl/doc/">Howto</a>
fr: Le Howto a été mis à jour. &bull; <a href="/eciadsl/doc/">Howto</a>

source: Version 0.3 of driver has been released! &bull; <a href="/eciadsl/download/">Download page</a>
fr: La version 0.3 du driver est disponible. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: Added English Howto
fr: Ajout Howto anglais

source: English Howto has been added.
fr: Le Howto en anglais a été ajouté.

source: Flashcode's interview on Dslvalley
fr: Interview de FlashCode sur Dslvalley

source: FlashCode has been interviewed on DslValley. &bull; <a href="http://www.dslvalley.com/news/news.php3?id=259">Interview</a>
fr: FlashCode a été interviewé sur Dslvalley. &bull; <a href="http://www.dslvalley.com/news/news.php3?id=259">Interview</a>

source: RPM version
fr: Version RPM

source: Added RPM version (based on CVS sources). &bull; <a href="/eciadsl/download/">Download page</a>
fr: Ajout de la version RPM (basée sur les sources CVS). &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: 2nd version of driver
fr: 2ème version du driver

source: Second version of driver is available. &bull; <a href="/eciadsl/download/">Download page</a>
fr: La deuxième version du driver est disponible. &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: 1st version of driver!
fr: 1ère version du driver !

source: The first version of driver is available! You'll be able to connect (a few minutes) to the Internet. &bull; <a href="/eciadsl/download/">Download page</a>
fr: La toute première version du driver est disponible ! Elle permet de se connecter (un peu) à Internet ! &bull; <a href="/eciadsl/download/">Page téléchargement</a>

source: E-mail sent to ECI Telecom
fr: E-mail envoyé à ECI Telecom

source: An e-mail was sent to ECI Telecom for getting news. To be continued…
fr: Un e-mail de relance a été envoyé à ECI Telecom pour prendre des nouvelles. A suivre…

source: E-mail received from Ofer Reviv
fr: E-mail reçu de Mr Ofer Reviv

source: Mr Ofer Reviv (ECI Telecom) told us they were interested in the Linux driver and asked us to precise our needs. They will be back to us shortly on this.
fr: Mr Ofer Reviv (ECI Telecom) dit qu'ils s'intéressent au driver Linux et nous a demandé de préciser notre besoin. Il doit nous contacter très prochainement.

source: E-mail received from Thierry Berton
fr: E-mail reçu de Thierry Berton

source: He gave us the name of the person who was going to help us to contact their developers. News in next days…
fr: Nous avons désormais le nom de la personne à contacter pour entre en contact avec leurs développeurs. Du nouveau dans les prochains jours…

source: ECI driver FAQ
fr: FAQ sur le driver ECI

source: FAQ about this driver has been written: &bull; <a href="/eciadsl/faq">F.A.Q.</a>
fr: Une FAQ a été écrite sur le driver : &bull; <a href="/eciadsl/faq">F.A.Q.</a>

source: Answer from Thierry Berton
fr: Réponse de Thierry Berton

source: Answer from Thierry Berton, received on 2001/10/02: after some reunions into ECI Telecom, he will probably contact us again in one or two weeks.
fr: Réponse de Thierry Berton reçue le 02/10/2001 : des réunions vont avoir lieu en interne chez ECI Telecom et il devrait nous recontacter d'ici une à deux semaines.

source: Photos of Interop trade show with ECI Telecom
fr: Photos du salon Interop avec ECI Telecom

source: Photos of Interop trade show with ECI Telecom are available. &bull; <a href="/eciadsl/interop">Interop trade show photos</a>
fr: Les photos du salon Interop avec ECI Telecom sont disponibles. &bull; <a href="/eciadsl/interop">Photos salon Interop</a>

source: Mail sent to Thierry Berton
fr: Mail envoyé à Thierry Berton

source: A mail was sent to Thierry Berton, Sales manager of ECI Telecom France. Goal: to contact ECI Telecom driver development team.
fr: Un mail a été envoyé à Thierry Berton, directeur commercial du groupe ECI Telecom France. Objectif : entre en contact avec leurs développeurs de drivers.

source: Meeting with ECI Telecom
fr: Rencontre avec ECI Telecom

source: Meeting with ECI Telecom (Inovia Telecom) at Interop trade show in Paris. &bull; <a href="/eciadsl/interop">Interop meeting</a>
fr: Rencontre avec ECI Telecom (Inovia Telecom) au salon Interop à Paris. &bull; <a href="/eciadsl/interop">Salon Interop</a>

source: Petition for ECI Telecom
fr: Pétition pour ECI Telecom

source: Sign up petition for ECI Telecom! &bull; <a href="/eciadsl/petition">Petition for ECI Telecom</a>
fr: Signez la pétition pour ECI Telecom ! &bull; <a href="/eciadsl/petition">Pétition pour ECI Telecom</a>

source: Version 0.30 is available. FlashTris full source code is now available. Next version under construction: network for Windows version. &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.30 est disponible. Le code source de FlashTris est désormais disponible. Prochaine version en développement : réseau pour la version Windows. &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Logs are available!
fr: Les logs sont disponibles !

source: (Almost) all logs ara available! &bull; <a href="/files/eciadsl/logs.zip">logs.zip</a>
fr: (Presque) tous les logs sont disponibles ! &bull; <a href="/files/eciadsl/logs.zip">logs.zip</a>

source: Snoopy USB sniffer on Sourceforge
fr: Sniffeur USB Snoopy sur Sourceforge

source: Snoopy USB sniffer is available on Sourceforge: &bull; <a href="http://usbsnoop.sourceforge.net">http://usbsnoop.sourceforge.net</a>
fr: Le sniffeur USB Snoopy est disponible sur Sourceforge : &bull; <a href="http://usbsnoop.sourceforge.net">http://usbsnoop.sourceforge.net</a>

source: Mailing list is archived
fr: La mailing list est archivée

source: Thanks to ZeGuigui, mailing list is archived: &bull; <a href="http://liste.eci.free.fr">http://liste.eci.free.fr</a>
fr: Grâce à ZeGuigui, la mailing list est archivée : &bull; <a href="http://liste.eci.free.fr">http://liste.eci.free.fr</a>

source: Green LED is fixed under Linux!
fr: LED verte fixe sous Linux !

source: Thanks to Jean-Sebastien Valette, green LED is fixed under Linux! Work is going on…
fr: Grâce à Jean-Sebastien Valette, la LED verte est fixe sous Linux ! Le travail continue.…

source: First version of driver has been released! But you cannot today connect to the Internet with this version :-(
fr: La toute première version du driver est sortie ! Elle ne permet cependant pas de se connecter à Internet :-(

source: The two modem LED blink!
fr: Les deux LEDs du modem clignotent !

source: Both LED are powered under Linux, after sending firmware (saved under Windows) to modem. News in next days…
fr: Les deux LEDs sont allumées sous Linux, grâce à l'envoi du firmware (capturé sous Windows) au modem. Du nouveau dans les prochains jours…

source: URB sending test program
fr: Programme de test d'envoi des URB

source: Program for sending URB has been written. This will be base for communicating with modem.
fr: Un programme pour envoyer les URB a été écrit. Celui-ci servira de base au driver pour communiquer avec le modem.

source: First driver skeleton!
fr: Premier squelette de driver !

source: First driver skeleton has been written. Author: Jean-Sebastien Valette.
fr: Le premier squelette de driver a été écrit. Auteur : Jean-Sebastien Valette.

source: Beginning of the project
fr: Début du projet

source: EciAdsl peoject begins! Goal: connection to the net with Eci Hifocus ADSL USB modem.
fr: Le projet EciAdsl démarre ! Objectif : pouvoir se connecter à internet avec le modem ADSL USB Eci Hifocus.

source: Version 0.29 is available. Original Tetris music was added! &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.29 est disponible. La musique originale de Tetris a été ajoutée ! &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.28 is available. News: info scroll, fixed bugs. &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.28 est disponible. Nouveautés : info scroll, bugs corrigés. &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.27 is available. News: random music, bonus level choice, X-console mode (experimental!) &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.27 est disponible. Nouveautés : musique aléatoire, choix du niveau bonus, mode X-console (expérimental !) &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.26 is available. Challenge mode has been added. &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.26 est disponible. Le mode challenge a été ajouté. &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.25 is available. Intro music was added and some bugs were fixed. &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.25 est disponible. Une musique d'introduction a été ajoutée et quelques bugs ont été corrigés. &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.2: network (local and Internet) game (Linux version only, with TCP/IP), 15 levels (= speeds) for 1 player game. Network game has not been tested with Internet, but normally runs OK… &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: Version 0.2 : jeu en réseau local et Internet (version Linux seulement, par TCP/IP), 15 niveaux (= vitesses) en mode 1 joueur. Le jeu réseau n'a pas été testé par Internet mais devrait fonctionner… &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Version 0.1 is available. It has been successfully tested with Linux kernel 2.4.0 and Windows 2000. &bull; <a href="/flashtris/download/">FlashTris download page</a>
fr: La version 0.1 est disponible. Elle a été testée avec succès sur le noyau 2.4.0 de Linux et sous Windows 2000. &bull; <a href="/flashtris/download/">Page téléchargement FlashTris</a>

source: Coding
fr: Prog

source: Games
fr: Jeux

source: Title
fr: Titre

source: The comment title.
fr: Titre du commentaire.

source: Comment
fr: Commentaire

source: Your comment.
fr: Votre commentaire.

source: Your name or nick
fr: Votre nom ou pseudo

source: Displayed above the comment.
fr: Affiché au-dessus du commentaire.

source: Your e-mail
fr: Votre e-mail

source: Optional, never displayed.
fr: Facultatif, jamais affiché.

source: Are you a spammer?
fr: Êtes-vous un spammeur ?
