Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: WeeChat 0.1.8 is available! News since last version are: - added IRC raw data buffer (new key: alt-J + alt-R) - keys alt-{home|end} to scroll top/bottom, alt-{f11-f12} to scroll nicklist top/bottom - added new scroll keys for a few lines up/down (default: alt-pgup/pgdn) - added Lua script plugin - improved Ruby plugin - added functions in plugins API: get_server_info, free_server_info, get_channel_info, free_channel_info, get_nick_info, free_nick_info - added special names for plugin message handlers: weechat_pv, weechat_highlight, weechat_ctcp, weechat_dcc - script plugins now load scripts in WeeChat system share directory - added inactivity time, available for plugins via get_info("inactivity") - added new plugins functions: add_timer_handler, remove_timer_handler, remove_infobar - many commands allowed for aliases - many commands allowed when connecting to server - added options "irc_show_away_once", "look_nick_complete_first", "look_open_near_server", "irc_away_check_max_nicks" - added new command line argument for setting WeeChat homedir (-d or --dir) - added partial hungarian translation - improved alias completion (now uses target command for completion) - /msg command does not open any buffer any more (use /query for opening private buffer) - fixed crash when using global history (when older entry is removed) - fixed bug with /upgrade and servers buffer - fixed bug with "get_dcc_info" plugin interface function - many other bugs fixed &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.247">v0.1.8 ChangeLog</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.19">Release notes (NEWS file)</a>
fr: WeeChat 0.1.8 est disponible ! Les nouveautés depuis la dernière version sont : - ajout d'un tampon des données brutes IRC (nouvelle touche: alt-J + alt-R) - touches alt-{home|end} pour aller en haut/bas du tampon, alt-{f11-f12} pour aller en haut/bas de la liste des pseudos - ajout de nouvelles touches pour faire défiler de quelques lignes vers le haut/bas (par défaut: alt-pgup/pgdn) - ajout de l'extension script Lua - amélioration de l'extension Ruby - nouvelles fonctions dans l'API des extensions : get_server_info, free_server_info, get_channel_info, free_channel_info, get_nick_info, free_nick_info - ajout de noms spéciaux pour les gestionnaires de messages IRC : weechat_pv, weechat_highlight, weechat_ctcp, weechat_dcc - les extensions scripts chargent désormais les scripts dans le répertoire share système de WeeChat - ajout du temps d'inactivité, accessible pour les extensions via get_info("inactivity") - nouvelles fonctions pour les extensions: add_timer_handler, remove_timer_handler, remove_infobar - plusieurs commandes autorisées pour les alias - plusieurs commandes autorisées lors de la connexion au serveur - ajout des options "irc_show_away_once", "look_nick_complete_first", "look_open_near_server", "irc_away_check_max_nicks" - ajout d'un nouveau paramètre de ligne de commande pour indiquer le répertoire de base WeeChat (-d ou --dir) - ajout de la traduction partielle en hongrois - amélioration de la complétion des alias (utilise désormais la command pointée pour compléter) - la commande /msg n'ouvre désormais plus de tampon (utiliser /query pour ouvrir un tampon privé) - crash corrigé avec l'historique global (quand l'entrée la plus ancienne est supprimée) - bug corrigé avec le /upgrade et le tampon des serveurs - bug corrigé avec la fonction "get_dcc_info" de l'interface des extensions - beaucoup d'autres bugs corrigés &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.247">ChangeLog v0.1.8</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.19">Notes de version (fichier NEWS)</a>

source: WeeChat 0.1.7 is available! News since last version are: - new commands: /upgrade, /uptime, /history - removed "irc_default_msg_away" setting, for RFC 2812 conformity (/away command wihtout argument only removes away status), new values for "irc_display_away" (off, local, channel) - replaced Texinfo doc by XML Docbook - added color for window separators - added completion system for plugins/scripts commands - added charset by server and channel, new command: /charset - added Ruby script plugin - added ETA (Estimated Time of Arrival) for DCC files - /nick command is now allowed when not connected to server - added server/channel arg to /buffer command for jumping to buffer - added new keys for switching to other windows: alt-w followed by alt-arrow - added new keys for scrolling to previous/next highlight: alt-P / alt-N - added "read marker": an indicator for first unread line in a server or channel buffer (new key alt-U to scroll to marker) - new window maganement: custom size for windows, auto resize when terminal is resized - fixed: plugins autoload and unload, some display bugs &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.nongnu.org/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.218">v0.1.7 ChangeLog</a> &bull; <a href="http://cvs.savannah.nongnu.org/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.16">Release notes (NEWS file)</a>
fr: WeeChat 0.1.7 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelles commandes: /upgrade, /uptime, /history - suppression de l'option "irc_default_msg_away", pour la conformité RFC 2812 (la commande /away sans paramètre retire le statut d'absence), nouvelles valeurs pour "irc_display_away" (off, local, channel) - documentation Texinfo remplacée par XML Docbook - ajout de couleur pour les séparateurs de fenêtres - ajout de la complétion pour les commandes d'extensions/scripts - ajout de jeu de caractère par serveur et canal, nouvelle commande: /charset - ajout de l'extension de script Ruby - ajout de l'ETA (temps estimé d'arrivée) pour les fichiers DCC - la commande /nick est maintenant autorisée sans connexion au serveur - ajout de paramètre à la commande /buffer pour sauter vers le tampon - ajout de nouvelles touches pour se déplacer vers les autres fenêtres: alt-w suivi de alt-flèche - ajout de nouvelles touches pour se déplacer vers le highlight précédent/suivant: alt-P / alt-N - ajout d'un marqueur de lecture: pour la première ligne non lue du serveur ou canal (nouvelle touche alt-U pour se déplacer vers le marqueur) - nouveau système de gestion des fenêtres, redimensionnement automatique lorsque le terminal change de taille - corrections: chargement automatique et déchargement des extensions, quelques problèmes d'affichage &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.nongnu.org/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.218">ChangeLog v0.1.7</a> &bull; <a href="http://cvs.savannah.nongnu.org/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.16">Notes de version (fichier NEWS)</a>

source: WeeChat 0.1.6 is available! News since last version are: - new plugin management: now WeeChat loads/unloads dynamic libraries (.so files under GNU/Linux). Perl and Python become two plugins (script type). Many changes were made, there's some incompatibilities with old scripts, thanks for reading release notes (file NEWS or link below) - config file for plugins - color management in IRC messages (compatible with other IRC clients, including mIrc) - full UTF-8 support - smart hotlist - server mixed on one window (optional) - partial highlights - improved completion, customizable &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.199">v0.1.6 ChangeLog</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.15">Release notes (NEWS file)</a>
fr: WeeChat 0.1.6 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelle gestion des extensions (plugins): maintenant WeeChat charge/décharge des librairies dynamiques (fichiers .so sous GNU/Linux). Perl et Python deviennent deux plugins de type scripts. De nombreux changements ont eu lieu et il y a certaines incompatibilités avec les scripts anciens, merci de lire les notes de version (dans le fichier NEWS ou le lien ci-dessous) - fichier de configuration pour les extensions (plugins) - gestion des couleurs dans les messages IRC (compatible avec les autres clients IRC dont mIrc) - support UTF-8 complet - "hotlist" (liste d'activité) intelligente - fusion des serveurs sur la meme fenêtre (en option) - highlights partiels - complétion améliorée et configurable &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.199">ChangeLog v0.1.6</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/NEWS?rev=1.15">Notes de version (fichier NEWS)</a>

source: BSD version of driver
fr: Version BSD du driver

source: EciAdsl is now available for BSD, as a test version. All feedbacks on this version are welcome, please contact "kolja" or "FlashCode" (see support page). &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, development version</a>
fr: EciAdsl est désormais disponible, dans une version de test, pour BSD. Tous les retours sur cette version de test sont les bienvenus, contacter "kolja" ou "FlashCode" (voir la page support). &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version de développement</a>

source: WeeChat 0.1.5 is available! News since last version are: - added /ame command (send CTCP action to all channels of all connected servers), - added setting "irc_notice_as_pv" to see notices as pv, - added nicks colors in setup file, - added /ignore and /unignore commands, - signal SIGQUIT is now ignored, - jump to next server now saves current channel buffer for each server, - ctrl-up/ctrl-down keys added to call previous/next command in global history (common to all buffers), - many major bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.182">v0.1.5 ChangeLog</a>
fr: WeeChat 0.1.5 est disponible ! Les nouveautés depuis la dernière version sont : - ajout de la commande /ame (envoi d'une action CTCP à tous les canaux de tous les serveurs connectés), - ajout de l'option "irc_notice_as_pv" pour voir les notices sous forme de privés, - ajout des couleurs pour les pseudos dans le fichier de configuration, - ajout des commandes /ignore et /unignore - le signal SIGQUIT est maintenant ignoré - le saut vers le serveur suivant sauvegarde désormais le canal courant pour chaque serveur, - touches ctrl-haut/ctrl-bas ajoutées pour rappeler la commande précédente/suivante dans l'historique global (commun à tous les tampons), - correction de nombreux bugs majeurs. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.182">ChangeLog v0.1.5</a>

source: Driver version 0.11 is available. Among the news: - EciAdsl Nortek driver merged within standard eciadsl release, - synch process automatic retry on fail, - new pppoeci process protocol handling (eoc's handling), - pppoeci soft disconnection, - new program eciadsl-ctrlui (base user interface) at this moment it handles only disconnection process, - added eciadsl-testconnection script, - many bug fixed. Please note: this version still requires patch for any kernel between 2.6.0 and 2.6.6. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version 0.11 du driver est disponible. Parmi les nouveautés : - EciAdsl Nortek driver fusionné avec la version standard, - la synchro retente automatiquement en cas d'échec, - nouvelle gestion du process pppoeci (eoc's handling), - déconnexion propre pour pppoeci, - nouveau programme eciadsl-ctrlui (interface utilisateur), pour le moment permet seulement d'arrêter la connexion, - ajout du script eciadsl-testconnection, - corrections de bugs. A noter: cette version nécessite toujours de patcher tout noyau 2.6 entre les versions 2.6.0 et 2.6.6. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Paypal donations
fr: Dons via Paypal

source: WeeChat project now accepts donations via Paypal account, with secured payment. &bull; <a href="/weechat/donte/">Donations page</a>
fr: Le projet WeeChat accepte désormais les dons via un compte Paypal, avec paiement sécurisé. &bull; <a href="/weechat/donate/">Page des dons</a>

source: WeeChat 0.1.4 is available! News since last version are: - new keyboard management, fully customizable - DCC timeout and auto resume failed transfers - new color for private messages (in hotlist) - new colors for join and part/quit (arrows) - customizable highlights with irc_highlight var - command /amsg added - channels auto-prefixed by "#" for /join command - added time with seconds in infobar - many bugs fixed. Note for users upgrading to version 0.1.4 from old version: Config parameter "irc_infobar_timestamp" should be modified to remove time. For example, replace "%B, %A %d %Y - %H:%M" by "%B, %A %d %Y". &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.162">v0.1.4 ChangeLog</a>
fr: WeeChat 0.1.4 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelle gestion du clavier, entièrement paramétrable - DCC timeout et reprise auto des transferts échoués - nouvelle couleur pour les messages privés (dans la hotlist) - nouvelles couleurs pour les join et part/quit (flèches) - highlights personnalisables avec la variable irc_highlight - commande /amsg ajoutée - canaux auto-préfixés par "#" pour la commande /join - ajout de l'heure avec les secondes dans la barre d'info - correction de nombreux bugs. Note pour les utilisateurs passant à la version 0.1.4 depuis une ancienne version : Le paramètre de configuration "irc_infobar_timestamp" doit être modifié pour supprimer l'heure. Par exemple, remplacer "%B, %A %d %Y - %H:%M" en "%B, %A %d %Y". &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.162">ChangeLog v0.1.4</a>

source: Test call for version 0.11-beta1
fr: Appel à test pour la version 0.11-beta1

source: EciAdsl driver goes on and now a 0.11-beta1 version is available for testing purpose. We need help for testing this version, thank you for reporting us quickly any problem with this package, which may become soon version 0.11! Thank you for your help. &bull; <a href="/files/eciadsl/beta/">Version 0.11-beta1</a>
fr: Le driver EciAdsl avance et désormais une version 0.11-beta1 est disponible pour tests. Nous avons besoins d'aide pour les tests de cette version, aussi merci de nous reporter rapidement tout problème avec ce paquet, qui pourrait bientôt devenir la version 0.11 ! Merci pour votre aide. &bull; <a href="/files/eciadsl/beta/">Version 0.11-beta1</a>

source: WeeChat 0.1.3 is available! News since last version are: - IPv6 added - SSL added - proxy support added (http, socks4, socks5) - /set command now completed - channels notify now saved in config file - many bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.146">v0.1.3 ChangeLog</a>
fr: WeeChat 0.1.3 est disponible ! Les nouveautés depuis la dernière version sont : - ajout de l'IPv6 - ajout de SSL - ajout du support proxy (http, socks4, socks5) - complétion de la commande /set - notifications des canaux sauvées dans le fichier de configuration - correction de nombreux bugs. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.146">ChangeLog v0.1.3</a>

source: WeeChat 0.1.2 is available! News since last version are: - Python plugin support, Perl interface improved - nicklist scroll keys (Alt+{home/end/pgup/pgdn} or F11/F12) - DCC files transfer rate - buffers timestamp can now be changed - compile is ok under *BSD and Mac OS X - missing IRC commands added (307, 341, 485, 671) - fixed some bugs: crash when purging old DCC, crash with 64-bits arch (like AMD64) when converting UTF-8, nicklist sort. Add-on, 2005-05-24: fixed crash at startup and Perl/Python detection, version is now 0.1.2.1. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.131">v0.1.2 ChangeLog</a>
fr: WeeChat v0.1.2 est disponible ! Les nouveautés depuis la dernière version sont : - support du plugin Python, interface Perl améliorée - touches pour scroller la liste de pseudos (Alt+{home/end/pgup/pgdn} or F11/F12) - taux de transfert des fichiers DCC - l'horodatage est modifiable - la compilation est ok sous *BSD et Mac OS X - commandes manquantes IRC ajoutées (307, 341, 485, 671) - bugs corrigés : crash lors de la purge des anciens DCC, crash avec les architectures 64-bits (comme AMD64) lors de la conversion UTF-8, tri de la liste de pseudos. Ajout le 24/05/2005 : correction d'un crash au démarrage et d'un bug de détection de Perl et Python, la version est désormais 0.1.2.1. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.131">ChangeLog v0.1.2</a>

source: WeeChat 0.1.1 is available! News since last version are: - new display engine: doesn't cut words at end of lines - DCC send (file) and DCC chat - FIFO pipe for remote control - connection to IRC server is now made by child process (non blocking) - nicks count for channel buffers - crash dump when WeeChat receives SIGSEGV (Segmentation fault) - new commands: /ban, /unban, /kickban, /halfop, /dehalfop - UnrealIrcd IRC servers support - spanish translation - bugs fixed (display and commands) &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.117">v0.1.1 ChangeLog</a>
fr: WeeChat 0.1.1 est disponible ! Les nouveautés depuis la dernière version sont : - nouveau moteur d'affichage : ne coupe plus les mots en fin de ligne - DCC: envoi de fichier et discussion (DCC chat) - tube FIFO pour contrôle à distance - connexion au serveur IRC par un processus fils (non bloquant) - compteur de pseudos dans chaque canal - état de crash quand WeeChat reçoit SIGSEGV (Segmentation fault) - nouvelles commandes: /ban, /unban, /kickban, /halfop, /dehalfop - support des serveurs IRC UnrealIrcd - traduction en espagnol - bugs corrigés (affichage et commandes) &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.117">ChangeLog v0.1.1</a>

source: A wiki has been added to FlashTux website. Feel free to improve it: add documents, fixes, translations, etc. &bull; <a href="/wiki/">FlashTux Wiki</a>
fr: Un wiki a été ajouté au site FlashTux. N'hésitez pas à l'enrichir: ajout de documents, corrections, traductions, etc. &bull; <a href="/wiki/">Wiki FlashTux</a>

source: WeeChat 0.1.0 is available! News since last version are: - improved /window command: now split and merge are ok - away nicks are now displayed with another color (new option: "irc_away_check") - added away indicator in status bar - added lag indicator (and auto-disconnect after a delay if important lag) - improved completion: now completes commands arguments (IRC and internal) - improved /set command: empty strings are allowed, new colors, server options can be changed while WeeChat is running - added default away/part/quit messages in config file - new [irc] section in config file - added new options for charset (UTF-8 support) - fixed many memory leaks - fixed commands: /op, /deop, /voice, /devoice, /me, /away - many bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.98">v0.1.0 ChangeLog</a>
fr: WeeChat 0.1.0 est disponible ! Les nouveautés depuis la dernière version sont : - commande /window améliorée: l'éclatement et la fusion sont ok - les pseudos absents sont affichés avec une autre couleur (nouvelle option: "irc_away_check") - indicateur d'absence ajouté dans la barre de statut - indicateur de lag ajouté (avec auto déconnexion après un délai si lag important) - complétion améliorée: complète désormais les arguments des commandes (IRC et internes) - commande /set améliorée: chaînes vides autorisées, nouvelles couleurs, les options du serveur peuvent être changées pendant que WeeChat tourne - ajout d'un message par défaut pour away/part/quit - nouvelle section [irc] dans le fichier de configuration - nouvelles options pour la table de caractères (support UTF-8) - plusieurs fuites de mémoire corrigées - commandes corrigées: /op, /deop, /voice, /devoice, /me, /away - nombreux bugs corrigés. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.98">ChangeLog v0.1.0</a>

source: RSS format for news
fr: Nouveautés au format RSS

source: FlashTux news and all subsites are now available as RSS 2.0 format. Link to RSS page is displayed on the right for all news pages. &bull; <a href="/feeds/news/">FlashTux.org RSS</a> &bull; <a href="/feeds/news/eciadsl/">EciAdsl RSS</a> &bull; <a href="/feeds/news/weechat/">WeeChat RSS</a> &bull; <a href="/feeds/news/weewm/">WeeWM RSS</a> &bull; <a href="/feeds/news/gmemo/">Gmemo RSS</a> &bull; <a href="/feeds/news/flashtris/">FlashTris RSS</a> &bull; <a href="/feeds/news/coding/">Coding RSS</a> &bull; <a href="/feeds/news/games/">Games RSS</a>
fr: Les nouveautés de FlashTux et tous ses sous-sites sont désormais accessibles au format RSS 2.0. Un lien vers la page RSS est affiché sur chaque page de nouveautés sur la droite. &bull; <a href="/feeds/news/">RSS FlashTux.org</a> &bull; <a href="/feeds/news/eciadsl/">RSS EciAdsl</a> &bull; <a href="/feeds/news/weechat/">RSS WeeChat</a> &bull; <a href="/feeds/news/weewm/">RSS WeeWM</a> &bull; <a href="/feeds/news/gmemo/">RSS Gmemo</a> &bull; <a href="/feeds/news/flashtris/">RSS FlashTris</a> &bull; <a href="/feeds/news/coding/">RSS Coding</a> &bull; <a href="/feeds/news/games/">RSS Games</a>
