Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: First release candidate (version 0.3.0-rc1) for future version 0.3.0 is available. No major feature will be added until version 0.3.0 will be released. &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: La première "release candidate" (version 0.3.0-rc1) pour la future version 0.3.0 est disponible. Il n'y aura plus d'ajout de fonctionnalité majeure jusqu'à la sortie de la version 0.3.0. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: WeeChat 0.2.6.3 is available. This release fixes a bug with detection of gnutls. &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.2.6.3 est disponible. Cette version corrige un bug de détection de gnutls. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: WeeChat 0.2.6.2 is available. This release fixes a charset decoding problem of version 0.2.6.1. &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.2.6.2 est disponible. Cette version corrige un bug de décodage de charset de la version 0.2.6.1. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: WeeChat 0.2.6.1 is available. This release fixes a crash when receiving some special chars in IRC messages. It is <b>strongly recommended</b> to upgrade to this version for all users of version 0.2.6 (versions 0.2.5 or older are not affected by this bug). &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.2.6.1 est disponible. Cette version corrige un bug provoquant un plantage de WeeChat en réception de messages IRC contenant des caractères spéciaux. Il est <b>fortement recommandé</b> de mettre à jour WeeChat vers cette version pour tous les utilisateurs de la version 0.2.6 (les versions 0.2.5 ou antérieures ne sont pas concernées par ce problème). &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: Jabber plugin
fr: Extension Jabber

source: Development of Jabber plugin for WeeChat has started and a first alpha version is available. Note: many features are missing, like TLS connection, buddy list management, presence information, MUC and transports. &bull; <a href="http://dev.weechat.org/post/2009/01/15/New-plugin-Jabber">Article on dev blog</a>
fr: Le développement de l'extension Jabber pour WeeChat a démarré et une première version alpha est disponible. A noter : il manque encore bon nombre de fonctionnalités, comme la connexion TLS, la gestion de la liste de contacts, l'information de présence, le MUC et les transports. &bull; <a href="http://dev.weechat.org/post/2009/01/15/New-plugin-Jabber">Article sur le blog de dev</a>

source: Dev blog
fr: Blog de dev

source: A new blog about WeeChat development has been added. It announces all new features in development version and let you discuss about future of WeeChat. Feel free to read it and add comments! &bull; <a href="http://dev.weechat.org/">WeeChat dev blog</a>
fr: Un nouveau blog sur le développement de WeeChat a été ajouté. Il annonce toutes les nouvelles fonctionnalités dans la version de développement et permet de discuter sur le futur de WeeChat (en anglais). N'hésitez pas à le suivre et à y laisser des commentaires ! &bull; <a href="http://dev.weechat.org/">Blog de dev WeeChat</a>

source: News about development
fr: Infos sur le développement

source: Next WeeChat version (codename "revolution") is under development. Large part of code was rewritten, it's now faster, easier, and more extensible. List of new features and screenshots can be found on wiki page (see link below). Today there's no planed release date, some features are still missing, and there's lot of work until a stable version. <b>We need help</b>, like beta testers, to test this version. You can look at wiki page for more info. To be continued in some months for other news… &bull; <a href="http://wiki.flashtux.org/wiki/WeeChat_0.2.7">Wiki page about development</a>
fr: La prochaine version de WeeChat (nom de code "révolution") est en développement. Une part importante du code a été réécrite, il est maintenant plus rapide, facile d'utilisation et plus extensible. La liste des nouvelles fonctionnalités et les captures d'écran sont visibles sur la page wiki (voir lien ci-dessous). Aujourd'hui, il n'y a pas de date planifiée pour la sortie de cette version, des fonctionnalités sont toujours manquantes, et il y a encore beaucoup de travail jusqu'à une version stable. <b>Nous avons besoin d'aide</b>, comme des beta-testeurs, pour tester cette version. Vous pouvez regarder la page du wiki pour plus d'informations. À suivre dans quelques mois pour d'autres infos… &bull; <a href="http://wiki.flashtux.org/wiki/WeeChat_0.2.7">Page Wiki sur le développement</a>

source: WeeChat 0.2.6 is available! News since last version are: - new license (GPLv3) - added hotlist sort - added scroll option to /buffer command - added key to jump to previous buffer - fixed bugs with IRC color in messages, now color codes are inserted in command line with ^Cc (Ctrl-C + c), ^Cb, etc. instead of %C, %B, etc. - improved /server command: now possible to copy and rename servers - improved /connect command: now possible to connect to a temporary server without creating it with /server - many bugs fixed and other new features. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.482">v0.2.6 ChangeLog</a>
fr: WeeChat 0.2.6 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelle licence (GPLv3) - ajout du tri de la hotlist - ajout de l'option scroll pour la commande /buffer - ajout d'une touche pour aller au tampon précédent - correction de problèmes avec les couleurs dans les messages IRC, les codes couleurs sont maintenant insérés avec ^Cc (Ctrl-C + c), ^Cb, etc. au lieu de %C, %B, etc. - commande /server améliorée : il est possible de copier et renommer des serveurs - commande /connect améliorée : il est possible de se connecter à des serveurs temporaires sans créer le serveur par /server - nombreux bugs corrigés et autres nouvelles fonctionnalités. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.482">ChangeLog v0.2.6</a>

source: Driver version 0.12 is available. Among the news: - fixed synchronization for last kernels (≥ 2.6.18), - new modems supported, - many bugs fixed. Please note: this version still requires patch for any kernel between 2.6.0 and 2.6.6. &bull; <a href="/eciadsl/download/">EciAdsl download page</a> &bull; <a href="http://eciadsl.cvs.sourceforge.net/*checkout*/eciadsl/usermode/ChangeLog?revision=1.11">v0.12 ChangeLog</a>
fr: La version 0.12 du driver est disponible. Parmi les nouveautés : - correction sur la synchronisation pour les derniers noyaux (≥ 2.6.18), - nouveaux modems supportés, - corrections de bugs. A noter: cette version nécessite toujours de patcher tout noyau 2.6 entre les versions 2.6.0 et 2.6.6. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a> &bull; <a href="http://eciadsl.cvs.sourceforge.net/*checkout*/eciadsl/usermode/ChangeLog?revision=1.11">ChangeLog v0.12</a>

source: WeeChat 0.2.5 is available! News since last version are: - smart completion (first uses last channel speakers) - added /reconnect command - added %M for completion with current server nicks - added color for text not found in buffer history - many bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.442">v0.2.5 ChangeLog</a>
fr: WeeChat 0.2.5 est disponible ! Les nouveautés depuis la dernière version sont : - complétion intelligente (utilise en premier les dernières personnes qui ont parlé sur le canal) - ajout de la commande /reconnect - ajout de %M pour la complétion avec les pseudos du serveur courant - ajout de couleur pour le texte non trouvé lors d'une recherche dans le tampon - nombreux bugs corrigés. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.442">ChangeLog v0.2.5</a>

source: WeeChat 0.2.4 is available! News since last version are: - search in buffer history (ctrl-R) - added "call" option to /key command - added "event handlers" to plugins API - many bugs fixed. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.412">v0.2.4 ChangeLog</a>
fr: WeeChat 0.2.4 est disponible ! Les nouveautés depuis la dernière version sont : - recherche dans l'historique des tampons (ctrl-R) - ajout de l'option "call" à la commande /key - ajout des "event handlers" dans l'API des extensions - nombreux bugs corrigés. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.412">ChangeLog v0.2.4</a>

source: WeeChat 0.2.3 is available! This version fixes major bugs of version 0.2.2. All users of version 0.2.2 should upgrade now. News since last version are: - fixed many bugs with charset plugin - fixed display bugs with nicklist at top/bottom when look_nicklist_separator is OFF - fixed topic scroll when topic has multi-bytes chars - fixed compilation problem with iconv under FreeBSD. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.387">v0.2.3 ChangeLog</a>
fr: WeeChat 0.2.3 est disponible ! Cette version corrige des problèmes importants de la version 0.2.2. Tous les utilisateurs de la version 0.2.2 sont invités à mettre à jour. Les nouveautés depuis la dernière version sont : - correction de problèmes avec l'extension charset - correction d'un problème d'affichage de la liste des pseudos en haut ou en bas quand look_nicklist_separator est à OFF - correction du scroll du titre quand il y a des caractères multi-octets - correction d'un problème de compilation sous FreeBSD avec iconv. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.387">ChangeLog v0.2.3</a>

source: Bugs with WeeChat 0.2.2
fr: Bugs avec WeeChat 0.2.2

source: Bugs have been detected with WeeChat 0.2.2: for servers using charsets like KOI8-R. When nicks are encoded with cyrillic chars, WeeChat doesn't decode them, and display and behaviour with server are buggy. If you use KOI8-R (or charsets like this one), we recommend you to use version 0.2.1 or development version. If you use only UTF-8 or ISO charsets, there's no problem with version 0.2.2. These problems are fixed in development version. A new version will be available soon, it will fix all problems.
fr: Des problèmes ont été détectés avec la version 0.2.2 de WeeChat: pour les serveurs utilisant un jeu de caractère tel que KOI8-R. Lorsque les pseudos sont encodés en cyrillique, WeeChat ne les décode pas et l'affichage ainsi que le comportement avec le serveur sont dégradés. Si vous utilisez KOI8-R (ou des jeux de caractères similaires), nous vous recommandons d'utiliser la version 0.2.1 ou celle de développement. Si vous utilisez les jeux de caractères UTF-8 ou ISO seulement, il n'y a pas de problème avec la version 0.2.2. Ces problèmes sont corrigés dans la version de développement. Une nouvelle version sera bientôt disponible, elle corrigera tous les problèmes.

source: WeeChat 0.2.2 is available! News since last version are: - added new charset plugin, which replaces internal /charset command: fixes many bugs with charsets, WeeChat internal is now full UTF-8 - added "modifier" in plugins API: plugins are now able to modify or drop received IRC messages - added filename completion - added anti-flood mechanism - added keys to scroll topic - added new option to send unknown IRC commands - improved /plugin command - pdf version of documentation is back - fixed many bugs: portability, memleak in keyboard input, ignore and alias commands, many display bugs. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.381">v0.2.2 ChangeLog</a>
fr: WeeChat 0.2.2 est disponible ! Les nouveautés depuis la dernière version sont : - ajout d'une nouvelle extension "charset", qui remplace la commande interne /charset: corrige de nombreux problèmes avec l'encodage, WeeChat utilise désormais en interne de l'UTF-8 - ajout de "modifier" dans l'interface des extensions: les extensions peuvent désormais modifier ou supprimer des messages IRC reçus - ajout de la complétion sur les noms de fichier - ajout d'un mécanisme "anti-flood" - ajout de touches pour faire défiler les titres des canaux - ajout d'une nouvelle option pour envoyer les commandes IRC inconnues - amélioration de la commande /plugin - retour du pdf dans la documentation - nombreux bugs corrigés: portabilité, fuite de mémoire dans l'entrée clavier, commandes ignore et alias, plusieurs bugs d'affichage. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.381">ChangeLog v0.2.2</a>

source: WeeChat 0.2.1 is available! News since last version are: - added server default notify - added arguments ($1, …, $9) for alias and special vars ($nick, $channel, $server) - added hotlist in session file when using /upgrade command - fixed crash with DCC when resuming file - fixed random crash with /upgrade command - fixed nicklist display when location is top or bottom - fixed bug with CTCP version on channels - fixed bug with auto-rejoin for keyed channels - fixed chan owner and chan admin nicks &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.349">v0.2.1 ChangeLog</a>
fr: WeeChat 0.2.1 est disponible ! Les nouveautés depuis la dernière version sont : - ajout de la notification par défaut pour chaque serveur - ajout de paramètres ($1, …, $9) pour les alias et de variables spéciales ($nick, $channel, $server) - ajout de la hotlist dans le fichier de session pour la commande /upgrade - correction de crash avec le DCC en reprenant un fichier déjà commencé - correction de crash aléatoire avec la commande /upgrade - correction de l'affichage de la liste des pseudos quand la position est en haut ou en bas - correction du CTCP version sur les canaux - correction de l'auto-rejoin sur les canaux avec clé - correction sur les pseudos qui sont owner ou admin de canal &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.349">ChangeLog v0.2.1</a>

source: WeeChat 0.2.0 is available! News since last version are: - plugin aspell for fixing user typos (language is customizable by channel) - improved DCC speed by adding DCC fast option and sending/receiving in background - added generic function for missing IRC commands - added new functions in plugins API: info about windows, buffers, and buffer content - fixed many IRC commands (wallops and other) - fixed refresh bugs - fixed crashs with DCC - fixed many other bugs. <b>Warning:</b> for users of version 0.1.9 (or older), read NEWS file before upgrading to this version! &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.328">v0.2.0 ChangeLog</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/NEWS?rev=1.24">Release notes (NEWS file)</a>
fr: WeeChat 0.2.0 est disponible ! Les nouveautés depuis la dernière version sont : - extension aspell pour corriger les fautes de saisie (langue paramétrable par canal) - amélioration de la vitesse des DCC par ajout d'une option "DCC rapide" et par envoi/réception en tâche de fond - ajout d'une fonction générique pour les messages IRC manquants - ajout de nouvelles fonctions dans l'API des extensions: infos fenêtres, tampons, et contenu des tampons - correction de plusieurs commandes IRC (wallops et d'autres) - correction de problèmes de rafraîchissement - correction de crashs avec les DCC - correction de beaucoup d'autres bugs. <b>Attention :</b> pour les utilisateurs de la version 0.1.9 (ou précédentes), lisez le fichier NEWS avant de passer à cette version ! &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.328">ChangeLog v0.2.0</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/NEWS?rev=1.24">Notes de version (fichier NEWS)</a>

source: WeeChat 0.1.9 is available! News since last version are: - nick aligment, makes channels more readable - new commands: /cycle, /setp - new option to customize IP/hostname (when using multipe IP) - new option to customize input prompt - added keyboard handler for plugins - german translations (messages and documentation) - many bugs fixed for: UTF-8, DCC chat, Ruby, mutiple queries with same name, some commands, long IRC messages (> 512 bytes), terminal refresh, nicklist &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.284">v0.1.9 ChangeLog</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/NEWS?rev=1.21">Release notes (NEWS file)</a>
fr: WeeChat 0.1.9 est disponible ! Les nouveautés depuis la dernière version sont : - alignement des pseudos, améliore la lisibilité sur les canaux - nouvelles commandes: /cycle, /setp - nouvelle option pour paramétrer le nom de machine ou IP (lors de l'utilisation de plusieurs IP) - nouvelle option pour personnaliser l'invite de la zone de saisie - ajout d'un gestionnaire de clavier pour les extensions - traduction en allemand (messages et documentation) - bugs corrigés pour: UTF-8, discussion DCC, Ruby, plusieurs privés avec le même nom, quelques commandes, longs messages IRC (> 512 octets), rafraîchissement du terminal, liste de pseudos &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/ChangeLog?rev=1.284">ChangeLog v0.1.9</a> &bull; <a href="http://cvs.savannah.gnu.org/viewcvs/weechat/weechat/NEWS?rev=1.21">Notes de version (fichier NEWS)</a>

source: Story… with screenshots
fr: Histoire… en captures d'écran

source: WeeChat story page is now available, as screenshots. You can see differences between all versions in one view! Development version is visible too, and frequently updated. &bull; <a href="/weechat/story/">WeeChat story</a>
fr: Une page sur l'histoire de WeeChat est maintenant disponible, sous forme de captures d'écran. Vous pouvez voir la différence entre les différentes version, en un coup d'œil ! La version de développement est également visible et mise à jour régulièrement. &bull; <a href="/weechat/story/">Histoire de WeeChat</a>

source: WeeChat users map
fr: Carte des utilisateurs WeeChat

source: A map of developers, contributors and users is now available. Everybody is invited to add nick/location to this map. &bull; <a href="http://www.frappr.com/weechat">WeeChat map</a>
fr: Une carte des développeurs, contributeurs et utilisateurs WeeChat est disponible. Chacun est invité à ajouter son pseudo/lieu sur cette carte. &bull; <a href="http://www.frappr.com/weechat">Carte WeeChat</a>

source: WeeChat will merge with irssi
fr: WeeChat va fusionner avec irssi

source: After discussion with irssi developers, both projects are going to merge in the next weeks. Most of WeeChat features will not be available in first merged versions, but they will be in a few months. This merge will give missing features to WeeChat and give new from irssi. WeeChat developers will not take part into final client (which should be renamed to "weerssi"). <b>Update:</b> it is of course an april joke :-)
fr: Suite aux discussions avec les développeurs irssi, les deux projets vont fusionner d'ici quelques semaines. Une grande partie des fonctionnalités propres à WeeChat ne seront plus accessibles dans les premières versions communes, mais le redeviendront d'ici quelques mois. Cette fusion permettra de bénéficier des fonctions qui manquent à WeeChat et d'en apporter de nouvelles à irssi. Les développeurs WeeChat ne participeront plus à l'évolution du client commun (qui devrait être renommé en "weerssi"). <b>Mise à jour :</b> il s'agit évidemment d'un poisson d'avril :-)
