Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: There's a browser detection, only Internet Explorer and Netscape/Mozilla are accepted (Opera works fine). The website is OK with Konqueror if the UserAgent is set to Internet Explorer.
fr: Il y a une détection de navigateur, seulement Internet Explorer et Netscape/Mozilla sont acceptés (Opera fonctionne bien). Le site fonctionne avec Konqueror si le UserAgent est défini à Internet Explorer.

source: Unable to change the password
fr: Impossible de changer son mot de passe

source: When connecting for the first time, we must change our password. This does not work with any browser. When the fields are filled and we validate, there is an error message: "Vous devez remplir la case mot de passe". On <http://www.caisse-epargne.fr/asp/modele2.aspx?np=aide_connexion_navigateurs&nv=20050302100632>, there's the confirmation that the site is almost entirely broken with Macs: only Internet Explorer 5.5 is supported. *** Mise à jour le 24/05/2006 *** Le problème semble avoir été corrigé.
fr: Lorsqu'on se connecte pour la première fois, on doit changer de mot de passe. Ceci ne fonctionne avec aucun navigateur. Quand on remplit les cases et que l'on valide, on a un message "Vous devez remplir la case mot de passe". Sur <http://www.caisse-epargne.fr/asp/modele2.aspx?np=aide_connexion_navigateurs&nv=20050302100632>, on a la confirmation que ce site est quasiment inaccessible pour les Macs : seul IE 5.5 est supporté. *** Mise à jour le 24/05/2006 *** Le problème semble avoir été corrigé.

source: Website accessible with Windows or Mac only
fr: Site accessible depuis Windows ou Mac seulement

source: The websites detects the OS and does not work if it's not Windows or Mac. *** Updated on 2006-01-21 *** Website fixed.
fr: Le site fait une détection de l'OS et ne fonctionne pas s'il ne s'agit pas de Windows ou Mac. *** Mise à jour le 21/01/2006 *** Site corrigé.

source: The JavaScript on http://www.bigad.com.au/player_script.js displays the message: "Unfortunately, the Operating System you are currently using is unsupported." if the operating system is not Windows or Mac. *** Updated on 2009-05-02 *** Website fixed.
fr: Le JavaScript sur http://www.bigad.com.au/player_script.js affiche le message "Unfortunately, the Operating System you are currently using is unsupported." si le système d'exploitation utilisé n'est ni Windows ni Mac. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Blocking message with any browser different from Internet Explorer: "Votre navigateur doit être une version de IE 5 ou +". No e-mail to contact them.
fr: Message bloquant à l'entrée du site pour tout navigateur différent d'Internet Explorer : "Votre navigateur doit être une version de IE 5 ou +". Pas d'e-mail pour les contacter.

source: Windows only
fr: Windows seulement

source: The access is refused if we are not running Windows. *** Updated on 2008-10-10 *** Website has been closed by Sony.
fr: L'accès est refusé si l'on ne possède pas Windows. *** Mise à jour le 10/10/2008 *** Le site a été fermé par Sony.

source: The online antivirus uses Active X
fr: L'antivirus en ligne utilise Active X

source: Aucun navigateur excepté Internet Explorer on Windows can use the online antivirus because of the use of Active X.
fr: Aucun navigateur excepté Internet Explorer sous Windows ne peut utiliser l'antivirus en ligne à cause de l'utilisation d'Active X.

source: Access not possible with Firefox or Konqueror
fr: Accès impossible avec Firefox ou Konqueror

source: When accessing the website with Firefox or Konqueror we are redirected to a page http://www.webstandards.org/upgrade/ which suggests to install Firefox or Konqueror. *** Updated on 2009-05-02 *** Website fixed.
fr: Lorsqu'on accède au site avec Firefox ou Konqueror on est renvoyé vers la page http://www.webstandards.org/upgrade/ qui propose justement d'installer Firefox ou Konqueror. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Internet Explorer plugin mandatory for voice messaging
fr: Plugin Internet Explorer obligatoire pour la messagerie vocale

source: Orange lets you listen to your voice messaging via their website (orange.fr > communiquer > messagerie vocale), but a plugin is required and is working only with Internet Explorer, Linux users can therefore not use this service.
fr: Orange propose d'écouter sa messagerie vocale via leur site web (orange.fr > communiquer > messagerie vocale), mais il faut un plugin qui ne fonctionne que sous Internet Explorer, les utilisateurs de Linux ne peuvent donc pas utiliser ce service.

source: When accessing to the website with a browser different from Internet Explorer, the following message is displayed: "Afin de pouvoir profiter de toutes les fonctionnalités présentes sur notre site, vous devez posséder Internet Explorer 6.0 (ou de version supérieure) Cliquez ici pour télécharger Microsoft Internet Explorer 6.0 Merci de votre compréhension, L'équipe Model-Discount"
fr: Lorsqu'on accède au site avec un navigateur différent d'Internet Explorer, le message suivant est affiché : "Afin de pouvoir profiter de toutes les fonctionnalités présentes sur notre site, vous devez posséder Internet Explorer 6.0 (ou de version supérieure) Cliquez ici pour télécharger Microsoft Internet Explorer 6.0 Merci de votre compréhension, L'équipe Model-Discount"

source: Unable to browse with Firefox
fr: Impossible de naviguer avec Firefox

source: Links are not clickable with Mozilla/Firefox. *** Updated on 2005-09-24 *** It does not work with Konqueror.
fr: Les liens ne sont pas cliquables avec Mozilla/Firefox. *** Mise à jour le 24/09/2005 *** Ne fonctionne pas avec Konqueror.

source: Only Internet Explorer is allowed, all other Browsers (if you're not using a custom User-Agent) will be forwarded to http://www.gamevideovault.com/browsercheck.html Answered received: "If you would like to do it for FREE or know some-one who would please contact us." *** Updated on 2009-05-02 *** Site no longer exists.
fr: Seul Internet Explorer est autorisé, tous les autres navigateurs (si vous n'utilisez pas un User-Agent personnalisé) sont redirigés vers http://www.gamevideovault.com/browsercheck.html Réponse reçue : "If you would like to do it for FREE or know some-one who would please contact us." *** Mise à jour le 02/05/2009 *** Le site n'existe plus.

source: Only the first page is accessible with Firefox. *** Updated on 2005-08-17 *** Website fixed.
fr: Seule la première page est accessible avec Firefox. *** Mise à jour le 17/08/2005 *** Site corrigé.

source: Problem when choosing the store
fr: Problème de sélection du magasin

source: Problem when choosing the store: the drop down menu does nothing and a postal code displays the same page again. *** Updated on 2005-11-04 *** Problem fixed.
fr: Problème de sélection du magasin : le menu déroulant ne fait rien et un code postal entré réaffiche la même page. *** Mise à jour le 04/11/2005 *** Problème corrigé.

source: Opera browser is forbidden
fr: Le navigateur Opera est interdit

source: Message: "Votre navigateur est trop ancien pour accéder au site www.cancerdusein.org Internet Explorer 4 ou Netscape Navigator 4 minimum sont recommandés." Opera version 7.54. *** Updated on 2005-05-24 *** Website is OK with Opera 8.00.
fr: Message: "Votre navigateur est trop ancien pour accéder au site www.cancerdusein.org Internet Explorer 4 ou Netscape Navigator 4 minimum sont recommandés." Version 7.54 d'opéra. *** Mise à jour le 24/05/2005 *** Le site est OK avec Opera 8.00.

source: Some pages are empty with Firefox
fr: Certaines pages sont vides avec Firefox

source: Some website pages are empty with Firefox.
fr: Certaines pages du site sont vides avec Firefox.

source: Welcome message with a browser different from Internet Explorer: "Le site www.geoternet.com utilise des fonctions et langages que votre navigateur Internet ne comprend pas. Nous vous invitons à visionner ce site sur PC à l'aide du navigateur Internet Explorer (versions 5.0 et +)." *** Updated on 2005-05-19 *** Réponse du webmaster: "Cette situation est provisoire, nous attendons la sortie d'une nouvelle version d'Adobe SVG Viewer pour rendre Géoternet compatible avec les différents navigateurs." *** Updated on 2005-06-29 *** Le site a été corrigé et fonctionne sans le SVG d'Adobe sur les différents navigateurs.
fr: Message d'accueil avec un navigateur autre qu'Internet Explorer : "Le site www.geoternet.com utilise des fonctions et langages que votre navigateur Internet ne comprend pas. Nous vous invitons à visionner ce site sur PC à l'aide du navigateur Internet Explorer (versions 5.0 et +)." *** Mise à jour le 19/05/2005 *** Réponse du webmaster : "Cette situation est provisoire, nous attendons la sortie d'une nouvelle version d'Adobe SVG Viewer pour rendre Géoternet compatible avec les différents navigateurs." *** Mise à jour le 29/06/2005 *** Le site a été corrigé et fonctionne sans le SVG d'Adobe sur les différents navigateurs.

source: The website is "optimized" for Internet Explorer. With Firefox, only the first page is visible.
fr: Le site est "optimisé" pour Internet Explorer. Avec Firefox, seule la première page est visible.

source: White text on white background
fr: Texte blanc sur fond blanc

source: Website is not readable because there is white text on white background.
fr: Le site est illisible car il y a du texte blanc sur fond blanc.

source: Warning message with Linux
fr: Message d'avertissement avec Linux

source: A browser detection redirects Firefow and Konqueror with Linx to a page saying that the browser is obsolete and recommends to use Firefox or Netscape 6. Apart from this warning, the website is OK. *** Updated on 2005-05-13 *** Le site a été corrigé.
fr: Une détection du navigateur envoie Firefox Linux et Konqueror vers une page disant que le navigateur est obsolète et recommande d'installer Firefox ou Netscape 6. Hormis cet avertissement, le site est OK. *** Mise à jour le 13/05/2005 *** Le site a été corrigé.

source: Website is not accessible with GNU/Linux
fr: Impossible d'accéder au site sous GNU/Linux

source: With GNU/Linux and Mozilla, Konqueror or Opera, the following message is displayed: "ERREUR: Le navigateur n'est pas supporté / la configuration du système n'est pas appropriée Le navigateur que vous utilisez présentement ou la configuration de votre système ne convient pas à cette application. Cette application supporte les navigateurs suivants: Microsoft Internet Explorer 5.0 (ou plus) sur Windows 98/NT/2000/ME/XP Netscape 7.1 (ou plus) sur Windows 98/NT/2000/ME/XP Microsoft Internet Explorer 5.2 (ou plus) sur Mac OS X" Answer received is: "Nous sommes conscients que le téléchargement d'images ne fonctionne pas sur certains systèmes Mac. Notre équipe évalue la possibilité de l'offrir sur d'autres applications éventuellement. Merci pour votre commentaire."
fr: Avec GNU/Linux et Mozilla, Konqueror ou Opera, le message suivant est affiché : "ERREUR: Le navigateur n'est pas supporté / la configuration du système n'est pas appropriée Le navigateur que vous utilisez présentement ou la configuration de votre système ne convient pas à cette application. Cette application supporte les navigateurs suivants : Microsoft Internet Explorer 5.0 (ou plus) sur Windows 98/NT/2000/ME/XP Netscape 7.1 (ou plus) sur Windows 98/NT/2000/ME/XP Microsoft Internet Explorer 5.2 (ou plus) sur Mac OS X" La réponse reçue est la suivante : "Nous sommes conscients que le téléchargement d'images ne fonctionne pas sur certains systèmes Mac. Notre équipe évalue la possibilité de l'offrir sur d'autres applications éventuellement. Merci pour votre commentaire."

source: JavaScript redirection working only with Internet Explorer
fr: Redirection JavaScript ne fonctionnant qu'avec Internet Explorer

source: From the URL http://www.vacances-ptt.com/ it is not possible to access to the website because of a JavaScript redirection.
fr: Depuis l'URL http://www.vacances-ptt.com/ il n'est pas possible d'accéder au site à cause d'une redirection en JavaScript.

source: Visit date can not be entered
fr: La date de visite ne peut pas être saisie

source: For an online quote, when choosing a date, the calendar widget does not work with Firefox. The text field beside the button is not accessible.
fr: Pour une demande en ligne de devis, lors du choix de la date de visite, le widget de calendrier ne fonctionne pas avec Firefox. Le champ texte à coté de ce bouton n'est pas accessible non plus.

source: Not possible to customize products
fr: Impossible de personnaliser les produits

source: The website allows to show and customize products with a simple click. The JavaScript does not work with Mozilla Firefox.
fr: Le site permet de visionner les produits et d'en changer les couleurs pour les personnaliser d'un simple clic. Le JavaScript ne fonctionne pas avec Mozilla Firefox.

source: Login form is not displayed
fr: Pas d'affichage du formulaire de login

source: On the welcome page, after a click on "Account", the connection form is not displayed with Firefox, Opera or Konqueror. The webmaster, contacted in January, had to update the website, but today the problem is still there.
fr: Sur la page d'accueil, après un clic sur "Compte", le formulaire de connexion ne s'affiche ni sous Firefox, ni Opera, ni Konqueror. Le webmaster contacté en janvier devait modifier le site, à ce jour le problème persiste toujours.

source: Unable to scroll programs
fr: Impossible de faire défiler les programmes

source: The scrollbar can not be used and TV channels are hidden.
fr: L'ascenseur ne peut pas être utilisé et de plus les noms de chaînes sont masqués.

source: Content visible only with Internet Explorer
fr: Contenu visible seulement avec Internet Explorer

source: This website is not displayed except with Internet Explorer on Windows. There's a blank page with Internet Explorer on Mac, Firefox (Mac/Windows/Linux), Safari (Mac) and Opera (Mac/Windows).
fr: Ce site ne s'affiche pas si l'utilisateur ne le consulte pas avec Internet Explorer pour Windows. Il y a une page blanche avec Internet Explorer (Mac), Firefox (Mac/Windows/Linux), safari (Mac) et Opera (Mac/Windows).

source: Problems with selection of some menus, bad page layout
fr: Problèmes de sélection de certains menus, mauvaise mise en page

source: Select boxes are not working and the page layout is very bad: texts/images overlap at the bottom of page.
fr: Les boîtes de sélections ne fonctionnent pas et la mise en page est très mauvaise : il y a un recouvrement de textes/images en bas de la page.

source: Site does not work on non Microsoft browsers
fr: Le site ne fonctionne pas avec les navigateurs non Microsoft

source: Site does not render correctly and 'Job Search' does not work with Netscape, Mozilla, Epiphany, Konqueror or Firefox. *** Updated on 2009-05-02 *** Website fixed.
fr: Le site ne s'affiche pas correctement et 'Job Search' ne fonctionne pas avec Netscape, Mozilla, Epiphany, Konqueror ou Firefox. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: No video possible, bad page layout
fr: Pas de vidéo possible, mauvaise mise en page

source: Impossible to see videos, they work only with Internet Explorer. Moreover, the page layout is bad: groups with small photo on the left go beyond the end of the page on white background. *** Updated on 2005-12-11 *** Website fixed.
fr: Impossible de voir les vidéos, elles ne fonctionnent qu'avec Internet Explorer. De plus la mise en page est mauvaise : les groupes avec la petite photo sur la gauche s'étendent en dessous de la fin de la page sur fond blanc. *** Mise à jour le 11/12/2005 *** Site corrigé.

source: Identification problem
fr: Problème d'identification

source: Boxes for login and password are not well placed, it is hard to validate values, the OK button which can be used only with the mouse seems to be under the password. It is possible to validate using the Enter key. *** Updated on 2005-08-28 *** Still some page layout problems (for example with Mozilla/Firefox on Linux), but login and OK button are now properly displayed.
fr: Les cadres pour entrer identifiant et mot de passe ne sont pas bien placés mais surtout, il est difficile de valider les valeurs, le bouton OK qui est seulement accessible par un clic de souris semble se trouver sous le mot de passe. Il est néanmoins possible de valider en tapant sur la touche Entrée. *** Mise à jour le 28/08/2005 *** Toujours quelques problèmes de mise en page (par exemple avec Mozilla/Firefox sous Linux), mais le login et le bouton OK sont désormais bien affichés.

source: Empty page with Firefox
fr: Page vide avec Firefox

source: The website uses JavaScript to redirect the user to http://193.251.176.210/papeterie/. With Mozilla Firefox, there's an empty page.
fr: Le site utilise du JavaScript pour rediriger le visiteur vers http://193.251.176.210/papeterie/. Avec Mozilla Firefox, il y a une page vide.

source: Navigation issues with Firefox and Opera
fr: Problèmes de navigation avec Firefox et Opera

source: When trying to look at settlements, addresses are displayed for some seconds and then a 404 page is displayed. With Opera, the menus on the left are not displayed.
fr: Lorsqu'on veut aller voir les implantations, les adresses s'affichent quelques secondes puis on a droit à une erreur 404. Sous Opera, les menus de gauche ne sont pas affichés.

source: Error message on at registration: "Please Update Your Browser You are using a web browser that is not fully compatible with Homestead. Homestead works best with the most recent version of web browsers such as Microsoft Internet Explorer. To access the Homestead website, you will need to use one of the following web browsers on a computer running the Windows operating system. Web browsers compatible with Homestead: Microsoft Internet Explorer 4.0 and above. Netscape Navigator 4.06 - 4.08, 4.51 - 4.8, 6 and above. Still having trouble? Download a free copy of Microsoft Internet Explorer. Contact customer support for assistance." *** Updated on 2009-05-02 *** Website no longer exists.
fr: Message d'erreur à l'inscription : "Please Update Your Browser You are using a web browser that is not fully compatible with Homestead. Homestead works best with the most recent version of web browsers such as Microsoft Internet Explorer. To access the Homestead website, you will need to use one of the following web browsers on a computer running the Windows operating system. Web browsers compatible with Homestead: Microsoft Internet Explorer 4.0 and above. Netscape Navigator 4.06 - 4.08, 4.51 - 4.8, 6 and above. Still having trouble? Download a free copy of Microsoft Internet Explorer. Contact customer support for assistance." *** Mise à jour le 02/05/2009 *** Le site n'existe plus.

source: Videos can not be played
fr: Impossibilité de voir les vidéos

source: Error message when trying to play a video: "ERROR Si vous souhaitez utiliser cette application sous Netscape, vous devez installer la version 4.7. Téléchargez maintenant. Utilisez le code d'erreur suivant pour votre correspondance avec l'aide Yahoo! (Error Code: 12)"
fr: Message d'erreur lorsqu'on veut lire les clips : "ERROR Si vous souhaitez utiliser cette application sous Netscape, vous devez installer la version 4.7. Téléchargez maintenant. Utilisez le code d'erreur suivant pour votre correspondance avec l'aide Yahoo! (Error Code: 12)"

source: Many pages not accessible with Firefox
fr: Plusieurs pages non accessibles avec Firefox

source: The page "jeux" and "j.net Mag" can not be displayed with Firefox, but work fine with Internet Explorer.
fr: La page "jeux" ainsi que la page "j.net Mag" ne se chargent pas avec Firefox, mais fonctionnent avec Internet Explorer.

source: Left menus not accessible
fr: Menus de gauche non accessibles

source: Left menus are not accessible, the website is unusable. *** Updated on 2005-06-08 *** Le site a été mis à jour, les menus sont désormais accessibles.
fr: Les menus de gauche ne sont pas accessibles, le site est inutilisable. *** Mise à jour le 08/06/2005 *** Le site a été mis à jour, les menus sont désormais accessibles.

source: Form specific to Internet Explorer
fr: Formulaire spécifique Internet Explorer

source: In Particuliers -> espace client -> votre déménagement, to make a change on a billing, we have many options. Choosing one of the options triggers a JavaScript wich works only with Internet Explorer. URL d'accès direct: http://www.electrabel.be/myhome/productandconnections/move_fr.asp *** Updated on 2005-09-02 *** The form has been fixed.
fr: Dans Particuliers -> espace client -> votre déménagement, pour effectuer un changement sur une facturation, on a le choix entre trois options. Choisir une de ces options déclenche un JavaScript qui ne fonctionne qu'avec Internet Explorer. URL d'accès direct: http://www.electrabel.be/myhome/productandconnections/move_fr.asp *** Mise à jour le 02/09/2005 *** Le formulaire a été corrigé.

source: Website completely unusable
fr: Site complètement illisible

source: Fonts overlap, bad page layout, menu not visible, images missing, all pages open in a new window, dead links, etc. This website is probably the winner on w3blacklist! *** Updated on 2006-02-02 *** The website can be considered as fixed, even if some minor page layouts are still there with Firefox, but this does not disturb the reading nor the navigation.
fr: Polices qui se recouvrent, mise en page désastreuse, menu non visibles, images manquantes, toutes les pages s'ouvrent dans une nouvelle fenêtre, liens morts, etc. Ce site détient assurément la palme d'or du plus mauvais site de w3blacklist ! *** Mise à jour le 02/02/2006 *** Le site peut être considéré comme corrigé, même s'il reste de légers problèmes de mise en page sous Firefox, mais qui n'empêchent désormais ni la lecture, ni la navigation.

source: On the first page, an error page is displayed.
fr: Dès l'entrée sur le site, on est redirigé sur une page d'erreur.

source: Menu not visible
fr: Menu non visible

source: The left menu is not visible with Mozilla/Firefox. *** Updated on 2005-03-21 *** The problem is only with Firefox on Linux, no problem on Windows.
fr: Le menu de gauche n'est pas visible sous Mozilla/Firefox. *** Mise à jour le 21/03/2005 *** Le problème ne concerne que la version Linux de Firefox, aucun problème à signaler sous Windows.

source: Menu is not working
fr: Menu inopérant

source: The left menu does not work.
fr: Le menu figurant sur la gauche ne fonctionne pas.

source: Website using Flash
fr: Site utilisant Flash

source: The Flash plugin is required to visit the website. With MacOS X, if the browser is not identified as Internet Explorer, the entry on the website is blocked, asking to install the Flash plugin. With MacOS X: * It does not work with: - Safari - Firefox (identified as Firefox) - Konqueror * It works with: - Internet Explorer - FireFox (identified as Internet Explorer).
fr: Besoin de plugin Flash pour voir le site. Avec MacOS X, si le navigateur n'est pas identifié en IE, l'entrée sur le site est bloquée, demandant d'installer le plugin Flash. Sous MacOS X : * Ne fonctionne pas avec : - Safari - Firefox (identifié Firefox) - Konqueror * Fonctionne avec : - Internet Explorer - FireFox (identifié en Internet Explorer).

source: Navigation issues with Firefox
fr: Problèmes de navigation avec Firefox

source: Display of some pages is only partial. On the download page, it is not possible to list the files to download or to search with Forefox: the list is empty.
fr: L'affichage de certaines pages ne se fait que de façon partielle. Sur la page de téléchargement, il est impossible de lister les fichiers à télécharger ou de faire un recherche avec Firefox : la liste est vide.

source: Search not possible
fr: Recherche impossible
