Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Version 0.0.3 of WeeWM is scheduled soon. Code has been cleaned up and secured. A "configure" script has been added, so that WeeWM is now more portable (for exemple *BSD). A new "smart" maximization function is under development: maximization of a window in bigger free space on current desktop. &bull; <a href="/weewm/download/">WeeWM download page</a>
fr: La version 0.0.3 de WeeWM est programmée pour bientôt. Le code a été entièrement nettoyé et sécurisé. Un script "configure" a été rajouté, ce qui rend WeeWM plus portable (par exemple pour *BSD). Une fonction de maximisation intelligente est en cours de développement : agrandissement d'une fenêtre sur le plus grand espace libre du bureau courant. &bull; <a href="/weewm/download/">Page téléchargement WeeWM</a>

source: Download center
fr: Centre de téléchargement

source: A download center has been created for FlashTux.org. Purpose is to put all links to files on one page, for all FlashTux.org projects. &bull; <a href="http://download.flashtux.org">FlashTux.org download center</a>
fr: Un centre de téléchargement a été mis en place pour FlashTux.org. L'objectif est de réunir sur une même page tous les fichiers du site, pour tous les projets de FlashTux.org. &bull; <a href="http://download.flashtux.org">Centre de téléchargement FlashTux.org</a>

source: WeeChat 0.0.5 is available! News since last version are: - info bar with highlight from other channels, can be modified by Perl scripts - /set command (configuration can be modified while WeeChat is running) - new command line parameter: "-c" to see config options - nick is now un*x username in default config - secured code to prevent any buffer overflow - many bugs fixed &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.45">v0.0.5 ChangeLog</a>
fr: WeeChat 0.0.5 est disponible ! Les nouveautés depuis la dernière version sont : - barre d'info avec highlight des autres canaux dedans et modification par scripts Perl - commande /set (modification de la configuration pendant que WeeChat tourne) - paramètre de ligne de commande "-c" pour voir les options de configuration - dans la config par défaut, le nick est l'utilisateur un*x - code sécurisé pour éviter tout débordement de tampon ("buffer overflow") - nombreux bugs corrigés &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="http://savannah.nongnu.org/cgi-bin/viewcvs/*checkout*/weechat/weechat/ChangeLog?rev=1.45">ChangeLog v0.0.5</a>

source: Solutions Linux meeting
fr: Salon Solutions Linux

source: FlashCode is at Solutions Linux meeting, wednesday Feb 4, on Tuxfamily stand. Following projects will be exposed: - EciAdsl, - WeeChat, - WeeWM.
fr: FlashCode sera présent mercredi 4 févrirer au salon Solutions Linux, sur le stand Tuxfamily. Les projets suivants y seront présentés : - EciAdsl, - WeeChat, - WeeWM.

source: New web hoster
fr: Changement d'hébergeur

source: FlashTux.org has new web hoster, due to Tuxfamily problems. Thanks to them for hosting us for more than one year. Site is now hosted by Lost Oasis. Part of site were or will be down for a moment, thanks for your comprehension.
fr: FlashTux.org a changé d'hébergeur, suite aux problèmes rencontrés par Tuxfamily. Merci à eux pour nous avoir hébergé pendant plus d'un an. Le site est maintenant hébergé par Lost Oasis. Certaines parties du site ont été ou seront inaccessibles pendant un certain temps, merci de votre compréhension.

source: Debian repository on FlashTux.org
fr: Dépôt Debian sur FlashTux.org

source: Debian repository has been created on FlashTux.org. All FlashTux.org projects with Debian packages are in this repository. To use it, add this line to your /etc/apt/sources.list: deb http://www.flashtux.org/debian unstable main
fr: Un dépôt Debian a été créé sur FlashTux.org. Tous les projets du site ayant des paquets Debian y sont présents. Pour y accéder, ajoutez cette ligne dans votre fichier /etc/apt/sources.list : deb http://www.flashtux.org/debian unstable main

source: New .bin file has been added (synch43.bin). It was created in Australia, with Arachnet provider (modulation G.DMT). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch43.bin). Il a été créé en Australie avec le fournisseur Arachnet (modulation G.DMT). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat 0.0.4 is available! News since last version are: - Perl scripts support, with auto-load - highlight - Ctrl-C now intercepted (ignored) - debug messages can be enabled via ./configure --enbale-debug option - many bugs fixed &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.0.4 est disponible ! Les nouveautés depuis la dernière version sont : - support des scripts Perl (avec chargement automatique) - highlight - Ctrl-C ignoré - messages de debug configurables via l'option ./configure --enable-debug - nombreux bugs corrigés &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: EciAdsl CVS ok with 2.4 and 2.6 kernels
fr: CVS EciAdsl ok avec noyaux 2.4 et 2.6

source: EciAdsl CVS is now ok with 2.4 and 2.6 kernels. &bull; <a href="/eciadsl/download/devel/">EciAdsl CVS download</a> &bull; <a href="/files/eciadsl/beta/">Patch for 2.6.x kernels</a>
fr: Le CVS EciAdsl est désormais compatible avec les noyaux 2.4 et 2.6. &bull; <a href="/eciadsl/download/devel/">Téléchargement CVS EciAdsl</a> &bull; <a href="/files/eciadsl/beta/">Patch pour noyaux 2.6.x</a>

source: EciAdsl driver OK with 2.6.0 kernel
fr: Driver EciAdsl OK avec le noyau 2.6.0

source: EciAdsl has been tested with success on 2.6.0 kernel (thanks to crevetor). Note: version for this kernel is not merged with official version for 2.4.xx kernels and is not compatible with 2.4 kernels. To run this driver, you have to patch 2.6.0 kernel and use special EciAdsl v0.8 version. Thanks for reading Readme.txt in the directory (link below). &bull; <a href="/files/eciadsl/beta/">EciAdsl compatible with 2.6.0 kernel</a>
fr: EciAdsl a été testé avec succès sur le noyau 2.6.0 (merci à crevetor). A noter : la version pour ce noyau n'est pas encore fusionnée avec la version officielle pour noyaux 2.4.xx et n'est pas compatible avec les noyaux de la série 2.4. Pour fonctionner, le noyau 2.6.0 doit être patché et vous devez donc utiliser une version modifiée du driver v0.8. Merci de lire attentivement le Readme.txt se trouvant dans le lien ci-dessous. &bull; <a href="/files/eciadsl/beta/">EciAdsl compatible avec le noyau 2.6.0</a>

source: EciAdsl driver and 2.6.0 kernel
fr: Driver EciAdsl et noyau 2.6.0

source: Today EciAdsl driver works with 2.6.0 kernel but versions available online are NOT ok with this kernel. We're working hard on this problem, thanks for your patience and please don't send us mails for asking how to run EciAdsl with 2.6.0 kernel If running 2.6.0 kernel is for you question of life or death, please join us on IRC, we'll explain you how to do for this kernel ;) &bull; <a href="/eciadsl/support/">EciAdsl support</a>
fr: Aujourd'hui le driver EciAdsl fonctionne à peu près sur noyau 2.6.0 mais aucune version en ligne ne permet encore de se connecter avec ce noyau. Nous travaillons activement sur ce problème, aussi merci de votre patience et de ne pas nous submerger de mails pour nous demander comment le faire fonctionner. Si passer au noyau 2.6.0 est pour vous une question de vie ou de mort, vous pouvez passer sur IRC on vous expliquera comment faire ;) &bull; <a href="/eciadsl/support/">Support EciAdsl</a>

source: EciAdsl, *BSD version
fr: Driver EciAdsl pour *BSD

source: EciAdsl for *BSD is now available. Please note that this version has been tested only with NetBSD and that there's not support today for this version. But we welcome all bugs or comments about this version ;) &bull; <a href="/eciadsl/download/devel/">EciAdsl driver for *BSD</a>
fr: La version *BSD du driver EciAdsl est désormais disponible. A noter qu'elle n'a été testée que sous NetBSD et qu'aucun support n'est aujourd'hui disponible pour cette version. Nous accueillons néanmoins toutes les remarques sur cette première version ;) &bull; <a href="/eciadsl/download/devel/">Driver EciAdsl pour *BSD</a>

source: WeeChat scripts page
fr: Page de scripts pour WeeChat

source: WeeChat scripts page (today Perl scripts only) has been added. On this page you can submit your script (need to be approved by WeeChat development team). Nota: Perl scripts required version of WeeChat > 0.0.3, so today you must download develepment version. &bull; <a href="/weechat/scripts/">WeeChat scripts page</a> &bull; <a href="/weechat/download/devel/">WeeChat development version</a>
fr: Une page pour les scripts WeeChat (pour l'instant en Perl) a été ajoutée au site. Sur cette page vous pouvez soumettre vos scripts, qui seront modérés par l'équipe de développement WeeChat. A noter: les scripts Perl fonctionnent avec une version de WeeChat supérieure à 0.0.3, soit à ce jour la version de développement uniquement. &bull; <a href="/weechat/scripts/">Page des scripts WeeChat</a> &bull; <a href="/weechat/download/devel/">WeeChat, version de développement</a>

source: New .bin file has been added (synch42.bin). It was created in Italy, with Tin.it provider (modulation G.DMT). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch42.bin). Il a été créé en Italie avec le fournisseur Tin.it (modulation G.DMT). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New .bin file has been added (synch41.bin). It was created in UK, with Etisalat provider. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch41.bin). Il a été créé en Angleterre avec le fournisseur Etisalat. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New .bin file has been added (synch40.bin). It was created in Bordeaux (France), with Nerim provider, T1.413 modulation. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch40.bin). Il a été créé à Bordeaux (France) avec le fournisseur Nerim, modulation T1.413. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New .bin file has been added (synch39.bin). It was created in UK, with Eclipse Internet provider, T1.413 modulation. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch39.bin). Il a été créé en Angleterre avec le fournisseur Eclipse Internet, modulation T1.413. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat 0.0.3 is available! News since last version are: - script ./configure to build WeeChat - French translation - new commands: stats, service, squit, motd, lusers, links, time, trace, admin, info, servlist, squery, who, whowas, die, summon, users, wallops, userhost, ison, ctcp ping - many bugs fixed &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.0.3 est disponible ! Les nouveautés depuis la dernière version sont : - script ./configure pour construire WeeChat - traduction française - nouvelles commandes : stats, service, squit, motd, lusers, links, time, trace, admin, info, servlist, squery, who, whowas, die, summon, users, wallops, userhost, ison, ctcp ping - nombreux bugs corrigés &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: *BSD version of driver… soon!
fr: Version *BSD du driver… bientôt !

source: *BSD version of EciAdsl driver is under development. USB API was completely rewritten by Benoit Papillault, it is now compatible with many OS (Linux, *BSD, QNX, etc.). Today no *BSD version is available, but Benoit already managed to connect to the net with OpenBSD, so good news should not delay ;)
fr: La version *BSD du driver EciAdsl est en cours de finalisation. Benoit Papillault a complètement réécrit l'API USB, qui est désormais portable (Linux, *BSD, QNX, etc.). Aujourd'hui aucune version n'est disponible pour *BSD, mais Benoit ayant réussi à se connecter sous OpenBSD, la bonne nouvelle ne devrait pas tarder ;)

source: WeeChat documentation
fr: Documentation WeeChat

source: First version of WeeChat users guide is available. Many formats: PDF, html, text and texinfo (source document). Note: this documentation is not finished and we're still looking for translators, feel free to contact us ;) &bull; <a href="/weechat/doc/">WeeChat User Guide</a>
fr: La première version du guide utilisateur WeeChat est en ligne, dans différents formats : PDF, html, texte et texinfo (document source). NB : cette documentation n'est pas encore terminée et nous cherchons toujours des traducteurs, n'hésitez pas à nous contacter ;) &bull; <a href="/weechat/doc/">Guide utilisateur WeeChat</a>

source: WeeChat 0.0.2 is available! News since last version are: - added commands /rehash and /restart - command and auto-join channels when connected to server - new commands for alias: /alias, /unalias (new section in config file) - config is now saved automatically when quitting WeeChat, /save command added - new commands for servers: /server, /connect, /disconnect - added autoconnect flag for each server in config file - added "look_set_title" option in config file - term window title is modified with WeeChat name and version - CTCP version returns more info (about OS) - many bugs fixed (including nicklist display bug) &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: WeeChat 0.0.2 est disponible ! Les nouveautés depuis la dernière version sont : - nouvelles commandes /rehash et /restart - commande exécutée et auto-join des canaux lorsque la connexion au serveur est établie - nouvelles commandes pour les alias: /alias, /unalias (nouvelle section dans le fichier de configuration) - la configuration est sauvée en quittant WeeChat, commande /save ajoutée - nouvelles commandes pour les serveurs: /server, /connect, /disconnect - option d'auto-connexion pour chaque serveur du fichier de configuration - ajout de l'option de configuration "look_set_title" - le titre de la fenêtre de terminal est modifié avec le nom et la version de WeeChat - la version CTCP retourne plus d'informations (sur l'OS) - nombreux bugs corrigés (dont l'affichage de la fenêtre des nicks) &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: New .bin file has been added (synch38.bin). It was created in Egypt, Cairo, with Menanet provider, G.DMT modulation. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch38.bin). Il a été créé en Egypte au Caire avec le fournisseur Menanet, modulation G.DMT. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New .bin file has been added (synch37.bin). It was created in Bangalore (India). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch37.bin). Il a été créé à Bangalore (Inde). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat 0.0.1 released!
fr: WeeChat 0.0.1 disponible !

source: WeeChat, the fast, light and extensible IRC client, is released for the first time, version 0.0.1. CVS is opened on Savannah page. Warning, this is still Alpha version, all IRC commands are not yet developed and lot of work is to be done. In this version, there is: - Curses front-end (other front-end are not yet developed), - almost all IRC commands from RFC1459, - multi-servers, - configuration file, - completion, commands history, - etc. (see ChangeLog and TODO files) Note to people who wants to help us: - we're looking for translations for WeeChat and documentation (not written today), for example german, spanish, italian, etc. - we're looking too for people which knows other OS (like *BSD, GNU/Hurd, etc.) to port WeeChat. All suggestions and bug reports are welcome, look at WeeChat support page for contacting us. &bull; <a href="/weechat/download/">WeeChat download page</a> &bull; <a href="/weechat/about/">WeeChat support</a>
fr: WeeChat, le client IRC rapide, léger et extensible est disponible dans sa toute première version, 0.0.1. Le CVS est accessible sur Savannah. Attention, il s'agit d'une version Alpha, toutes les commandes IRC ne sont pas encore implémentées et beaucoup de travail reste à faire. Dans cette version il y a : - interface Curses (les autres ne sont pas encore développées), - une bonne partie des commandes IRC de la RFC1459, - multi-serveur, - fichier de configuration, - complétion, historique des commandes, - etc. (voir les fichiers ChangeLog et TODO) Note aux personnes souhaitant aider : - nous recherchons des traducteurs pour WeeChat et sa documentation (qui n'est pas encore écrite), par exemple pour l'allemand, l'espagnol, l'italien, etc. - nous recherchons aussi des personnes connaissant d'autres OS (*BSD, GNU/Hurd, etc.) pour y porter WeeChat. Toutes les remarques, report de bugs, et suggestions sont les bienvenues, voir la page de support WeeChat pour nous contacter. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a> &bull; <a href="/weechat/about/">Support pour WeeChat</a>

source: New .bin file has been added (synch36.bin). It was created in Vishakhapatnam (India). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch36.bin). Il a été créé à Vishakhapatnam (Inde). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New WeeChat screenshot
fr: Nouvelle capture d'écran WeeChat

source: IRC Client WeeChat is under development, a new screenshot is available: nick list and window for each channel. This version is still unstable and doesn't implement all IRC commands. Current developments are: - IRC protocol, - configuration file management, - ncurses front-end (color display, window management), - Gtk+ and Qt front-ends. &bull; <a href="/files/weechat/shots/">WeeChat screenshot</a> &bull; <a href="/weechat/download/">Version alpha 0.0.1 (under développement)</a>
fr: Le client IRC WeeChat est en plein développement, une nouvelle capture d'écran a été ajoutée: liste des nicks et une fenêtre pour chaque canal. Cette version n'est pas encore stable et n'implémente pas encore toutes les commandes du protocole IRC. Les développements en cours portent sur : - protocole IRC, - gestion du fichier de configuration, - interface ncurses (affichage en couleur, gestion des fenêtres), - interfaces Gtk+ et Qt. &bull; <a href="/files/weechat/shots/">Capture d'écran WeeChat</a> &bull; <a href="/weechat/download/">Version alpha 0.0.1 (en développement)</a>

source: New .bin file has been added (synch35.bin). It was created in Turino (Italia). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch35.bin). Il a été créé à Turin (Italie). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New .bin file has been added (synch34.bin). It was created in Lucerne (Switzerland). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau fichier .bin de synchro a été ajouté (synch34.bin). Il a été créé à Lucerne (Suisse). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: EciAdsl documentation in Spanish
fr: Documentation EciAdsl en espagnol

source: EciAdsl documentation has been updated for version 0.8 (minor changes) and translated to spanish, thanks to Eduardo Gonzalez. &bull; <a href="/eciadsl/doc/">EciAdsl documentation</a>
fr: La documentation EciAdsl a été mise à jour pour la version 0.8 (changements mineurs) et traduite en espagnol, un grand merci à Eduardo Gonzalez. &bull; <a href="/eciadsl/doc/">Documentation EciAdsl</a>

source: Version 0.8 is available (no changes since 0.8 beta). This version fixes a major stability bug. All users should upgrade to this version in order to have stable connection when USB problems occurs. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version 0.8 est disponible (aucun changement par rapport à la version 0.8 beta). Cette version corrige un problème majeur de stabilité du driver. Tous les utilisateurs sont invités à installer cette nouvelle version pour avoir une connection stable face aux problèmes USB. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeChat screenshot
fr: Capture d'écran de WeeChat

source: First WeeChat screenshot is available (version with ncurses interface). This chat client is under development, first stable version will be available soon. Thanks for your patience… &bull; <a href="/files/weechat/shots/">WeeChat screenshot</a>
fr: La première capture d'écran de WeeChat est disponible (version avec interface ncurses). Ce client de discussion est toujours en développement, patience pour la première version stable… &bull; <a href="/files/weechat/shots/">Capture d'écran WeeChat</a>

source: WeeWM version 0.0.2 is available. News: - memorization of position, width/height, desktop, - fix/unfix windows, - improved dock management, - doc updated. &bull; <a href="/weewm/download/">Download page</a> &bull; <a href="/weewm/doc/">WeeWM documentation</a>
fr: La version 0.0.2 de WeeWM est disponible. Nouveautés : - mémorisation de la position, taille et bureau des fenêtres, - "collage" des fenêtres, - gestion du dock améliorée, - documentation complétée et mise à jour. &bull; <a href="/weewm/download/">Page téléchargement</a> &bull; <a href="/weewm/doc/">Documentation WeeWM</a>

source: WeeChat project is started. It is a chat client, with many features like: - irc client, - many GUI: text, ncurses and gtk, - multi-platforms, - fast, light and extensible with scripts. - etc. &bull; <a href="/weechat/">WeeChat homepage</a>
fr: Le projet WeeChat a démarré. Il s'agit d'un client de discussion avec les fonctions suivantes : - client irc, - plusieurs interfaces : texte, ncurses et gtk, - multi-plateformes, - rapide, léger, et extensible par des scripts. - etc. &bull; <a href="/weechat/">Page d'accueil WeeChat</a>

source: Version 0.8 beta available for tests
fr: Version 0.8 beta disponible pour tests

source: Version 0.8 is available for tests. Warning: this is not final version! Major bug was fixed: stability problem when USB problems occured. People who have stability problems can try this version immediately ;) Thanks for reporting us any problem with this version (about ackages or driver problem) and please tell us if stability problems are resolved. &bull; <a href="/files/eciadsl/beta/">Version 0.8 beta</a>
fr: La version 0.8 est disponible pour des tests. Attention : il ne s'agit pas de la version finale ! La correction majeure concerne un problème de stabilité du driver face aux problèmes USB. Ceux qui ont des problèmes de stabilité du driver peuvent donc se ruer dessus sans attendre ;) Merci de nous remonter au plus vite tout problème avec cette version (aussi bien en ce qui concerne les packages que l'utilisation du driver) et de nous indiquer si les problèmes de stabilité sont corrigés. &bull; <a href="/files/eciadsl/beta/">Version 0.8 beta</a>

source: New synch .bin has been added (synch33.bin), created in France (Avignon). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch33.bin), créé en France (Avignon). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: CVS available
fr: CVS disponible
