Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Afterwards, we will build several different .bin files that we will distribute with the driver.
fr: Par la suite, nous construirons plusieurs fichiers .bin différents que nous distribuerons avec le driver.

source: (Nowadays - October 2004 - we still do not know what is exactly in these sync .bin files).
fr: (À ce jour - Octobre 2004 - nous ne savons toujours pas ce qu'il y a exactement dans ces fichiers .bin de synchronisation).

source: Nevertheless, we suspect that the connection remains the most difficult and it will surely take time to understand all the mechanisms…
fr: Néanmoins, nous nous doutons que la connexion reste l'étape la plus difficile et cela demandera sûrement du temps pour comprendre tous les mécanismes…

source: In addition, Laurent Wandrebeck (aka "low") and "wwp" join the development team.
fr: De plus, Laurent Wandrebeck (aka "low") et "wwp" rejoignent l'équipe de développement.

source: "Networld Interop'" show
fr: Salon "Networld Interop'"

source: In parallel with the development, I tell myself that any documentation on the modem would be welcome.
fr: En parallèle du développement, je me dis que toute documentation sur le modem serait la bienvenue.

source: I discover by chance that a show called "Networld Interop '" will take place in Paris in September 2001 with a stand held by… Eci Telecom!
fr: Je découvre par hasard qu'un salon nommé "Networld Interop'" va avoir lieu à Paris au mois de septembre 2001 avec un stand tenu par… Eci Telecom !

source: So I have the idea to organize an online petition and to give it to Eci Telecom on the show, to show them our determination to obtain the documentation and be able to continue in the best conditions the development of our driver.
fr: J'ai donc l'idée d'organiser une pétition en ligne et de la remettre sur le salon à Eci Telecom pour leur montrer notre détermination à obtenir la documentation et pouvoir continuer dans les meilleures conditions le développement de notre driver.

source: On 2001, September 10th I put the petition online and I invite all people interested in the project to sign it.
fr: Le 10 septembre 2001 je mets la pétition en ligne et j'invite tous les gens intéressés par le projet à la signer.

source: The show takes place on September 18th, only 8 days later, and the petition contains 1370 signatures!
fr: Le salon se tient le 18 septembre, soit 8 jours après seulement et la pétition compte déjà 1370 signatures !

source: I have an appointment with Marc-Aurèle DARCHE, member of the AFUL (French-speaking Association of Linux Users and Free Software), and two (future) users of the driver supporting me: Vincent Planchenault and Philip J.
fr: J'ai rendez-vous avec Marc-Aurèle DARCHE, membre de l'AFUL (Association Francophone des Utilisateurs de Linux et des Logiciels Libres), et deux (futurs) utilisateurs du driver me soutenant : Vincent Planchenault et Philip J.

source: I give as agreed the petition to Eci Telecom, strong of its 1370 signatures. Thierry Berton (Commercial Director Eci Telecom) assures us that he will do its best to get the documentation.
fr: Je remets comme convenu la pétition à Eci Telecom, forte de ses 1370 signatures. Thierry Berton (directeur commercial Eci Telecom) nous assure qu'il fera son maximum pour que nous obtenions la fameuse documentation.

source: We leave with his e-mail address, and confident in the following our exchanges with Eci Telecom.
fr: Nous repartons avec son adresse e-mail, et confiant dans la suite de nos échanges avec Eci Telecom.

source: Unfortunately once again, these e-mail exchanges are not a success: still no documentation.
fr: Malheureusement une fois de plus, ces échanges par e-mails se solderont par un échec : toujours pas de documentation.

source: I decide to leave the petition online, in case we would need again, and we continue development without documentation.
fr: Je décide de laisser la pétition en ligne, au cas où nous en aurions à nouveau besoin, et nous continuons le développement sans documentation.

source: Goal: connection
fr: Objectif : connexion

source: There things become complicated…
fr: Là les choses se compliquent sérieusement…

source: For a few months, we wade and stagnate…
fr: Pendant quelques mois, nous pataugeons et stagnons…

source: The lack of documentation and knowledge about the behavior of the modem chipset is lacking…
fr: L'absence de documentation et de connaissances sur le fonctionnement du modem nous fait cruellement défaut…

source: It should be noted that at this time there is a strong craze for this project, and many people support us and encourage us to come to a version to connect. This helps us to stay motivated about our main goal: be able to connect to the internet with this modem under Linux.
fr: Il faut noter qu'à ce moment là il y a un fort engouement pour ce projet, et beaucoup de gens nous soutiennent et nous encouragent pour que l'on arrive à une version permettant de se connecter. Ceci nous aide à rester motivés pour notre objectif principal : se connecter à internet avec ce modem sous Linux.

source: Achievement
fr: Accomplissement

source: At the beginning of December 2001, while everything had stagnated for several months, an event for the least unexpected will accelerate the development: Benoît PAPILLAULT moved and got an Eci HiFocus USB modem, at his request and despite France Telecom's warning that it was not working under Linux.
fr: Début décembre 2001, alors que tout stagnait depuis plusieurs mois, un événement pour le moins inattendu va bouleverser le développement : Benoît PAPILLAULT a déménagé et a obtenu un modem Eci HiFocus USB, à sa demande et malgré l'avertissement de France Telecom indiquant qu'il ne fonctionnait pas sous Linux.

source: He suddenly finds himself obliged to use the Eci modem, that does not work on Linux yet.
fr: Il se retrouve donc subitement dans l'obligation d'utiliser le modem Eci, qui ne fonctionne pas encore sous Linux.

source: He obviously joins the development team on a full-time basis and starts to study the Eci modem.
fr: Il rejoint évidemment à plein temps l'équipe de développement et se lance dans l'étude de la connexion avec le modem Eci sous Linux.

source: In a few days, he manages to unblock the situation and to connect briefly on the Internet.
fr: En quelques jours, il réussit à débloquer la situation et à se connecter brièvement à Internet.

source: On December 7, 2001, the entire team proudly announces first version 0.1 of the driver to connect to the Internet!
fr: Le 7 décembre 2001, toute l'équipe annonce fièrement la toute première version 0.1 du driver permettant de se connecter à Internet !

source: Our goal is REACHED!
fr: Notre objectif est ATTEINT !

source: I naively thought at that moment that the driver was finished and that I could move on now that my Internet connection worked perfectly under Linux.
fr: J'ai naïvement pensé à ce moment que le driver était terminé et que je pouvais passer à autre chose maintenant que ma connexion Internet fonctionnait parfaitement sous Linux.

source: In fact the development of the driver was just beginning…
fr: En fait le développement du driver ne faisait que commencer…

source: Driver development
fr: Développement du driver

source: The sequence of the first versions
fr: L'enchaînement des premières versions

source: The first versions generated a real enthusiasm on the part of many users.
fr: Les premières versions ont suscité un réel engouement de la part de nombreux utilisateurs.

source: This has two consequences:
fr: Ceci a deux conséquences :

source: we have to stabilize the first version which was more than "alpha"
fr: nous devons stabiliser la première version qui était plus qu'"alpha"

source: we need to provide support for driver installation, which is not not yet very obvious, no configuration tool has been developed at this stage.
fr: nous devons assurer un support pour l'installation du driver, qui n'est pas encore très évidente, aucun outil de configuration n'ayant été développé à ce stade.

source: In December 2001, we release three versions, until the version 0.3, made available on Christmas Eve.
fr: En décembre 2001, nous enchaînons trois versions, jusqu'à la version 0.3, mise à disposition la veille de Noël.

source: Support becomes a preponderant part of the project and is now insured via a mailing list, IRC, and e-mail.
fr: Le support devient une part prépondérante du projet et est désormais assuré via une liste de diffusion, IRC, et mail.

source: Antoine REVERSAT (aka "crevetor") joins the development team.
fr: Antoine REVERSAT (aka "crevetor") rejoint l'équipe de développement.

source: In February 2002, we release version 0.4 of the driver, then Antoine creates an EciAdsl forum, which immediately wins a great success from users.
fr: En février 2002, nous mettons à disposition la version 0.4 du driver, puis Antoine créé un forum EciAdsl, qui remporte tout de suite un franc succès auprès des utilisateurs.

source: Major evolutions
fr: Les évolutions majeures

source: In April 2002, I develop with Antoine a graphical configuration tool for the driver. This tool allows you to completely configure the driver and then makes it accessible to Linux beginners.
fr: En avril 2002, je développe avec Antoine un outil de configuration graphique du driver. Cet outil permet de configurer entièrement le driver et le rend ainsi accessible aux débutants Linux.

source: In the following months, many foreign users (outside France) contact us. They own modems sold under other brands, but with the same Globespan chipset as us (the GS7070).
fr: Dans les mois qui suivent, de nombreux utilisateurs étrangers (hors de France) nous contactent. Ils possèdent des modems vendus sous d'autres marques, mais possédant le même chipset Globespan que nous (le GS7070).

source: With the help of some foreign contributors ("flynux" and "oliver the red"), we modify the driver to support these modems as well as the encapsulation protocols that are used in these countries.
fr: Dès lors avec l'aide de quelques contributeurs étrangers ("flynux" et "oliver the red"), nous modifions le driver pour supporter ces modems ainsi que les protocoles d'encapsulation qui sont utilisés dans ces pays.

source: The driver is now used in many countries and more and more modems are supported.
fr: Le driver est désormais utilisé dans de nombreux pays et de plus en plus de modems sont supportés.

source: The version 0.5 is released on May 2002, but does not allow yet to choose other modems than the Eci HiFocus.
fr: La version 0.5 sort en mai 2002, mais elle ne permet pas encore de choisir un autre modem que le Eci HiFocus.

source: In early September 2002, I set up a brand new site for the driver: <a href="https://eciadsl.flashtux.org">https://eciadsl.flashtux.org</a>
fr: Début septembre 2002, je mets en place un site tout neuf pour le driver : <a href="https://eciadsl.flashtux.org">https://eciadsl.flashtux.org</a>

source: Version 0.6 will be the Christmas present since the release on December 25, 2002, just over a year after the very first stable release.
fr: La version 0.6 constituera le cadeau de Noël puisque sortie le 25 décembre 2002, soit un peu plus d'un an après la toute première version stable.

source: It brings an impressive number of new features, among which:
fr: Elle apporte un nombre impressionnant de nouveautés, parmi lesquelles :

source: 28 modems supported
fr: 28 modems supportés

source: many PPP encapsulations
fr: plusieurs encapsulations PPP

source: graphical and text configuration tool
fr: outil de configuration graphique et texte

source: FAQ in driver and on the website
fr: FAQ dans le driver et sur le site

source: The following versions
fr: Les versions suivantes

source: The version 0.7 is released on March 2003. March. It fixes some bugs.
fr: La version 0.7 sort en mars 2003. Elle corrige quelques bugs.

source: The version 0.8 is released on August 2003. Like the previous release, it has only some bug fixes.
fr: La version 0.8 sort en août 2003. Comme la version précédente, elle contient seulement des correctifs.

source: On December 2003, Benoît releases a driver version which is working under BSD.
fr: En décembre 2003, Benoît sort une version du driver qui fonctionne sous BSD.

source: The version 0.9 is released on April 2004. This version works with Linux kernels 2.4 and 2.6.
fr: La version 0.9 sort en avril 2004. Cette version fonctionne sous les noyaux Linux 2.4 et 2.6.

source: New Globespan chipsets
fr: Nouveaux chipsets Globespan

source: On November 2003, "kolja" (Italian developer) joins the development team, with one goal: make changes in our driver to support his modem, a Nortek 2021, which has a Globespan GS7470 chipset.
fr: En novembre 2003, "kolja" (développeur italien) rejoint l'équipe de développement et a pour objectif d'adapter notre driver pour son modem, un Nortek 2021, qui possède un chipset Globespan GS7470.

source: He releases on February 2004 a modified version of the driver for his modem.
fr: Il met à disposition en février 2004 une version modifiée du driver pour son modem.

source: This new version is quickly used and then supports other compatible modems: BT100 and 105, Siemens Santis 10, Askey ALE130, etc.
fr: Cette nouvelle version est rapidement utilisée et supporte ensuite d'autres modems compatibles : les BT100 et 105, Siemens Santis 10, Askey ALE130, etc.

source: Nowadays - october 2004 - this driver must be merged in the standard version.
fr: À ce jour - octobre 2004 - ce driver doit être incorporé dans la version standard.

source: The future of the driver
fr: Le futur du driver

source: Many points for the future of the EciAdsl driver:
fr: Plusieurs points pour le futur du driver EciAdsl :

source: we are still waiting for documentation from Globespan (now Conexant) or Eci Telecom, and furthermore we do not find any free ADSL documentation on the internet,
fr: nous attendons toujours la documentation de la part de Globespan (maintenant Conexant) ou d'Eci Telecom, et de plus nous ne trouvons pas de documentation ADSL gratuite sur internet,

source: we want to integrate the driver in a maximum of distributions Linux / BSD, which is not easy with the licensing problems on the firmware and binary sync files,
fr: nous souhaitons intégrer le driver dans un maximum de distributions Linux / BSD, ce qui n'est pas simple avec les problèmes de licence sur le firmware et les fichiers binaires de synchronisation,

source: we want to improve the synchronization process for us get rid of .bin sync files,
fr: nous souhaitons améliorer le processus de synchronisation pour nous débarasser des fichiers .bin de synchro,

source: we need to merge the version supporting the new chipsets Globespan (package "Nortek") with the standard version.
fr: nous devons fusionner la version supportant les nouveaux chipsets Globespan (paquet "Nortek") avec la version standard.

source: Thanks
fr: Remerciements

source: The EciAdsl development team:
fr: L'équipe de développement EciAdsl :

source: I want to thank all the developers, the testers, the people who quickly reported problems, the foreign contributors which allowed us to adapt the driver for their country, and all driver users :)
fr: Je tiens à remercier tous les développeurs, les testeurs, les gens qui nous remonté rapidement les problèmes, les contributeurs étrangers qui nous ont permis d'adapter le driver pour leur pays, et tous les utilisateurs du driver :)

source: Support via IRC
fr: Support par IRC

source: For any problem (or for thanking us), you can discuss with development team on IRC:
fr: Pour tout problème (ou pour nous remercier), vous pouvez discuter avec l'équipe de développement sur IRC :

source: You can ask them for support:
fr: Vous pouvez les contacter pour du support :

source: <strong>Important:</strong> EciAdsl developers will NEVER ask you for your connection password, do not give it under any pretext!
fr: <strong>Important :</strong> les développeurs EciAdsl ne vous demanderont JAMAIS votre mot de passe de connexion, ne le donnez jamais votre mot de passe sous aucun prétexte !

source: Mailing list
fr: Liste de diffusion

source: With this mailing list, you can receive the latest news about EciAdsl development, and you can join all developers and users.
fr: Cette liste de diffusion vous permet de rester informé du développement du driver et de joindre les développeurs et utilisateurs.

source: You must subscribe to the mailing list to send or receive mails from it.
fr: Vous devez être inscrit pour envoyer des mails ou en recevoir de la liste de diffusion.

source: Subscribe/unsubscribe/infos:
fr: Inscription/désinscription/infos :

source: Developer, initiator of project
fr: Développeur, initiateur du projet

source: Developer, kernelmode driver
fr: Développeur, driver en mode noyau

source: Developer, usermode and BSD driver
fr: Développeur, driver usermode et BSD

source: Developer, driver for GS7470 chipsets
fr: Développeur, driver pour chipsets GS7470

source: Developer, support
fr: Développeur, support

source: Preamble
fr: Préambule

source: This tutorial was written for Linux beginners.
fr: Ce tutoriel est destiné aux débutants sous Linux.

source: If you know how to install programs and how to edit configuration files, you can refer to the documentation.
fr: Si vous savez déjà installer des programmes et éditer des fichiers de configuration, vous pouvez consulter la documentation.

source: This tutorial only describes RPM installation of driver, for ECI HiFocus or B-Focus modem in France.
fr: Ce tutoriel décrit seulement l'installation de la version RPM du driver en France pour un modem ECI HiFocus ou B-Focus.

source: Screenshots are here only for examples, some of them are old and do not show last version of EciAdsl.
fr: Les captures d'écran sont là seulement pour les exemples, certaines sont anciennes et ne représentent pas la dernière version d'EciAdsl.

source: For other packages / modems, please look at the documentation.
fr: Pour les autres modems et formats de paquets, veuillez vous reporter à la documentation.

source: Thanks to fisher for posting initial version of this tutorial on the forum.
fr: Remerciements à fisher pour avoir posté la verison initiale de ce tutorial sur le forum.

source: Step 1: download the driver
fr: Étape 1 : téléchargement du driver

source: Download .rpm version on <a href="%(url_download)s">this page</a>.
fr: Télécharger la version .rpm sur <a href="%(url_download)s">cette page</a>.

source: If you're under Windows with a floppy disk, save on the floppy to send it to Linux.
fr: Si vous êtes sous Windows et muni d'une disquette, enregistrer dessus pour transférer vers Linux.

source: Step 2: Driver installation
fr: Étape 2 : installation du driver

source: Unplug USB cable from modem.
fr: Débranchez le câble USB du modem.

source: Connected as root user (for example with Gnome).
fr: Connecté en utilisateur root (par exemple sous Gnome).

source: Open file manager as root (like Windows):
fr: Ouvrir le gestionnaire de fichiers en root (façon Windows) :

source: …otherwise on a root console (like un*x users):
fr: …ou bien sur la console root (façon utilisateur un*x) :

source: Disable or delete dabusb module:
fr: Désactiver ou supprimer le module dabusb :

source: if /etc/hotplug/blacklist exists, edit it and add a line containing the word 'dabusb' (without the quotes) to it. Restart Linux.
fr: si /etc/hotplug/blacklist est présent, éditez-le et ajoutez-y une ligne contenant le mot 'dabusb' (sans les quotes). Redémarrez Linux.

source: Otherwise, type:
fr: Sinon, tapez :

source: And that's all! Your modem is now installed!
fr: Et c'est fini ! Votre modem est installé !

source: Step 3: Connexion setup
fr: Étape 3 : configuration de la connexion

source: Run graphical configuration tool:
fr: Exécuter l'outil de configuration graphique :

source: or type:
fr: ou tapez :

source: And you see that:
fr: Et vous obtenez ceci :

source: Enter login, password, etc., and save.
fr: Entrer l'identifiant, le mot de passe et toutes les infos nécessaires puis sauvegarder.

source: Synch .bin files should be in /etc/eciadsl
fr: Les fichiers .bin de synchro doivent être dans /etc/eciadsl

source: On floppy disk, click with right button and choose Ark software.
fr: Sur la disquette, clic du bouton droit de la souris faites ouvrir avec et choisissez le logiciel Ark.

source: Step 4: Launch connection
fr: Étape 4 : Lancement de la connexion

source: Note: after plugging modem, LEDs should be off, otherwise please repeat step 2 (dabusb).
fr: Note : après l'avoir branché les voyants du modem doivent êtres éteintes sinon veuillez répéter l'étape 2 (dabusb).

source: To do that, type with plugged modem:
fr: Pour ce faire, taper ceci en ayant bien sûr pris soin de brancher le modem :

source: Note: LEDs power on (first red then green), if there is any error message like 'Authentication failed' please repeat step 3.
fr: Note : les voyants s'allument en premier la rouge puis la verte, s'il y a un message d'erreur du genre 'Authentication failed' veuillez seulement répéter depuis l'étape 3.

source: If you see a timeout and that green LED still blinks, please repeat step 3 and choose another .bin synch file.
fr: S'il y a un timeout et que le voyant vert clignote toujours, répéter l'opération depuis l'étape 3 en prenant soin de choisir un autre fichier .bin de synchro.

source: That's all, you should be connected :-)
fr: Voila, après cela vous devriez être connecté :-)

source: For any problem, please read <a href="%(url_doc)s">documentation</a> and <a href="%(url_faq)s">FAQ</a>.
fr: Pour tout problème, merci de lire la <a href="%(url_doc)s">documentation</a> et la <a href="%(url_faq)s">FAQ</a>.

source: Back to home
fr: Retour à l'accueil

source: FlashTris history
fr: Histoire de FlashTris

source: I develop games during my studies (see <a href="%(url_games)s">games page</a>). The best is Demoniac-Tris, a "Tetris like" running under Dos/Windows with IPX network support.
fr: Je développe des jeux en parallèle de mes études (voir la <a href="%(url_games)s">page des jeux</a>). Le plus abouti est Demoniac-Tris, un "Tetris like" fonctionnant sous Dos/Windows avec support réseau IPX.

source: I discover Linux. During one year, I develop some utilities to discover this fabulous system.
fr: Je dévouvre Linux. Pendant un an, je développe quelques utilitaires pour découvrir ce merveilleux système.

source: I decide to convert Demoniac-Tris to a Linux version. I encountered difficulties (langage Pascal ==> C and system Linux/Dos). I decided to leave this project and I would like to create a new "Tetris like", 100%% in C and assembly langage, 100%% compatible between Linux, Dos and Windows 3.x/95/98/2000/XP.
fr: Je me lance dans la conversion de Demoniac-Tris vers une version Linux. Devant les différences entre le langage (Pascal ==> C) et surtout le système d'exploitation, je décide d'abandonner et de créer un nouveau "Tetris like" écrit 100%% en C et assembleur, 100%% compatible Linux, Dos et Windows 3.x/95/98/2000/XP.

source: FlashTris is born.
fr: Naissance de FlashTris.

source: Technical info
fr: Infos techniques

source: FlashTris is developed and tested with a Pentium III 800, 450 Mb RAM, Linux Debian and Slackware, kernel 2.4.0, XFree 4.0.2
fr: FlashTris est développé et testé sur un Pentium III 800 avec 192 Mo de RAM, Linux Debian et Slackware, noyau 2.4.0, XFree 4.0.2

source: 100%% C/assembly langage, compatible Linux - Dos - Windows v3.x/95/98/2000/XP
fr: 100%% C/assembleur, compatible Linux - Dos - Windows v3.x/95/98/2000/XP

source: Optimised: 75%% of graphics and sound are written in assembly langage.
fr: Optimisé : routines graphiques et son à 75%% en assembleur.
