Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Enter "no" if you are not a spammer.
fr: Entrez "no" si vous n'êtes pas un spammeur.

source: M j, Y
fr: d/m/Y

source: M j, Y H:i
fr: d/m/Y H:i

source: Error 403: forbidden
fr: Erreur 403 : interdit

source: Error 403
fr: Erreur 403

source: Oh no! This page is forbidden…
fr: Oh non ! Cette page est interdite…

source: You're looking where you shouldn't? ;)
fr: Vous regardez où vous ne devriez pas ? ;)

source: Error 404: page not found
fr: Erreur 404 : page non trouvée

source: Error 404
fr: Erreur 404

source: Oh no! This page does not exist…
fr: Oh non ! Cette page n'existe pas…

source: You can go back to FlashTux home with link below,<br>or report broken link to
fr: Vous pouvez revenir à l'accueil FlashTux avec le lien ci-dessous,<br>ou signaler ce lien cassé à

source: FlashTux: free projects for free OS
fr: FlashTux : projets libres pour OS libres

source: Home
fr: Accueil

source: Language
fr: Langue

source: Projects
fr: Projets

source: About
fr: À propos

source: Screenshots
fr: Captures d'écran

source: Tutorial
fr: Tutoriel

source: Download
fr: Téléchargement

source: Story
fr: Histoire

source: Team
fr: Équipe

source: Letters
fr: Lettres

source: Development
fr: Développement

source: Programs
fr: Programmes

source: About FlashTux.org
fr: À propos de FlashTux.org

source: News
fr: Nouveautés

source: Programming language:
fr: Langage de programmation :

source: Author:
fr: Auteur :

source: Example
fr: Exemple

source: Screenshot
fr: Capture d'écran

source: Name
fr: Nom

source: Programming language
fr: Langage de programmation

source: Author
fr: Auteur

source: <strong>Important:</strong> %(project)s has been discontinued, the website is read-only and not updated any more.
fr: <strong>Important :</strong> %(project)s a été arrêté, le site est en lecture seule et n'est plus mis à jour.

source: Other EciAdsl documentations
fr: Autres documentations EciAdsl

source: Old versions
fr: Anciennes versions

source: Packages
fr: Paquets

source: Patch kernel 2.4.28 to 2.4.30:
fr: Patch noyau 2.4.28 à 2.4.30 :

source: Patch kernel 2.6.0 to 2.6.6:
fr: Patch noyau 2.6.0 à 2.6.6 :

source: Patch packet size:
fr: Patch taille de paquet :

source: Third-party contributions:
fr: Contributions externes :

source: EciAdsl and Linux kernels:
fr: EciAdsl et les noyaux Linux :

# kernel
source: From
fr: De

# kernel
source: To
fr: À

source: Status
fr: Statut

source: NOT recommended with EciAdsl.
fr: NON recommandé avec EciAdsl.

source: You have to patch it (see in <a href="#packages">Packages</a>).
fr: Vous devez appliquer un patch (voir dans les <a href="#packages">Paquets</a>).

source: Unknown status (not tested).
fr: Statut inconnu (non testé).

source: NOT recommended with EciAdsl (unstable).
fr: NON recommandé avec EciAdsl (instable).

source: NOT recommended with EciAdsl (<a href="%(url_bug)s">uhci bug</a> in kernel).
fr: NON recommandé avec EciAdsl (<a href="%(url_bug)s">bug uhci</a> dans le noyau).

source: Synchronization
fr: Synchronisation

source: <strong>Warning:</strong> you must try ALL .bin files according to your chipset (you have to shutdown the modem between two attempts) before reporting one of these problems to developers:
fr: <strong>Attention :</strong> vous devez essayer TOUS les fichiers .bin selon votre chipset (en éteignant le modem entre chaque test) avant de reporter un de ces problèmes aux développeurs :

source: synchronization problem (eci-load2 / eciadsl-synch timeout)
fr: problème de synchronisation (eci-load2 / timeout eciadsl-synch)

source: LCP timeout (when connecting to provider).
fr: timeout LCP (pendant la connexion au fournisseur d'accès).

source: Synchronization files (55 .bin for GS7070 chipset, 22 for GS7470):
fr: Fichiers de synchronisation (55 .bin pour le chipset GS7070, 22 pour GS7470) :

source: Package (bzip2):
fr: Paquet (bzip2) :

source: Sniffer (binaries):
fr: Sniffeur (binaires) :

source: Sniffer (sources):
fr: Sniffeur (sources) :

source: ECI windows driver:
fr: Driver windows ECI :

source: Installation instructions:
fr: Instructions d'installation :

source: unpack eciadsl-synch_bin.tar.bz2 package in /etc/eciadsl
fr: décompressez le paquet eciadsl-synch_bin.tar.bz2 dans /etc/eciadsl

source: run eciadsl-config-tk or eciadsl-config-text and follow instructions.
fr: lancez eciadsl-config-tk ou eciadsl-config-text et suivez les instructions.

source: <strong>Important:</strong> you must shutdown your modem between two attempts.
fr: <strong>Important :</strong> vous devez éteindre le modem entre deux tests.

source: You can make your own .bin with Windows and USB sniffer, look at <a href="%(url_doc)s">documentation</a>.
fr: Vous pouvez créer votre propre fichier .bin de synchro sous Windows avec le sniffeur USB, voir la <a href="%(url_doc)s">documentation</a>.

source: Development version
fr: Version de développement

source: <strong>Warning:</strong> kernelmode is <strong>not stable</strong>, it is not recommended to beginners.
fr: <strong>Attention :</strong> la version kernelmode n'est <strong>pas stable</strong>, elle n'est pas recommandée aux débutants.

source: EciAdsl usermode BSD (2006-01-31):
fr: EciAdsl usermode BSD (31/01/2006) :

source: CVS commits graph
fr: Graphique des commits CVS

source: All modems
fr: Tous les modems

source: No photo
fr: Pas de photo

source: Min EciAdsl
fr: EciAdsl mini

source: Chipset
fr: Puce

source: Country
fr: Pays

source: Provider(s)
fr: Fournisseur(s)

source: Synch .bin
fr: .bin de synchro

# noun
source: Comment
fr: Commentaire

source: <strong>EciAdsl</strong> is a free driver for USB ADSL modems embedding a Globespan chipset (GS7070 and GS7470 are supported).
fr: <strong>EciAdsl</strong> est un driver libre pour modems USB ADSL équipés d'un chipset GLobespan (GS7070 et GS7470 sont supportés).

source: It is released under the terms of the GNU General Public License version 2.
fr: Il est distribué sous licence GNU General Public License version 2.

source: EciAdsl, story of a driver unlike any other
fr: EciAdsl, histoire d'un driver par comme les autres

source: Written by FlashCode
fr: Écrit par FlashCode

source: At the beginning
fr: Au tout début

source: The story begins in 1999. I buy a computer magazine which promotes the Linux operating system and gives a CD-ROM with Kheops Slackware distribution.
fr: Tout commence en juin 1999. J'achète une revue informatique qui fait la promotion de Linux et fournit un CD avec une distribution Kheops Slackware.

source: I heard a lot about free softwares and Linux, but I had never tried this system.
fr: J'avais à de nombreuses reprises entendu parler des logiciels libres et de Linux, mais jamais je n'avais franchi le pas et installé ce système.

source: With this ready-to-install CD-ROM, I give a try. I programmed until this under MS-Dos, I never liked Windows, for various reasons: its lack of stability, opaque interface, general heaviness, and its price.
fr: Avec ce CD prêt à installer je me lance. Je programmais jusque là sous MS-Dos, n'ayant jamais apprécié Windows, pour diverses raisons : son manque de stabilité, son interface opaque, sa lourdeur générale, et enfin son prix.

source: With Linux I feel like home, and thus I decide to use it as a secondary OS, with MS-Dos, which I keep to continue to develop and use programs I made and don't run with Linux.
fr: Sous Linux je me sens tout de suite à l'aise, et je décide dès lors de l'utiliser en parallèle de MS-Dos, que je garde pour continuer à développer ou utiliser les programmes que j'ai faits et qui ne tournent pas sous Linux.

source: During almost two years, I develop games and various applications under Linux, to learn the system.
fr: Pendant presque deux ans, je développe des jeux et diverses applications sous Linux, afin de mieux connaître le système dans son ensemble.

source: At that time, I have an internet connection with a RTC 56k modem, and I connect only some days by week, mainly to read my e-mails.
fr: A cette époque je possède une connexion internet avec un modem RTC 56k, et je ne me connecte que quelques jours par semaine, principalement pour relever mes e-mails.

source: First steps with ADSL
fr: La découverte de l'ADSL

source: In March 2001, I made shopping in a supermarket close to my home, I see a Wanadoo stand where they do a demonstration of broadband Internet. I didn't now what was the "broadband" and how it worked.
fr: En mars 2001, alors que je faisais mes courses dans un supermarché non loin de chez moi, j'aperçois un stand Wanadoo faisant une démonstration d'Internet "Haut débit". Je ne savais pas très bien ce qu'était exactement le haut débit ni comment ça fonctionnait.

source: After a quick demonstration, I fill a form to receive within two months a modem with a subscription at Wanadoo, the only provider in my region at that time.
fr: Après une rapide démonstration, je me laisse tenter et je remplis une demande pour recevoir sous deux mois un modem avec abonnement chez Wanadoo, le seul fournisseur à couvrir ma région à cette époque.

source: The proposed modem was "Eci HiFocus", with Ethernet connection.
fr: Le modem proposé est un Eci HiFocus Ethernet.

source: Two months later, as scheduled, the France Telecom agency calls me and asks me if I have a USB port on my PC. Slightly surprised, I answer yes and they give me an appointment in the agency some days later to get my modem.
fr: Deux mois plus tard, comme convenu, l'agence France Telecom m'appelle et me demande si j'ai bien un port USB sur mon PC. Légèrement surpris, je réponds que oui et ils me donnent rendez-vous à l'agence quelques jours plus tard pour retirer mon modem.

source: I discover that I'll receive an "ECI HiFocus" USB modem, and not an Ethernet modem as they said two months ago. I'll discover later that this USB version has just been released and that I'm amongh the first users.
fr: Là je découvre que j'ai droit à un modem Eci HiFocus USB et non pas un Ethernet comme précisé deux mois plus tôt. Je découvrirai par la suite que cette version USB vient de sortir et que je suis parmi les premiers utilisateurs à en bénéficier.

source: I fill in all the papers and I go back at home to try and surf the internet at high speed!
fr: Je remplis tous les papiers et m'empresse de retourner chez moi pour essayer tout ça et surfer à grande vitesse !

source: Birth of the EciAdsl project
fr: Naissance du projet EciAdsl

source: The terrible report
fr: Le terrible constat

source: Back at home with the brand new ECI HiFocus modem, I browse the CD-ROM with drivers and I notice there's no Linux driver.
fr: Arrivé chez moi avec ce modem Eci HiFocus flambant neuf, je parcours le CD de pilotes fourni avec le modem et je constate qu'il n'y a pas de driver Linux.

source: I think then this modem should be supported by the Linux kernel. I browse all the kernel options to search a driver for this modem.
fr: Je me dis alors que ce modem doit être supporté par le noyau Linux. J'examine alors toutes les options du noyau à la recherche d'un driver pour ce modem.

source: After reviewing all the kernel options, I conclude that this modem should be supported by an external driver.
fr: Après un tour complet du noyau, je me dis que ce type de modem doit être supporté par un driver externe au noyau.

source: I reboot my old Windows, which was starting to take the dust, and I go on the Internet to search for a driver.
fr: Qu'à cela ne tienne ! Je reboote mon vieux Windows, qui commençait à prendre la poussière, et je pars sur internet à la recherche du fameux driver.

source: And there, my disappointment grows… After long hours of research, with different search engines, on Linux sites, etc. no driver found for this modem!
fr: Et là, ma déception grandit… après de longues heures de recherche, par différents moteurs de recherche, sur des sites Linux, etc. pas la moindre trace de driver pour ce modem !

source: Beginning of the EciAdsl driver
fr: Le début du driver EciAdsl

source: After a few days on Windows (to be able to enjoy the unlimited fast connection), I find the e-mail address of Benoît PAPILLAULT, who is developing a Linux / BSD driver for the Alcatel Speedtouch USB modem.
fr: Après quelques jours sous Windows (pour pouvoir profiter de la connexion illimitée et rapide), je trouve l'adresse e-mail de Benoît PAPILLAULT, qui développe un driver Linux / BSD pour le modem Alcatel Speedtouch USB.

source: I decide to contact him, hoping that his driver can work with my Eci modem. Unfortunately, our modems are not compatible.
fr: Je décide de le contacter, en espérant que son driver puisse fonctionner avec mon modem Eci. Réponse malheureusement négative, nos modems ne sont pas compatibles entre eux.

source: I still continue my research for a few weeks, before I get to the obvious: the manufacturer does not provide any driver for Linux, there is none available in the kernel or on any website, and nobody seems to work on such a driver…
fr: Je continue malgré tout ma recherche pendant quelques semaines, avant de me rendre à l'évidence : le constructeur ne fournit aucun driver pour Linux, il n'y en a pas de disponible dans le noyau ni sur aucun site Internet, et personne ne semble travailler sur un tel driver…

source: I therefore have three solutions:
fr: Il me reste donc trois solutions :

source: go back to Windows and do a cross on Linux
fr: retourner sous Windows et faire une croix sur Linux

source: wait for someone to develop the driver
fr: attendre que quelqu'un développe le driver

source: develop myself the driver.
fr: développer moi-même le driver.

source: After thinking a few days, the first solution being dismissed automatically, I decided to launch myself in developing the driver.
fr: Après quelques jours de réflexion, la première solution étant écartée d'office, je décide de me lancer moi-même dans l'écriture du driver.

source: So I'm starting to think about the skills I've learned under Linux and the ones I miss to reach my goal.
fr: Je commence donc à réfléchir aux compétences que j'ai acquises sous Linux et celles qui me manquent pour arriver à mon objectif.

source: My conclusion is:
fr: Ma conclusion est :

source: I am familiar with system programming: I developed various utilities during several years, under MS-Dos and Linux,
fr: je connais bien la programmation système pour avoir développé des utilitaires divers pendant plusieurs années, sous MS-Dos et Linux,

source: I do not know anything about ADSL technology, but I should be able to find documents on Internet,
fr: je ne connais rien à la technologie de l'ADSL, mais je dois pouvoir trouver des documents sur Internet,

source: I do not know anything about USB, but it is well documented,
fr: je ne connais rien à l'USB, mais c'est bien documenté,

source: and especially I have no documentation on the modem, I do not know at all how is working the chipset inside.
fr: et surtout je n'ai aucune documentation sur le modem, je ne connais pas du tout le fonctionnement de la puce qui est dedans.

source: So my technical knowledge is not sufficient to develop this driver alone and I will need help.
fr: Donc mes connaissances techniques sont insuffisantes pour développer ce driver seul et j'aurai besoin d'aide.

source: Getting to know the Linux community and the spirit of help between users, I think that I should not be the only person with this modem and trying to use it under Linux, and that necessarily people would be willing to help me in this work (three years later, I confirm that I was right!).
fr: Commençant à bien connaître la communauté Linux et l'esprit d'aide entre utilisateurs, je me dis que je ne dois pas être le seul à avoir ce modem et à vouloir l'utiliser sous Linux, et que forcément des gens seraient prêts à m'aider dans ce travail (avec trois années de recul, je confirme que j'avais entièrement raison !).

source: Constitution of the team
fr: Constitution de l'équipe

source: I recontact Benoît PAPILLAULT in June 2001 to ask him if he can help me to develop this driver.
fr: Je recontacte Benoît PAPILLAULT en juin 2001 pour lui demander s'il peut m'aider dans l'écriture de ce driver.

source: With his positive response, I start writing a Linua page on my website (<a href="http://flashcode.free.fr">http://flashcode.free.fr</a>) where I simply explain that I'm starting the development.
fr: Avec sa réponse positive je me lance et je commence à écrire une page Linux sur mon site (<a href="http://flashcode.free.fr">http://flashcode.free.fr</a>) où j'explique simplement que je commence le développement.

source: Many people contact me, most of them to encourage me in this work, and some to help me in the development.
fr: De nombreuses personnes me contactent, la plupart pour m'encourager dans ce travail, et certains pour m'aider dans le développement.

source: Among them, Jean-Sébastien VALETTE who does not have the modem yet, but wish to take it because I started the project. So he offers me his help in development.
fr: Parmi eux, Jean-Sébastien VALETTE qui n'a pas encore le modem, mais souhaite le prendre compte-tenu du début mon projet. Il me propose donc son aide dans le développement.

source: So I decide to start the driver with Jean-Sébastien and call Benoît if needed, who works on his driver Alcatel Speedtouch.
fr: Je décide donc de commencer le driver avec Jean-Sébastien et de faire appel à Benoît si besoin, qui travaille parallèlement sur son driver Alcatel Speedtouch.

source: At the end of June 2001, we open the project on Sourceforge.
fr: Fin juin 2001, nous ouvrons le projet sur Sourceforge.

source: Start of development
fr: Début du développement

source: At the beginning of the developments, I decide to read about USB, ADSL technology, and writing drivers under Linux.
fr: Au début des développements, je décide de me documenter sur l'USB, la technologie ADSL, et l'écriture de drivers sous Linux.

source: In parallel, I write to Eci Telecom to know if they are planning to distribute a Linux driver for their hardware.
fr: En parallèle, j'écris à Eci Telecom pour savoir s'ils projettent de distribuer un driver Linux pour leur matériel.

source: They tell me that it is planned, but the answer is not clear and they do not give me any date as to the release of this hypothetical driver.
fr: Ils me répondent que c'est en projet chez eux, mais la réponse est assez vague et surtout ils ne me donnent aucune date quant à la sortie de cet hypothétique driver.

source: So I e-mail them again to ask them for documentation on the modem, which would help me greatly to start writing the driver. And there they tell me to ask to Globespan, the modem chipset manufacturer (note: Globespan has now been acquired by Conexant).
fr: Je leur écris donc à nouveau pour leur demander de la documentation sur le modem, qui m'aiderait grandement pour démarrer l'écriture du driver. Et là ils me disent de me tourner vers Globespan, le constructeur du chipset du modem (note : Globespan a aujourd'hui été racheté par Conexant).

source: But Globespan rarely responds to emails, or sends me to other people and in the end I don't receive any documentation…
fr: Seulement, Globespan répond rarement aux mails, ou bien m'envoie vers d'autres personnes et au final je n'obtiens aucune documentation…

source: Never mind, Jean-Sébastien and I are more than determined to make this driver in order to go back on Linux, and we try to understand the chipset behavior without any documentation.
fr: Qu'à cela ne tienne, Jean-Sébastien et moi-même sommes plus que déterminés à faire ce driver pour pouvoir retourner sous Linux, et nous commençons à étudier le chipset sans aucune documentation.

source: At that moment, Benoît gives me tips and explains to me how he has developed its driver for the Alcatel Speedtouch.
fr: À ce moment, Benoît me donne des tuyaux et m'explique comment il a développé son driver pour l'Alcatel Speedtouch.

source: He captured ("sniffed") all the data exchanged under Windows between the driver and the modem, which gives it files of "logs".
fr: Il a capturé ("sniffé") toutes les données échangées sous Windows entre le driver et le modem, ce qui lui donne des fichiers de "logs".

source: Then we have to analyze these logs to understand a minimum the operation and reproduce these data exchanges under Linux.
fr: Ensuite il faut analyser ces logs pour comprendre un minimum le fonctionnement et reproduire ces envois de données sous Linux.

source: First version of the EciAdsl driver
fr: Première version du driver EciAdsl

source: Modem initialization
fr: Initialisation du modem

source: As simple as it sounds, turning on the modem is not so obvious. We need to understand a minimum how the Globespan chipset works.
fr: Aussi simple que cela puisse paraître, allumer le modem n'est pas si évident. Nous devons comprendre un minimum comment fonctionne le chipset Globespan.

source: With the help of modem users who took it apart, and with Internet searches, we discover that the chipset is a Globespan GS7070.
fr: Avec l'aide d'utilisateurs du modem qui l'ont démonté, et avec des recherches sur Internet, on découvre que le chipset est un Globespan GS7070.

source: We then start two tasks in parallel:
fr: Nous commençons alors deux tâches en parallèle :

source: on the one hand we "sniff" the USB connection under Windows to get log files of exchanged data,
fr: d'une part nous "sniffons" la connexion USB sous Windows pour obtenir des fichiers logs des données échangées,

source: on the other hand we are looking for a way under Linux to send the data to the modem.
fr: d'autre part nous cherchons un moyen sous Linux d'envoyer les données au modem.

source: We used the snooper USB "Snoopy" (written by Roland BOSA and Heiko RABE), modified by Benoît and Jean-Sébastien to work with our modem.
fr: Nous avons utilisé le sniffeur USB "Snoopy" (écrit par Roland BOSA et Heiko RABE), modifié par Benoît et Jean-Sébastien pour fonctionner avec notre modem.

source: We manage to extract the "firmware" from the log files obtained (this is the program sent by the driver to the modem to initialize it).
fr: Nous arrivons à extraire le "firmware" des fichiers logs obtenus (c'est le programme envoyé par le driver au modem pour l'initialiser).

source: We quickly reach the first visible result: end of June 2001, we managed to turn on the two LEDs of the modem: red (power) is fixed and the green (synchronization) flashes, which means that the modem is not synchronized with the ADSL line.
fr: Nous aboutissons rapidement au premier résultat visible : fin juin 2001, nous réussissons à allumer les deux LEDs du modem: la rouge (alimentation) est fixe et la verte (synchronisation) clignote, ce qui signifie que le modem n'est pas synchronisé avec la ligne ADSL.

source: The firmware is sent successfully to the modem!
fr: Le firmware est donc envoyé avec succès au modem !

source: We used a small program that sends data to our Globespan chip ("ezusb" loader).
fr: Nous avons utilisé un petit programme qui permet d'envoyer des données à notre puce Globespan ("ezusb" loader).

source: Two months later, in August 2001, Jean-Sébastien manages to synchronize the modem, the green LED becomes fixed and all hopes are allowed at the connection.
fr: Deux mois après, en août 2001, Jean-Sébastien arrive à synchroniser le modem, la LED verte devient donc fixe et tous les espoirs sont permis quant à la connexion.

source: For this we extracted and made a binary file (which we will later name "synchronization .bin file") which is sent to modem by a program written by Jean-Sebastien.
fr: Nous avons pour cela extrait et constitué un fichier binaire (que nous nommerons par la suite "fichier .bin de synchronisation") qui est envoyé au modem par un programme écrit par Jean-Sébastien.
