Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Data is included in executable (compressed musics and graphics).
fr: Toutes les données sont incluses dans l'exécutable (musiques et graphismes compressés).

source: More than 23000 lines of source code (menu: 28%%, graphics: 23%%, game: 18%%, sound: 14%%, other: 20%%).
fr: Plus de 23000 lignes de code source (menu : 28%%, graphisme : 23%%, jeu : 18%%, son : 14%%, reste : 20%%).

source: Zero high level library used (except svgalib for Linux console graphics).
fr: Aucune bibliothèque de haut niveau utilisée (sauf la svgalib pour l'affichage graphique en mode console Linux).

source: Graphics are made with The Gimp and Deluxe Paint II.
fr: Les graphismes sont réalisés avec The Gimp et Deluxe Paint II.

source: Program (and bugs…) are free!
fr: Le programme (et ses bugs…) sont fournis gratuitement !

source: Special thanks
fr: Remerciements

source: Rapass for his fabulous menu's idea.
fr: Rapass pour son idée géniale du menu.

source: People who help me, give me ideas, signal bugs, etc.
fr: Tous ceux qui m'ont donné des idées, signalé les bugs, etc.

source: Progress report on %(date)s
fr: État d'avancement au %(date)s

source: Graphics mode: VGA (320x200): 100%%, SVGA (unlimited resolution): 5%%
fr: Modes graphiques : VGA (320x200) : 100%%, SVGA (résolution illimitée) : 5%%

source: X-Window version: 35%%
fr: Version X-Window : 35%%

source: Linux console version: 100%%
fr: Version Linux console : 100%%

source: Dos version: 100%%
fr: Version Dos : 100%%

source: Windows 3.x/95/98/2000/XP version: 100%%
fr: Version Windows 3.x/95/98/2000/XP : 100%%

source: Game - display: 90%%
fr: Jeu - affichage : 90%%

source: Game - modes: 70%%
fr: Jeu - modes : 70%%

source: Game - options: 65%%
fr: Jeu - options : 65%%

source: Game - bonus levels: 60%%
fr: Jeu - niveaux bonus : 60%%

source: Game - scores: 32%%
fr: Jeu - scores : 32%%

source: Artificial intelligence: 80%%
fr: Intelligence artificielle : 80%%

source: Network game - Linux: 20%% (TCP/IP only)
fr: Jeu en réseau - Linux : 20%% (TCP/IP seulement)

source: Network game - Windows: 0%% (soon)
fr: Jeu en réseau - Windows : 0%% (bientôt)

source: Musics, sound FX: 100%%
fr: Musiques, bruitages : 100%%

source: Network game for Windows version.
fr: Jeu en réseau pour la version Windows.

source: X-Window version.
fr: Version X-Window.

source: Game modes: challenge, star mode, etc.
fr: Modes de jeu : challenge, mode étoile, etc.

source: High scores.
fr: Table des scores.

source: Other bonus levels: nibble, tron, etc.
fr: Autres niveaux bonus : nibble, tron, etc.

source: Known bugs (sorry!)
fr: Bugs connus (désolé !)

source: Under Windows 2000, game detects Msdos 5.0!
fr: Sous Windows 2000, le jeu détecte le Msdos 5.0 !

source: Hangs up before menu (Windows only).
fr: Plantage aléatoire juste avant l'affichage du menu (version Windows seulement).

source: Display problem when lot of players (stats, number or lines, etc.).
fr: Problème d'affichage avec un grand nombre de joueurs (statistiques, nombre de lignes, etc.).

source: Bad computer intelligence (is that really a bug?).
fr: Mauvaise réflexion de l'ordinateur (est-ce un bug ?).

source: Executable
fr: Exécutable

source: Under Linux: unpack file ("gunzip ftris.gz") and run game: "./ftris"
fr: Sous Linux : décompresser l'archive ("gunzip ftris.gz") puis lancer le jeu par "./ftris"

source: Under Dos/Windows: unpack file and run game "ftris.exe"
fr: Sous Dos/Windows : décompresser l'archive puis exécuter le jeu "ftris.exe"

source: Source code
fr: Code source

source: Unpack both archives (ftris-src-x.yy.tar.gz and ftris-data-x.yy.tar.gz) in the SAME directory.
fr: Décompresser les deux archives (ftris-src-x.yy.tar.gz et ftris-data-x.yy.tar.gz) dans le MÊME répertoire.

source: To compile FlashTris, follow instructions in "Readme" file.
fr: Pour compiler FlashTris, suivre les instructions du fichier "Readme".

source: If you have any problem, send me a mail.
fr: En cas de problème, envoyez-moi un mail.

source: Source code is free, under GPL license.
fr: Le code source est libre, sous licence GPL.

source: What you can do with it:
fr: Ce que vous pouvez faire avec :

source: improve it and give it, according to GPL license
fr: améliorer le source et le diffuser, en respectant la licence GPL

source: fix known bugs
fr: corriger les bugs connus

source: modify FlashTris for other operating systems (Mac, BeOS, etc.)
fr: porter FlashTris vers d'autres systèmes (Mac, BeOS, etc.)

source: send me your comments, questions, suggestions, etc.
fr: m'envoyer vos critiques, remarques, suggestions, etc.

source: send me modifications you made to my sources
fr: m'envoyer les modifications que vous faites dans les sources

source: What you can't do with it:
fr: Ce que vous ne pouvez pas faire avec :

source: sell this game or include it (completely or partially) in a commercial product without giving full source code
fr: vendre ce jeu ou l'inclure (en totalité ou en partie) dans un produit commercial sans en fournir les sources

source: What I am doing now:
fr: Ce que je fais en ce moment :

source: cleaning up source code
fr: nettoyage du code source

source: modifying FlashTris for Mac (Linux/PowerPC), e.g. removing assembly functions
fr: portage vers Mac (Linux/PowerPC), donc suppression des parties en assembleur

source: writing C module player (today it is 90%% assembly code)
fr: portage en C du player de modules (actuellement à 90%% en assembleur)

source: Source details:
fr: Détail des sources :

source: about.c: about screen,
fr: about.c : l'écran "about" du jeu,

source: bonus.c: bonus levels,
fr: bonus.c : les niveaux bonus,

source: config.c: configuration,
fr: config.c : la configuration,

source: effet.c: some graphical effects,
fr: effet.c : quelques effets graphiques,

source: ftris.c: main program,
fr: ftris.c : programme principal,

source: game.c: the game,
fr: game.c : le jeu,

source: key.c: keyboard management,
fr: key.c : gestion du clavier,

source: menu.c: main menu,
fr: menu.c : le menu principal,

source: menu_gfx.c: menu display,
fr: menu_gfx.c : l'affichage pour le menu,

source: menu_tst.c: tests between menu options,
fr: menu_tst.c : les tests entre les différentes options du menu,

source: net.c: network,
fr: net.c : gestion réseau,

source: netftris.c: network (specific to FlashTris),
fr: netftris.c : gestion réseau (spécifique à FlashTris),

source: playfli.c: FLI player,
fr: playfli.c : player de FLI,

source: video.c: graphical display using mode 320x200x256, compatible Linux/Dos/Windows,
fr: video.c : affichage graphique en mode 320x200x256, compatible Linux/Dos/Windows,

source: mod.c: Amiga modules player.
fr: mod.c : player de modules Amiga.

source: Linux binary (gzip):
fr: Binaire Linux (gzip) :

source: Windows binary (zip):
fr: Binaire Windows (gzip) :

source: Data (gzip):
fr: Données (gzip) :

source: Version 0.30 alpha, binary for Linux
fr: Version 0.30 alpha, binaire pour Linux

source: dynamically compiled
fr: compilé dynamiquement

source: X-Window version under development
fr: Version X-Window en cours de développement

source: must be run as "root" user (see FAQ #4)
fr: doit être lancé en utilisateur "root" (voir la FAQ #4)

source: compatible with 2.4.x kernels (see FAQ)
fr: compatible avec les noyaux 2.4.x (voir la FAQ)

source: required libraries: libvga.so.1 (svgalib), libm.so.6, libc.so.6, ld-linux.so.2
fr: librairies requises : libvga.so.1 (svgalib), libm.so.6, libc.so.6, ld-linux.so.2

source: Version 0.30 alpha, binary for Windows
fr: Version 0.30 alpha, binaire pour Windows

source: compatible with Windows 2000 (see FAQ)
fr: compatible avec Windows 2000 (voir la FAQ)

source: network game under development (scheduled for next version)
fr: eu en réseau en développement (prévu pour la prochaine version)

source: binary required:
fr: exécutable requis :

source: Version 0.30 alpha, source code
fr: Version 0.30 alpha, code source

source: distributed under GPL license (see COPYING file)
fr: distribué sous les termes de la licence GPL (voir le fichier COPYING)

source: for Windows: <a href="%(url_djgpp)s">DJGPP</a> compiler required
fr: pour Windows : le compilateur <a href="%(url_djgpp)s">DJGPP</a> est requis

source: Version 0.30 alpha, data files
fr: Version 0.30 alpha, fichiers de données

source: data files for FlashTris (musics, graphics, etc.)
fr: fichiers de données pour FlashTris (musiques, graphisme, etc.)

source: you must unpack this file into FlashTris directory
fr: vous devez décompresser ce fichier dans le répertoire de FlashTris

source: with these files and source code, you can compile and run FlashTris.
fr: avec ces fichiers et le source, vous pouvez compiler et lancer FlashTris.

source: My sound card is properly installed but not detected. What can I do?
fr: Ma carte son est bien installée mais pas détectée. Que puis-je faire ?

source: Under Dos/Windows, run game choosing appropriate port and IRQ.
fr: Sous Dos/Windows, lancer le jeu en choisissant le bon port et IRQ.

source: Example: "ftris -port220 -irq5" if sound card is on port 220h and IRQ 5.
fr: Exemple: "ftris -port220 -irq5" si la carte est sur le port 220h IRQ 5.

source: Under Dos/Windows, only SoundBlaster or 100%% compatible are supported.
fr: Sous Dos/Windows, seules les SoundBlaster ou 100%% compatibles sont reconnues.

source: Under Windows 9x, install SB16 Emulation driver (in case of necessity).
fr: Sous Windows 9x, installer le driver d'émulation SB16 (si besoin).

source: Under Windows 2000, install SoundFX 2000 or VdmSound.
fr: Sous Windows 2000, installer SoundFX 2000 ou VdmSound.

source: Under Linux, all cards are supported.
fr: Sous Linux, toutes les cartes sont reconnues.

source: Game hangs up when "Initializing sound…"
fr: Le jeu plante sur "Initializing sound…"

source: Under Dos/Windows, modify port and/or IRQ (see FAQ #1).
fr: Sous Dos/Windows, essayer de changer le port et/ou l'IRQ (voir FAQ nº 1).

source: Otherwise, run game without sound/music: "ftris -nosound"
fr: Sinon, lancer le jeu sans son ni musique: "ftris -nosound"

source: Game hangs up during intro.
fr: Le jeu plante pendant l'introduction.

source: Disable introduction: "ftris -nointro" (and see FAQ #7).
fr: Désactiver l'introduction : "ftris -nointro" (et voir FAQ nº 7).

source: Game hangs up with error message "svgalib: Cannot get I/O permissions" (Linux only)
fr: Le jeu plante avec l'erreur "svgalib: Cannot get I/O permissions" (Linux seulement)

source: Svgalib requires "root" privileges to access video card.
fr: La svgalib requiert les droits d'utilisateur "root" pour accéder à la carte vidéo.

source: You must be connected as "root" user to run FlashTris or you must activate "setuid" bit on executable (issue "chmod +s ./ftris" command as "root" user).
fr: Il faut soit se connecter en utilisateur "root" pour lancer FlashTris, soit activer le bit "setuid" sur l'exécutable (en tant qu'utilisateur "root", taper la commande "chmod +s ./ftris").

source: Game hangs up with error message "svgalib: mmap error in paged screen memory" (Linux only)
fr: Le jeu plante avec l'erreur "svgalib: mmap error in paged screen memory" (Linux seulement)

source: This is an error of svgalib with kernels 2.3.x and 2.4.x.
fr: Ceci est une erreur de svgalib avec les noyaux 2.3.x et 2.4.x.

source: Download last version of svgalib with sources (here: <a href="https://www.svgalib.org">https://www.svgalib.org</a>) and compile it without option "BACKGROUND = Y" in file Makefile.cfg (comment this line).
fr: Télécharger la dernière version de svgalib avec les sources (sur <a href="https://www.svgalib.org">https://www.svgalib.org</a>) et le compiler en mettant en commentaire la ligne "BACKGROUND = Y" du fichier Makefile.cfg.

source: Menu and/or game are very slow.
fr: Le menu et/ou le jeu est très lent.

source: In "advanced" menu (under burning title): disable menu's flames and/or motion pixels.
fr: Aller dans le menu "advanced" (sous le titre) et désactiver les flammes du menu et/ou les pixels animés.

source: With 80486 processor or less, it is advisable to install a pedal (and to pedal fast!).
fr: Avec un processeur 80486 ou moins, il est recommandé d'installer un pédalier (et de pédaler vite !).

source: There is a bug in game!
fr: Il y a un bug dans le jeu !

source: Send complete description to:
fr: Envoyer la description du bug la plus précise possible à :

source: Author merits to be remunerate.
fr: L'auteur mérite d'être récompensé.

source: All gifts are welcome.
fr: Tous les dons sont acceptés.

source: <strong>FlashTris</strong> is a Tetris-like with many innovating options.
fr: <strong>FlashTris</strong> est un jeu de style Tetris avec de nombreuses options innovantes.

source: The game
fr: Le jeu

source: New version of this famous game!
fr: Une nouvelle version de ce jeu mythique !

source: Plus
fr: Les plus

source: 2 players game
fr: jeu à 2

source: original music!
fr: musique originale !

source: nostalgia…
fr: nostalgie…

source: Dos (native)
fr: Dos (natif)

source: Windows / Linux / BSD / BeOS (with <a href="https://www.dosbox.com">DOSBox</a>)
fr: Windows / Linux / BSD / BeOS (avec <a href="https://www.dosbox.com">DOSBox</a>)

source: Pascal (8100 lines), result of 1 year' work.
fr: Pascal (8100 lignes), fait en 1 an.

source: The title "Bubble Bobble" is not used as a commercial name.
fr: Le titre "Bubble Bobble" a été utilisé à des fins non commerciales.

source: It stays property of Bubble Bobble's authors.
fr: Il reste la propriété des auteurs d'origine.

source: Destroy enemy ship (before he destroys you!)
fr: Éclater le vaisseau spatial de l'adversaire (avant l'autre !)

source: mega fun!
fr: méga fun !

source: lot of cool musics, some by <a href="http://multor.free.fr/">MulToR</a>
fr: beaucoup de musiques sympas, quelques-unes par <a href="http://multor.free.fr">MulToR</a>

source: Pascal (6700 lines), result of 7 months' work.
fr: Pascal (6700 lignes), fait en 7 mois.

source: A "tetris like", one of the best in the world…
fr: Un "Tetris like", l'un des meilleurs au monde…

source: after FlashTris of course!
fr: après FlashTris biensûr !

source: game finished!
fr: jeu fini !

source: network game (local network with IPX)
fr: jouable par réseau local (IPX)

source: 5 players by PC (40 with network)
fr: 5 joueurs par PC (40 en réseau)

source: computer reflexion
fr: jeu contre l'ordinateur

source: powerful configuration
fr: configuration très riche

source: Pascal (9200 lines), result of 3 years' work.
fr: Pascal (9200 lignes), fait en 3 ans.

source: Mega battle, destroy enemy ship.
fr: Méga-baston intergallactique, éclater les vaisseaux spatiaux des adversaires.

source: 8 players game (with network)
fr: jeu à 8 (en réseau)

source: Demoniac Fight continuation
fr: suite de Demoniac Fight

source: Pascal (7000 lines), result of 2 months' work!
fr: Pascal (7000 lignes), fait en 2 mois !

source: Another "Tetris like" with bowls and falling stones…
fr: Un autre "Tetris like" avec des boules et des pierres qui tombent…

source: many players, computer reflexion
fr: jeu à plusieurs contre l'ordinateur

source: Pascal (4100 lines), result of 1 month' work!
fr: Pascal (4100 lignes), fait en 1 mois !

source: Feed a caterpillar (remake of Nibby nibble on Amiga).
fr: Nourrir une chenille (remake de Nibby nibble sur Amiga).

source: 30 levels
fr: 30 niveaux

source: original graphics by CoDeMaNCeR
fr: des graphismes sympas signés CoDeMaNCeR

source: Pascal (15000 lines), result of 10 months' work.
fr: Pascal (15000 lignes), fait en 10 mois.

source: Find the exit of an infernal labyrinth.
fr: Sortir d'un labyrinthe infernal.

source: only fun!
fr: le fun, c'est tout !

source: inspired from Trap on Thomson TO7
fr: inspiré de Trap sur Thomson TO7

source: Pascal (1700 lines), result of 1 month' work!
fr: Pascal (1700 lignes), fait en 1 mois !

source: Jérémie Guillaume has developed another version of Trap (the same as Thomson version):
fr: Jérémie Guillaume a développé une autre version de Trap (identique à la version Thomson) :

source: Find hidden mines.
fr: Trouver où sont cachées les mines dans un champ.

source: Linux version
fr: Version Linux

source: funny
fr: divertissant

source: source included!
fr: source inclus !

source: C (569 lines), result of 2 days' work!
fr: C (569 lignes), fait en 2 jours !

source: Binary (Windows):
fr: Binaire (Windows) :

source: This version is 0.1.2-pre1.
fr: Cette version est la 0.1.2-pre1.

source: Gmemo on Savannah:
fr: Gmemo sur Savannah :

source: <strong>Gmemo</strong> is a useful memo applet.
fr: <strong>Gmemo</strong> est une applet pratique pour les rappels.

source: Developer
fr: Développeur

source: Purpose
fr: Objectif

source: Key dates
fr: Dates clés

source: %(date)s: FlashCode's page
fr: %(date)s : la page de FlashCode

source: Language / environment:
fr: Langage / environnement :

source: Creation of the <a href="http://flashcode.free.fr/index2.php">FlashCode's page</a>, with tools and games I am developing.
fr: Création de la <a href="http://flashcode.free.fr/index2.php">Page de FlashCode</a>, avec les outils et jeux que je développe.

source: Creation of FlashTux.org, in replacement of FlashCode's page.
fr: Création de FlashTux.org, en remplacement de la page de FlashCode.

source: Hosted projects like the EciAdsl driver are growing and become stable.
fr: Les projets hébergés comme le driver EciAdsl grossissent et deviennent stables.

source: Dynamic parts of website (like news, EciAdsl modems, programs, etc.) are now stored in a database.
fr: Les parties dynamiques du site (comme les nouveautés/commentaires, modems EciAdsl, programes, etc.) sont désormais stockées dans une base de données.

source: %(date)s: major update
fr: %(date)s : mise à jour majeure

source: Major update of website:
fr: Mise à jour majeure du site :

source: conform to XHTML / CSS 2 W3C recommandations
fr: conforme aux recommendations XHTML / CSS 2 du W3C

source: comments system for news
fr: système de commentaires pour les nouveautés

source: language selection is saved in a cookie
fr: sélection de la langue sauvegardée dans un cookie

source: %(date)s: full rewrite
fr: %(date)s : réécriture complète

source: FlashTux.org (formerly the "FlashCode's webpage") is turning 20!
fr: FlashTux.org (anciennement "La page de FlashCode") fête ses 20 ans !

source: Full rewrite of the site, source code is now available.
fr: Réécriture complète du site, le code source est désormais disponible.

source: The source code of this website is hosted on GitHub:
fr: Le code source du site est hébergé sur GitHub :

source: All pages are written with text editor, no web page editor or CMS (Content Management System) are used.
fr: Toutes les pages sont écrites avec un éditeur de texte, aucun éditeur de page web ou CMS (Content Management System) n'est utilisé.

source: This website and software available on this website are free, source code is provided and you can redistribute it under GNU GPL licence conditions.
fr: Les logiciels disponibles sur ce site sont libres, le code source est fourni et il est permis de les distribuer sous les conditions de la licence GNU GPL.

source: FlashTux.org is not responsible of any data/hardware damage due to use of software available on this website.
fr: FlashTux.org n'est pas responsable de toute perte de données ou dommage matériel découlant de l'utilisation de logiciels disponibles sur ce site.

source: Pages conformity
fr: Conformité des pages

source: FlashTux.org pages are conform to W3C <a href="https://www.w3.org/TR/html5/" target="_blank" rel="noopener">HTML 5 recommendation</a>.
fr: Les pages de FlashTux.org sont conformes à la <a href="https://www.w3.org/TR/html5/" target="_blank" rel="noopener">recommandation HTML 5</a> du W3C.

source: Therefore, any browser compatible with theses recommendations should display website without any problem.
fr: Par conséquent, tout navigateur compatible avec ces recommandations doit afficher le site sans problème.

source: FlashTux.org team is actively fighting against spam.
fr: L'équipe de FlashTux.org combat activement le spam.

source: Your e-mail address will NEVER be sent to anyone, neither displayed on website.
fr: Votre adresse e-mail ne sera JAMAIS envoyée à quiconque, ni affichée sur le site.

source: Web hoster: Hetzner
fr: Hébergeur : Hetzner

source: <strong>FlashTux.org</strong> is a website hosting free projects for free OS.
fr: <strong>FlashTux.org</strong> est un site qui héberge des projets libres pour des OS libres.

source: See the <a href="%(url_projects)s">projects page</a> for more information about main hosted projects.
fr: Voir la <a href="%(url_projects)s">page des projets</a> pour plus d'information sur les projets hébergés.

source: Started on %(date)s
fr: Démarré le %(date)s

source: Stable version:
fr: Version stable :

source: Under development:
fr: En développement :

source: License:
fr: Licence :

source: Website:
fr: Site web :

source: No images.
fr: Pas d'image.

source: Posted by <strong>%(name)s</strong>
fr: Posté par <strong>%(name)s</strong>

source: Reply
fr: Répondre

source: New comment
fr: Nouveau commentaire

source: %(count_comments)s comment:
fr: %(count_comments)s commentaire :

source: %(count_comments)s comment
fr: %(count_comments)s commentaire

source: Submit
fr: Soumettre

source: Cancel
fr: Annuler

# Previous page
source: Previous
fr: Précédente

# Next page
source: Next
fr: Suivante

source: Back to news
fr: Retour aux nouveautés

source: W3blacklist documentation
fr: Documentation W3BlackList

source: Websites list
fr: Liste des sites

source: Websites list shows all websites in database, with search bar.
fr: La liste des sites permet de lister tous les sites dans la base, avec possibilité de recherche.

source: Only approved websites are displayed.
fr: Seuls les sites approuvés apparaissent dans la liste.

source: By clicking on a website, detail are displayed.
fr: En cliquant sur un site, les détails sont affichés.

source: Website detail
fr: Détail du site

source: All info about website are displayed.
fr: Toutes les informations sur le site sont affichées.

source: It is possible to create an alert in order to receive mail for any changes on website (a new comment does not send alert mail).
fr: Il est possible de créer une alerte sur le site pour être prévenu par mail de toute modification sur le site (un commentaire ajouté ne donne pas lieu à une alerte).

source: Submit a website
fr: Soumission d'un site

source: A form lets you add a website (personal pages are NOT allowed).
fr: Un formulaire permet de soumettre de nouveaux sites (les pages personnelles ne sont PAS acceptées).

source: Thanks for checking that website is not already in database. See FAQ for questions about submitting new websites.
fr: Merci de vérifier dans la base que ce site n'est pas déjà listé. Voir également la FAQ pour les questions relatives à la soumission de nouveaux sites.

source: Standards goal
fr: L'objectif des standards

source: Allow anyone to freely access information, independently of the software or hardware used, even if the person suffers from disabilities (sight impairments, etc.).
fr: Permettre à chacun d'accéder librement à l'information, indépendemment du logiciel ou matériel utilisé, et même si la personne souffre de handicaps (troubles de la vue, etc.).

source: Advantages of standards
fr: Avantages des standards

source: Accessibility: open to people with disabilities (vocal, braille, text browsers), access pages with alternate browsers or hand-held devices, etc.
fr: Accessibilité : ouvert aux gens handicapées (vocal, braille, navigateurs texte), accès aux pages avec des navigateurs alternatifs ou appareils portables, etc.
