Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Madam, Sir, I have tested your website ([[URL]]) with various standard-compliant browsers, including Mozilla/Firefox and [[ANY OTHER W3C COMPLIANT BROWSER AFFECTED]]. And in the current state of things, your website does not work well (or at all) with those browsers. Problem is the following: [[PROBLEM DESCRIPTION]]. [[HOW TO FIX IT (YOU CAN ADD THE BUGZILLA REFERENCE IF AVAILABLE [1])]] You probably know Mozilla [2] is based on the Gecko rendering engine, which is used by numerous browsers, such as Galeon, and that Safari [3], the new browser from Apple, is based on the rendering engine of Konqueror [4]. You probably have also read in the press that Microsoft should no longer release upgrades to Internet Explorer. The ones who don't want, or can't, upgrade their Microsoft Windows system will more and more look for alternatives. By supporting standard-compliant browsers, you allow anyone to access your website. Notably, you allow access to sight-impaired [5]. You'll find links and resources on inter-operability workgroup pages [6], AFUL [7] and OpenWeb website [8]. I would be please to assist you and provide any additional information you may need. Best regards. [[SIGNATURE]] [1] Bugzilla #?????? http://bugzilla.mozilla.org/show_bug.cgi?id=... [2] Mozilla http://www.mozilla.org/ [3] Safari, Mac OS X web browser http://www.apple.com/safari/ [4] Konqueror http://www.konqueror.org/ [5] Web accessibility for handicapped people http://www.ddm.gouv.fr/dossiers_thematiques/documents/cisi2003g2.html [6] Groupe de travail sur l'interopérabilité de l'AFUL http://www.aful.org/gdt/interop/ [7] L'Association Francophone des Utilisateurs de Linux et des Logiciels Libres http://www.aful.org/ [8] Le groupe OpenWeb, première ressource francophone sur les standards web http://openweb.eu.org/
fr: Madame, Monsieur, J'ai testé votre site ([[URL]]) avec différents navigateurs conformes aux standards, dont Mozilla/Firefox et [[AUTRES NAVIGATEURS CONFORMES W3C AFFECTÉS]]. Il se trouve que dans l'état actuel des choses, votre site fonctionne mal (ou pas du tout) avec ces navigateurs. Le problème est le suivant : [[DESCRIPTION DU PROBLÈME]]. [[COMMENT LE CORRIGER (VOUS POUVEZ AJOUTER UNE RÉFÉRENCE BUGZILLA SI DISPONIBLE [1])]] Sans doute savez-vous que Mozilla [2] est basé sur le moteur de rendu Gecko, qui est utilisé par de nombreux navigateurs, comme Galeon, et que Safari [3], le nouveau navigateur d'Apple, est basé sur le moteur de Konqueror [4]. Vous avez aussi sûrement appris que Microsoft ne devrait plus sortir plus de mise à jour d'Internet Explorer. Ceux qui ne veulent pas, ou qui ne peuvent pas, mettre à jour leur système Microsoft Windows se tourneront de plus en plus vers d'autres navigateurs. En offrant le support des navigateurs respectant les standards, vous permettez à tous d'accéder à votre site. En particulier vous permettez l'accès aux handicapés visuels [5]. Vous trouverez toutes les références et ressources nécessaires sur les pages du Groupe de travail sur l'interopérabilité [6], de l'AFUL [7] et sur le site OpenWeb [8]. C'est avec plaisir que je vous donnerai toutes les précisions qui vous seront nécessaires. Veuillez agréer, Madame, Monsieur, l'expression de mes sentiments les meilleurs. [[SIGNATURE]] [1] Bugzilla #?????? http://bugzilla.mozilla.org/show_bug.cgi?id=... [2] Mozilla http://www.mozilla.org/ [3] Safari, le navigateur web de Mac OS X http://www.apple.com/fr/safari/ [4] Konqueror http://www.konqueror.org/ [5] Accessibilité Internet aux personnes handicapées http://www.ddm.gouv.fr/dossiers_thematiques/documents/cisi2003g2.html [6] Groupe de travail sur l'interopérabilité de l'AFUL http://www.aful.org/gdt/interop/ [7] L'Association Francophone des Utilisateurs de Linux et des Logiciels Libres http://www.aful.org/ [8] Le groupe OpenWeb, première ressource francophone sur les standards web http://openweb.eu.org/

source: Madam, Sir, I tried to access your site ([[URL]]) with various standard-compliant browsers, including Mozilla/Firefox and [[ANY OTHER W3C COMPLIANT WEB BROWSER AFFECTED]], but I always get booted and redirected to a page stating my configuration doesn't fit the minimun requirements ([[URL OF THE PAGE YOU'RE REDIRECTED TO]]). Despite what you may think, not everyone has or can use Internet Explorer. It simply does not exist on some platforms and due to major security issues (see http://www.guninski.com/browsers.html and http://die.leox.com/ie_unpatched/index.html), it's not a browser of choice for many people. That automatic redirection was as surprising as your site does not actually need those minimun requirments. Thanks to some hacks and tricks, I've been able to bypass the detection scripts and finally access any part of your site flawlessly. This proves Internet Explorer is not compulsory to browse your website. You should remove your detection scripts and let people access the content of your site. This will help you to widen your audience and I think it's what you're looking for by setting up a website. Best regards. [[SIGNATURE]]
fr: Madame, Monsieur, J'ai voulu accéder à votre site ([[URL]]) avec différents navigateurs conformes aux standards, dont Mozilla/Firefox et [[AUTRES NAVIGATEURS CONFORMES W3C AFFECTÉS]], mais je suis à chaque fois redirigé vers une page déclarant que ma configuration ne remplit pas le minimun requis ([[URL DE LA PAGE OÙ VOUS ÊTES REDIRIGÉ]]). Contrairement à ce que vous pouvez penser, tout le monde n'a pas la possibilité ou l'envie d'utiliser Internet Explorer. Simplement parce qu'il n'existe pas sur certaines plate-formes ou compte-tenu des problèmes importants de sécurité (voir http://www.guninski.com/browsers.html et http://die.leox.com/ie_unpatched/index.html), il n'est pas un navigateur de choix pour bon nombre de personnes. Cette redirection automatique est d'autant plus surprenante que votre site ne nécessite nullement les prérequis déclarés. Grâce à quelques astuces, j'ai pu contourner vos scripts de détection et accéder à l'ensemble de votre site sans le moindre problème. Ceci tend bien à prouver qu'Internet Explorer n'est pas une finalité pour naviguer sur votre site. Vous devriez retirer vos scripts de détection et laisser les gens accéder au contenu de votre site. Cela vous aidera à élargir votre audience et il me semble que c'est ce que vous recherchez en mettant en place un site web. Veuillez agréer, Madame, Monsieur, l'expression de mes sentiments les meilleurs. [[SIGNATURE]]

source: Madam, Sir, I contact you because I can't use your service [[SERVICE NAME]] with my current web browser ([[YOUR BROWSER]]). I noticed you recommend to use Internet Explorer but I don't want to, because [[(CHOOSE BETWEEN)]] I'm running the Linux operating system and Internet Explorer doesn't work on this platform. [[(OR)]] you're maybe aware the numerous security holes of this browser (see http://www.guninski.com/browsers.html and http://die.leox.com/ie_unpatched/index.html ) are not suited for the financial operations I plan to do on your site. I would like to know when you will support customers using modern and W3C standard-compliant browsers, such as Netscape 7, Mozilla, Galeon and many others. If it's not envisaged in a near future, or if you don't respond, please note that I will move to a bank that will best fit the need of its customers. Best regards. [[SIGNATURE]]
fr: Madame, Monsieur, Je vous contacte car je n'arrive pas à utiliser votre service [[NOM DU SERVICE]] avec mon navigateur habituel ([[VOTRE NAVIGATEUR]]). J'ai bien noté que vous recommandiez d'utiliser Internet Explorer mais je ne souhaite pas le faire, car [[(AU CHOIX)]] je suis utilisateur du système Linux et qu'Internet Explorer ne fonctionne pas sur ce système. [[(OU BIEN)]] peut-être savez-vous que les dizaines de trous de sécurité de ce navigateur (voir http://www.guninski.com/browsers.html et http://die.leox.com/ie_unpatched/index.html) ne sont pas compatibles avec les opérations financières que je compte mener sur votre site. Je souhaiterais savoir quand vous comptez permettre à vos clients d'utiliser un navigateur moderne et conforme aux standards édictés par le W3C, comme Netscape 7, Mozilla, Galeon et bien d'autres. Si cela n'est pas dans un avenir proche, ou si vous ne me répondez pas, sachez que je compte changer d'établissement bancaire en faveur d'une banque qui prend mieux en compte les besoins de ses clients. Dans l'attente de votre réponse, veuillez agréer, Madame, Monsieur, l'expression de mes sentiments les meilleurs. [[SIGNATURE]]

source: Internet Explorer required
fr: Internet Explorer obligatoire

source: Error message: "Pour visualiser le site, veuillez télécharger IE Tab en cliquant sur OK !"
fr: Message d'erreur : "Pour visualiser le site, veuillez télécharger IE Tab en cliquant sur OK !"

source: Error message: "Veuillez visualiser ce site web dans sa version optimisée, sous Internet Explorer version 6 ou 7. Ou bien utilisez l'option IE Tab de FIREFOX pour visualiser ce site dans de bonnes conditions. Téléchargez ici IE Tab FIREFOX"
fr: Message d'erreur : "Veuillez visualiser ce site web dans sa version optimisée, sous Internet Explorer version 6 ou 7. Ou bien utilisez l'option IE Tab de FIREFOX pour visualiser ce site dans de bonnes conditions. Téléchargez ici IE Tab FIREFOX"

source: Error message: "Veuillez visualiser ce site web dans sa version optimisée, sous Internet Explorer version 6 ou 7+. Ou bien utilisez l'option IE Tab de FIREFOX pour visualiser ce site dans de bonnes conditions. Téléchargez ici IE Tab FIREFOX"
fr: Message d'erreur : "Veuillez visualiser ce site web dans sa version optimisée, sous Internet Explorer version 6 ou 7+. Ou bien utilisez l'option IE Tab de FIREFOX pour visualiser ce site dans de bonnes conditions. Téléchargez ici IE Tab FIREFOX"

source: Message (in french): "Votre configuration informatique n'a pas été entièrement validée pour l'accès à notre site www.traveldif.com. Nous vous conseillons d'utiliser une version d'Internet Explorer 5.5 ou supérieur. Navigateur: NetScape 5.0x ou Firefox 2.0 Système: Windows XP" *** Updated on 2009-12-15 *** Website has been fixed.
fr: Message: "Votre configuration informatique n'a pas été entièrement validée pour l'accès à notre site www.traveldif.com. Nous vous conseillons d'utiliser une version d'Internet Explorer 5.5 ou supérieur. Navigateur: NetScape 5.0x ou Firefox 2.0 Système: Windows XP" *** Mise à jour le 15/12/2009 *** Le site a été corrigé.

source: Internet Explorer under Windows required
fr: Internet Explorer sous Windows obligatoire

source: No access is possible without Internet Explorer under Windows. *** Updated on 2008-07-29 *** Access is now ok under Linux, Mac OS, and with Mozilla Firefox, but IP is filtered: and only french IPs are authorized to access website. What about french people outside France, or people physically in France, but with network public IP in other country?
fr: Aucun accès possible sans Internet Explorer sous Windows. *** Mise à jour le 29/07/2008 *** L'accès est maintenant ok sous Linux, Mac OS, et avec Mozilla Firefox, mais l'adresse IP est filtrée: seulement les IPs françaises sont autorisées à accéder au site. Quid des français à l'étranger, ou des gens physiquement en France, mais avec une IP publique de réseau dans un autre pays ?

source: Downloads for Windows only
fr: Téléchargements pour Windows seulement

source: Videos with DRM are available only with Windows.
fr: Les vidéos avec DRM ne sont accessibles que sous Windows.

source: Upon visiting the website in a non-IE browser you are redirected to a page telling you that the site requires the newest version of Internet Explorer to use it and provides a link to download the latest version.
fr: En visitant le site avec un navigateur différent d'IE, on est redirigé vers une page indiquant que le site requiert la dernière version d'Internet Explorer et fournissant un lien pour télécharger la dernière version.

source: Internet Explorer or Netscape required
fr: Internet Explorer ou Netscape obligatoire

source: Internet Explorer or Netscape is required, there is following message with Firefox: "We're sorry, but the BMW TIS website was designed for Internet Explorer 5.0+ and Netscape 6.0+ Web-Browsers running on the Microsoft Windows operating system. Currently, you are using Netscape 0 which must be upgraded to view this site. You may upgrade your browser version by clicking on the respective link below."
fr: Internet Explorer ou Netscape est obligatoire, le message suivant est affiché avec Firefox : "We're sorry, but the BMW TIS website was designed for Internet Explorer 5.0+ and Netscape 6.0+ Web-Browsers running on the Microsoft Windows operating system. Currently, you are using Netscape 0 which must be upgraded to view this site. You may upgrade your browser version by clicking on the respective link below."

source: Problem with menus
fr: Problème avec les menus

source: Menus are not displayed, only some pages are accessible.
fr: Les menus ne sont pas affichés, seules quelques pages sont accessibles.

source: Message: "Our website requires the browser Internet Explorer version 6 or higher. It appears that you are using Firefox, Safari, or another browser that Wal-Mart Video Downloads doesnt currently support." Note: ok with Firefox under Windows, but not under Unix/Linux because of DRM use. *** Updated on 2009-04-25 *** Movie download service has been closed (http://www.reuters.com/article/ousiv/idUSN2726104120071228)
fr: Message: "Our website requires the browser Internet Explorer version 6 or higher. It appears that you are using Firefox, Safari, or another browser that Wal-Mart Video Downloads doesnt currently support." Note: ok avec Firefox sous Windows, mais pas sous Unix/Linux à cause de l'utilisation de DRM. *** Mise à jour le 25/04/2009 *** Le service de téléchargement de films a été fermé (http://www.reuters.com/article/ousiv/idUSN2726104120071228)

source: Menu problem (Firefox) and access (Konqueror + Opera)
fr: Problème avec les menus (Firefox) et d'accès (Konqueror + Opera)

source: With Firefox 2.0, after clicking on "Commerces", menus are above page content. Moreover, it's impossible to access to submenus: when mouse is over menu item, nothing is displayed. With Konqueror and Opera, it's impossible to access website, redirection URL is wrong. *** Updated on 2007-08-02 *** Website fixed.
fr: Avec Firefox 2.0, après avoir cliqué sur "Commerces", les menus sont décalés sur la page (trop haut par rapport au contenu de la page). De plus il est impossible d'accéder aux sous-menus: en passant la souris sur le menu, rien ne s'affiche. Avec Konqueror et Opera, il est tout simplement impossible d'accéder au site, l'URL de redirection est erronnée. *** Mise à jour le 02/08/2007 *** Site corrigé.

source: Website is ok with Internet Explorer only, error is displayed for other browsers: "Navigateur non supporté. Veuillez utiliser Microsoft Internet Explorer Les composants utilisés sur ce site requièrent l'utilisation du navigateur Microsoft Internet Explorer Internet Explorer Assurez-vous également d'avoir installé Windows Media Player 9 ou une version supérieure." *** Updated on 2007-08-31 *** Website has been fixed.
fr: Le site n'est visible qu'avec internet Explorer, une erreur est affichée pour tous les autres navigateurs : "Navigateur non supporté. Veuillez utiliser Microsoft Internet Explorer Les composants utilisés sur ce site requièrent l'utilisation du navigateur Microsoft Internet Explorer Internet Explorer Assurez-vous également d'avoir installé Windows Media Player 9 ou une version supérieure." *** Mise à jour le 31/08/2007 *** Le site a été corrigé.

source: Flash plugin required
fr: Plugin Flash requis

source: Page http://www.produweb.be/Fr/Accueil.php contains a navigation menu in Flash. Website is not accessible without this required plugin.
fr: La page http://www.produweb.be/Fr/Accueil.php contient un menu en Flash. Le site n'est pas accessible sans ce plugin requis.

source: Only upper frame is displayed
fr: Seule la frame du haut est affichée

source: Only upper frame is displayed (with menus). Whole content is invisible with Firefox. With Opera, content is not visible at first display, but is ok after clicking on a menu. *** Updated on 2008-08-13 *** Website fixed.
fr: Seule la frame en haut du site est affichée (avec les menus). Le contenu est complètement invisible sous Firefox. Sous Opera, le contenu n'est pas visible au premier affichage, mais l'est après avoir cliqué sur un menu. *** Mise à jour le 13/08/2008 *** Site corrigé.

source: IE required for E-application
fr: IE obligatoire pour l'E-application

source: It's impossible to ask for a licence of residence without IE. In left column, there's a E-application line. On second page, it's impossible to click on "continue to the electronic application form". *** Updated on 2009-09-16 *** Site fixed.
fr: Il est impossible de faire une demande de permis de résidence sans posséder IE. Dans la colonne de gauche se trouve une ligne E-application. Sur la 2ème page, il est impossible de cliquer sur le bouton "continue to the electronic application form". *** Mise à jour le 16/09/2009 *** Site corrigé.

source: Download section of website is not allowed to GNU/Linux (and probably most of free OS). Indeed, website is "Powered by VirginMega.fr", which is already in w3blacklist…
fr: La partie téléchargement du site est interdite sous GNU/Linux (et probablement la plupart des autres OS libres). En effet, le site est "Powered by VirginMega.fr", par ailleurs déjà blacklisté sur w3blacklist…

source: Flash plugin is mandatory to access website, so it's not visible on OS where Flash plugin is not available.
fr: Le plugin Flash est obligatoire pour visiter le site, il n'est donc pas visible sur les OS où le plugin Flash n'est pas disponible.

source: Unreachable website without IE6 and Windows
fr: Site inaccessible sans IE6 et Windows

source: Old website written in PHP was ok, but a new MSWIN2003 server has been installed, and no way to display website now… Even MS Internet Explorer users under MS Windows have to run a program as administrator, according to welcome page.
fr: L'ancien site en PHP était accessible mais un nouveau serveur MSWIN2003 a été installé et plus moyen d'accéder au site… Pire, même les utilisateurs de MS Internet Explorer sous MS Windows doivent effectuer une operation en administrateur décrite en page d'acceuil.

source: Internet Explorer forbidden
fr: Internet Explorer interdit

source: Website is not accessible with Internet Explorer (special page). Answer received on 2006-07-03: website will remain unreachable to Internet Explorer. *** Updated on 2006-07-09 *** Website does not work with other browsers like Blazer (on Palm OS 5).
fr: Le site est inaccessible avec Internet Explorer (page spéciale). Réponse reçue le 03/07/2006: le site restera inaccessible à Internet Explorer. *** Mise à jour le 09/07/2006 *** Le site ne fonctionne pas non plus sous d'autres navigateurs comme Blazer (sur Palm OS 5).

source: Welcome page is Flash animation. There's no link to HTML version of website. It's a fly company website, and it's impossible to read schedules, get information, or buy ticket if we don't have Flash plugin. Temporary solution: enter this URL: http://www.aircaraibes.com/index.cfm
fr: La page d'accueil est une animation Flash. Il n'y a aucun lien vers une version HTML du site. Il s'agit du site web d'une compagnie aérienne, il est donc impossible de consulter des horaires, d'obtenir des informations, ou d'acheter un billet d'avion si l'on ne dispose pas du plugin Flash. Solution de contournement: entrer cet URL : http://www.aircaraibes.com/index.cfm

source: Layout problems with Firefox
fr: Problèmes de mise en page sous Firefox

source: Layout is not good with Firefox: some boxes are empty, forum is displayed over bottom part of page. No contact e-mail on website… *** Updated on 2006-07-06 *** Website was changed, now all is ok with Firefox.
fr: La mise en page n'est pas bonne sous Firefox : certaines boîtes sont vides, et le forum déborde sur le bas du site. Aucun e-mail de contact sur le site… *** Mise à jour le 06/07/2006 *** Le site a été complètement modifié, désormais ok avec Firefox.

source: Unreadable menu with Firefox
fr: Menu illisible avec Firefox

source: Left menu is not readable and unusable wih Firefox.
fr: Le menu de gauche est illisible et inutilisable sous Firefox.

source: Website is not reachable without Flash plugin, so it's not visible on OS where Flash plugin is not available. No contact e-mail on website.
fr: Le site est complètement inaccessible sans plugin Flash, donc non visible sur les systèmes où le plugin Flash n'est pas disponible. Aucun e-mail de contact sur le site.

source: JavaScript issue
fr: Problème JavaScript

source: Some pages display scrollbar, but it does not work with Mozilla, and is partially broken with Konqueror. JavaScript errors. *** Updated on 2006-01-26 *** Site fixed.
fr: Certaines pages offrent un ascenseur, mais il ne fonctionne pas avec Mozilla, et est partiellement cassé avec Konqueror. Erreurs JavaScript. *** Mise à jour le 26/01/2006 *** Site corrigé.

source: Menu not displayed with Firefox
fr: Menu non affiché avec Firefox

source: Pages content not visible
fr: Contenu des pages non visible

source: Pages content is not visible with Mozilla/Firefox, Konqueror and Opera.
fr: Le contenu des pages n'est pas visible avec Mozilla/Firefox, Konqueror et Opera.

source: Page source code is displayed
fr: Code source de la page affiché

source: Page is received as text instead of HTML. *** Updated on 2008-04-07 *** Website fixed.
fr: La page est reçue sous forme de texte au lieu du HTML. *** Mise à jour le 07/04/2008 *** Site corrigé.

source: Display issues
fr: Problèmes d'affichage

source: The size of background images does not vary according to the font size, so the text may overflow or images may be shifted. The overview of menus changes the appearence, but is not restored when the mouse leaves the area.
fr: La taille des images de fond ne varie pas suivant la taille de la police, donc le texte peut déborder ou des images se trouvent décalées. Le survol des menus fait bien changer l'apparence du bouton, mais ne se rétablit pas lorsque la souris quitte la zone.

source: Immediate redirection to a page asking to use Internet Explorer: "Pour accéder à la Bibliothèque Technique vous devez utiliser Microsoft Internet Explorer version 4.0 ou supérieure sur plate-forme Windows-Intel. Vous pouvez télécharger une version à www.microsoft.com/france/internet/produits/ie/"
fr: Redirection immédiate vers une page demandant d'utiliser Internet Explorer : "Pour accéder à la Bibliothèque Technique vous devez utiliser Microsoft Internet Explorer version 4.0 ou supérieure sur plate-forme Windows-Intel. Vous pouvez télécharger une version à www.microsoft.com/france/internet/produits/ie/"

source: Music download is not possible
fr: Téléchargement de musique impossible

source: The FNAC website is compatible with Gecko-based browsers, but when trying to download a music file, before the payment, a page is displayed, saying that the platform (UNIX) is incompatible with their service. *** Updated on 2009-10-13 *** Website fixed.
fr: Le site de la FNAC est compatible avec les navigateurs à base de gecko, mais lorsqu'il s'agit de télécharger un morceau musical, juste avant de payer une page apparaît, signalant que la plate-forme (UNIX) est incompatible avec leur service. *** Mise à jour le 13/10/2009 *** Site corrigé.

source: Internet Explorer and Netscape/Mozilla only
fr: Internet Explorer et Netscape/Mozilla seulement
