Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Algorithms
fr: Algorithmes

source: Directories
fr: Répertoires

source: Useful
fr: Pratique

source: Intel x86 assembly
fr: Assembleur Intel x86

source: "Le compte est bon".
fr: Calcul du "Compte est bon".

source: Calculs best solution for "Le compte est bon". Two running modes: - by parameters: 6 plates and result (7 parameters), - without parameter: plates and result at random.
fr: Calcule la meilleure solution pour "Le compte est bon". Deux modes de fonctionnement : - en fournissant en paramètres les 6 plaques et le résultat, - sans paramètre : les plaques et le résultat sont tirés au hasard.

source: C source with compiled version for Linux, Dos / Windows
fr: Source C avec version compilée pour Linux, Dos / Windows

source: Writes numbers out in full.
fr: Affichage de nombres en toutes lettres.

source: Writes numbers out in full. Parameter is number between 0 and 999 999 999 999 999 (15 digits) Return code: 0 if OK, 1 if invalid number, 2 if number too big.
fr: Affiche un nombre en toutes lettres. Le paramètre à fournir est le nombre entier compris entre 0 et 999 999 999 999 999 (15 chiffres). Code retour: 0 si OK, 1 si le nombre est invalide, 2 si le nombre est trop grand.

source: Looks for perfect numbers.
fr: Recherche des nombres parfaits.

source: Looks for perfect numbers (numbers which divisors (except number itself) other than themself) sum give themself). Example: 6 divisors are: 1, 2, 3. And 1 + 2 + 3 = 6. Perfect numbers I've found are: 6, 28, 496, 8128 and 33 550 336. You can give as parameter a number from which research starts. Special thanks to Pierre Barbier de Reuille for improving my algorithm, program runs fery fast!
fr: Recherche des nombres parfaits (nombres dont la somme des diviseurs (autre que le nombre lui-même) est égale à eux-mêmes). Exemple : les diviseurs de 6 sont : 1, 2, 3. Et 1 + 2 + 3 = 6. Les nombres parfaits que j'ai trouvés sont : 6, 28, 496, 8128 et 33 550 336. Vous pouvez donner comme paramètre le nombre de départ pour la recherche. Un grand merci à Pierre Barbier de Reuille qui a amélioré l'algorithme de recherche et ainsi augmenté considérablement la vitesse de recherche !

source: Searches solution for "Solitary".
fr: Recherche la solution du "Solitaire".

source: Search solution for "Solitary". WARNING: This program has never found any solution. He has run during one day under Linux, without finding solution… The source is available for download, hoping someone can optimize it, for example to not test all combinations. Or if you know how to leave one marble, I'm interested! (send me by e-mail). Nota: This is the following version of "Solitary" (36 marbles): <pre> o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o </pre>
fr: Recherche la solution du Solitaire. ATTENTION : Ce programme n'a jamais produit les résultats attendus. Il a tourné une journée sous Linux, sans résultat… Le source est téléchargeable dans le but que quelqu'un l'améliore, pour ne plus tester des combinaisons en double par exemple. Ou si vous connaissez une solution pour laisser une seule bille, je suis vivement intéressé ! (envoyez-la moi par e-mail). N.B. : Il s'agit de cette version du solitaire (36 billes) : <pre> o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o o </pre>

source: PCX 320*200*256c viewer.
fr: Visualiseur de PCX 320*200*256c.

source: Just for fun: tiny PCX viewer (320*200*256c), with assembly source code. Thanks to Pierre Barbier de Reuille, Julien Viard and Gabriel Dubois, who manage to reduce .com size from 77 to 68 bytes!
fr: Juste pour le fun : un tout petit visualiseur de fichier .PCX (320*200*256c), avec son source assembleur. Merci à Pierre Barbier de Reuille, Julien Viard et Gabriel Dubois, qui ont réussi à réduire la taille du .com de 77 à 68 octets !

source: Assembly source with compiled version for Dos / Windows
fr: Source assembleur avec version compilée pour Dos / Windows

source: Fastly search directories.
fr: Recherche rapide de répertoires.

source: Search directories on one or more disks. Using tree made by VA (va.arb), search is instantaneous (no scan of disk).
fr: Recherche des répertoires sur un ou plusieurs disques. En utilisant le fichier produit par VA (va.arb), la recherche est instantanée (aucun balayage de disque).

source: Pascal source with compiled version for Dos / Windows
fr: Source Pascal avec version compilée pour Dos / Windows

source: Colored list of files
fr: Liste des fichiers en couleur

source: Display a colored list of files with many possible formats. Features: - display on 1, 2, 3, 4 or 6 columns, - sort by name, extension, size or date/time, - automatic display of size in Ko or Mo for big files, - options saved in .COM
fr: Affiche la liste des fichiers en couleur sous différents formats possibles. Fonctionnalités : - affichage sur 1, 2, 3, 4 ou 6 colonnes, - tri par nom, extension, taille ou date/heure, - affichage automatique des tailles en Ko ou Mo pour les gros fichiers, - sauvegarde des options dans le .COM

source: Improved "del" command.
fr: Destruction améliorée de fichiers.

source: Delete files with many options: in subdirectories, unrecoverable destruction, delete empty files, etc.
fr: Détruit des fichiers avec plusieurs options : dans les sous-répertoires, destruction irrécupérable, effacement des fichiers vides, etc.

source: Pascal source with compiled version for Linux, Dos / Windows
fr: Source Pascal avec version compilée pour Linux, Dos / Windows

source: Unrecoverable directory delete.
fr: Destruction irrécupérable de répertoires.

source: Destroy directories so that they can't be recoverable with undelete or another similar tool.
fr: Détruit des répertoires de sorte qu'ils ne soient pas récupérables avec Undelete ou un autre outil du genre.

source: List files recursively.
fr: Liste récursive des fichiers.

source: Display file list of current directory and subdirectories.
fr: Affiche la liste des fichiers du répertoire et de ses sous-répertoires.

source: Speed up navigation between directories.
fr: Déplacement rapide dans les répertoires.

source: Save directories tree (includes CDROM) and speed up navigation between directories.
fr: Mémorise l'arborescence des disques (y compris CDROM) et accélère grandement la navigation.

source: Search for today's and tomorrow's feast.
fr: Recherche la fête du jour et du lendemain.

source: PHP script which lets you print today's and tomorrow's feast on your webpage.
fr: Script PHP qui permet d'afficher sur une page web la fête du jour et du lendemain.

source: PHP source of program
fr: Source PHP du programme

source: Module (.MOD) player.
fr: Lecteur de modules (.MOD).

source: Module player with interface. Needs a SoundBlaster 16 (or compatible) card.
fr: Lecteur de modules avec interface complète. Nécessite une carte son compatible SoundBlaster 16.

source: Compiled version for Linux, Dos / Windows
fr: Version compilée pour Linux, Dos / Windows

source: Font editor with graphical interface.
fr: Éditeur de fontes avec interface graphique.

source: Font editor (ASCII table) with graphical interface. Can load/save fonts in an independent .COM which installs font under Dos.
fr: Éditeur de fontes (caractères de la table ASCII) avec interface graphique. Possibilité de charger/sauver la fonte dans un .COM indépendant qui installe la fonte sous Dos.

source: C source with compiled version for Dos / Windows
fr: Source C avec version compilée pour Dos / Windows

source: Data management like spreadsheet.
fr: Gestion de données style tableur.

source: Data management like spreadsheet including following features: - unlimited data size (only limit: physical + virtual memory), - easy functions on text files, - powerful and complexs macros, - "3D columns", - very swift (32 bits C++), - loads binary files with hexadecimal edition, - includes calendar (fetes), - completely configurable: menus, coulors, variables, macros, etc.
fr: Gestion de données style tableur avec les caractéristiques suivantes : - taille des données illimitées (seule limite : la mémoire physique + virtuelle), - fonctions faciles et rapides sur les fichiers textes, - macros puissantes et complexes, - gestion de "colonnes 3D", - lancement et exécution rapide (C++ 32 bits), - chargement de fichiers binaires et édition en hexadécimal, - calendrier des fêtes intégré, - entièrement configurable : menus, couleurs, variables, macros, etc.

source: Digital animated clock.
fr: Horloge digitale animée.

source: Displays a digital clock (under Linux) bouncing on screen sides. You can use it for example as a screensaver. Warning: runs under console mode only.
fr: Affiche sous Linux une horloge digitale rebondissant sur les bords de l'écran. Utile comme économiseur d'écran, par exemple. Attention: ne peut être appelé que depuis le mode console.

source: C source with compiled version for Linux
fr: Source C avec version compilée pour Linux

source: Convert .PCX to .COM.
fr: Conversion .PCX en .COM.

source: Convert a .PCX file (format 320*200, 256 colors) into a .COM file. The target .COM file is smaller than the .PCX!
fr: Convertit un fichier .PCX (au format 320*200, 256 couleurs) en un fichier .COM exécutable. Le fichier .COM obtenu est plus petit que le .PCX de départ !

source: Displays ASCII table.
fr: Affichage de la table ASCII.

source: Resident program which displays ASCII table by pressing Ctrl+Alt+T. Program removes itself from memory when runned a second time. Very useful for programers.
fr: Programme résident qui affiche la table ASCII par simple pression sur Ctrl+Alt+T. Le programme se retire de la mémoire lors du deuxième lancement. Très utile pour les programmeurs.

source: Manage fastly bank account.
fr: Gestion rapide de compte bancaire.

source: Fast management of bank account: - fast operation creation, - operation checking, - multiple undo, - search with multiple criterions, - double money: french francs / euros, - part balance, bank and real, - etc. N.B.: A new version, X-Window compatible, with CB and cheque symbols, etc. is under development.
fr: Permet la gestion rapide d'un compte bancaire : - saisie rapide des opérations, - pointage des opérations, - annulations multiples, - recherche multi-critères, - double monnaie francs / euros, - soldes partiels, banque et réel, - etc. N.B. : Une nouvelle version, compatible X-Window, avec des symboles CB, chèque, etc. est en cours de développement.

source: Mini-calculator.
fr: Mini-calculatrice.

source: Mini-calculator: very fast, very useful!
fr: Mini-calculatrice : très rapide, très pratique !

source: Display practical informations.
fr: Affiche des infos pratiques.

source: Useful: don't miss any friend anniversary, etc. Drawback: you have no more excuse to forget it!
fr: Pratique: ne ratez plus les fêtes de vos amis, les anniversaires, etc. Inconvénient: vous n'avez plus d'excuse pour les oublier !

source: Plays a Wave file.
fr: Joue un fichier Wave.

source: Plays a Wave file under Linux and displays file properties. Needs a sound card.
fr: Joue sous Linux un fichier Wave et affiche les caractéristiques du fichier. Nécessite une carte son.

source: Fast volume setup.
fr: Réglage rapide du volume.

source: Fastly adjust sound card volume under Linux. Needs a sound card.
fr: Permet le réglage rapide du volume de la carte son sous Linux. Nécessite une carte son.

source: Build interactive menus.
fr: Construction de menus interactifs.

source: Display an interactive menu and returns rank of chosen option. Useful in a batch which needs a user choice between many options.
fr: Affiche un menu interactif et renvoie le numéro de l'option choisie. Très utile dans un fichier Batch nécessitant un choix de l'utilisateur entre plusieurs options.

source: This field is required.
fr: Ce champ est obligatoire.

source: directory
fr: répertoire

source: File not found
fr: Fichier non trouvé

source: Text
fr: Texte

source: Conexant chipset, not supported by EciAdsl driver. Linux driver here: <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>
fr: Chipset Conexant, non supporté par EciAdsl. Driver Linux ici : <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>

source: This modem has Analog Eagle chipset, you can use Sagem Fast 800 driver.
fr: Ce modem a un chipset Analog Eagle. Vous pouvez utiliser le driver du Sagem Fast 800.

source: Warning, another modem with same name exists but is not supported (Alcatel chipset).
fr: Attention, un autre modem avec le même nom existe mais n'est pas supporté (chipset Alcatel).

source: This modem has an Alcatel chipset. Linux driver here: <a href="https://sourceforge.net/projects/zyxel630-11">https://sourceforge.net/projects/zyxel630-11</a>
fr: Ce modem a un chipset Alcatel. Driver Linux ici : <a href="https://sourceforge.net/projects/zyxel630-11">https://sourceforge.net/projects/zyxel630-11</a>

source: This modem as an Alcatel Dynamite chipset. Linux driver here: <a href="https://sourceforge.net/projects/zyxel630-11">https://sourceforge.net/projects/zyxel630-11</a>
fr: Ce modem a un chipset Alcatel Dynamite. Driver Linux ici : <a href="https://sourceforge.net/projects/zyxel630-11">https://sourceforge.net/projects/zyxel630-11</a>

source: This modem has a Conexant chipset. Linux driver here: <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>
fr: Ce modem a un chipset Conexant. Driver Linux ici : <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>

source: For Avangard provider, use mode LLC_SNAP_RFC1483_BRIDGED_ETH_NO_FCS.
fr: Pour le fournisseur Avangard, utilisez le mode LLC_SNAP_RFC1483_BRIDGED_ETH_NO_FCS.

source: This modem has Analog Devices chipset, supported by eagle-usb driver.
fr: Ce modem a un chipset Analog Devices, supporté par le driver eagle-usb.

source: Linux driver here: <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>
fr: Driver Linux ici : <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>

source: Unable to send firmware to modem.
fr: Firmware impossible à envoyer au modem.

source: This modem has a Conexant chipset.
fr: Ce modem a un chipset Conexant.

source: Synchronization fails. Maybe different chipset, not supported today.
fr: La synchronisation est impossible. Peut-être un chipset différent, non supporté aujourd'hui.

source: This modem as an Alcatel Dynamite chipset.
fr: Ce modem a un chipset ALcatel Dynamite.

source: Driver under development: <a href="https://sourceforge.net/projects/sagem-fast-1000">https://sourceforge.net/projects/sagem-fast-1000</a>
fr: Driver en développement : <a href="https://sourceforge.net/projects/sagem-fast-1000">https://sourceforge.net/projects/sagem-fast-1000</a>

source: Chipset GS7070-174, should be supported.
fr: Chipset GS7070-174, devrait être supporté.

source: Analog Devices chipset.
fr: Chipset Analog Devices.

source: Unable to send firmware to modem. Linux driver here: <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>
fr: Firmware impossible à envoyer au modem. Driver linux ici : <a href="https://sourceforge.net/projects/accessrunner">https://sourceforge.net/projects/accessrunner</a>

source: Linux driver for this modem: <a href="https://support.usr.com/support/9000/9000-linux-ug/Installing%20the%20modem.html">https://support.usr.com/support/9000/9000-linux-ug/Installing%20the%20modem.html</a>
fr: Driver Linux pour ce modem : <a href="https://support.usr.com/support/9000/9000-linux-ug/Installing%20the%20modem.html">https://support.usr.com/support/9000/9000-linux-ug/Installing%20the%20modem.html</a>

source: Not supported
fr: Non supporté

source: Maybe supported
fr: Peut-être supporté

source: Supported
fr: Supporté

# plural
source: Not supported
fr: Non supportés

# plural
source: Maybe supported
fr: Peut-être supportés

# plural
source: Supported
fr: Supportés

source: EciAdsl installation guide
fr: Guide d'installation EciAdsl

source: development version
fr: version de développement

source: French
fr: Français

source: English
fr: Anglais

source: Italian
fr: Italien

source: Spanish
fr: Espagnol

source: German
fr: Allemand

source: Turkish
fr: Turc

source: EciAdsl installation with Mandrake 10 and kernel 2.6.x
fr: Installation EciAdsl avec Mandrake 10 et le noyau 2.6.x

source: Instructions for 2.6.x kernels patch
fr: Instructions pour le patch / noyaux 2.6.x

source: EciAdsl installation on *BSD
fr: Installation d'EciAdsl sur *BSD

source: EciAdsl config with "Free dégroupé" (France only)
fr: Config EciAdsl avec "Free dégroupé" (France seulement)

source: EciAdsl with Avangard provider (Russia)
fr: EciAdsl avec le fournisseur Avangard (Russie)

source: EciAdsl and APIC problem
fr: EciAdsl et le problème de l'APIC

source: EciAdsl with DSL-200 B1 modem and TPG (australian ISP)
fr: EciAdsl avec un modem DSL-200 B1 et TPG (FAI australien)

source: EciAdsl with hotplug
fr: EciAdsl avec le hotplug

source: EciAdsl FAQ
fr: FAQ EciAdsl

source: Portuguese
fr: Portugais

source: FlashTux.org is a website hosting free software for free OS (Linux, BSD, etc.).
fr: FlashTux.org est un site qui héberge des logiciels libres pour des OS libres (Linux, BSD, etc.).

source: IRC, mail.
fr: IRC, e-mail.

source: WeeChat (Wee Enhanced Environment for Chat) is a fast and light IRC client for many operating systems. Everything can be done with a keyboard. It is customizable and extensible with scripts. It is compliant with RFCs 1459, 2810, 2811, 2812, and 2813.
fr: WeeChat (Wee Enhanced Environment for Chat) est un client IRC rapide et léger pour différents systèmes d'exploitations. Tout peut être fait avec le clavier. Il est paramétrable et extensible avec des scripts. Il est conforme aux normes RFC 1459, 2810, 2811, 2812, et 2813.

source: IRC, mail (+ mailing list).
fr: IRC, e-mail (+ liste de diffusion).

source: EciAdsl is a Linux driver for ADSL USB modems with Globespan chipset. Latest version supports 65 different modems all over the world (6 communication protocols) and comes with a graphical configuration tool. Packages are available for many Linux distributions and *BSD.
fr: EciAdsl est un driver Linux pour les modems ADSL USB avec une puce Globespan. La dernière version supporte 65 modems différents à travers le monde (6 protocoles de communication) et dispose d'un outil de configuration graphique. Les paquets sont proposés pour un grand nombre de distributions Linux et *BSD.

source: WeeWM (Wee Enhanced Environment Window Manager) is a fast and light window manager for XFree86. Everything can be done with a keyboard. It is customizable, includes a dock, smart window placement, virtual desktops, and much more.
fr: WeeWM (Wee Enhanced Environment Window Manager) est un gestionnaire de fenêtres rapide et léger pour XFree86. Tout peut être fait avec le clavier. Il est paramétrable, inclut un dock, un placement intelligent des fenêtres, des bureaux virtuels, et bien plus.

source: W3Blacklist is a website for making the W3C standards respected. It denounces any website (commercial, governemt or organization) which discriminate visitors according to their operating system or web browser. There is regular mailings to webmasters, in the hope the website will me modified to be compliant with standards. Letters templates are available for your mails.
fr: W3Blacklist est un site qui a pour but de faire respecter les standards du W3C. Il dénonce tout site (commercial, gouvernemental ou organisation) qui discrimine les visiteurs en interdisant l'accès selon le navigateur ou l'OS utilisé. Il y a des envois réguliers de mails aux webmasters concernés, pour que le site soit modifié et conforme aux standards. Des modèles de lettres sont fournis pour vos propres mails.

source: Gmemo is an applet which reminds you of birthdays, feasts (with first name, Mother's day, etc.), or any other event. It is customizable (name, type, date & time, repeat mode, multi-alarm mode, etc.).
fr: Gmemo est une petite application qui rappelle les anniversaires, fêtes (avec le prénom, fête des mères, etc.), ou tout autre évènement. Il est paramétrable (nom, type, date et heure, mode répétition, mode multi-alarmes, etc.).

source: FlashTris is a Tetris-like game. It features multiple players over the Internet or a local network, team games, bonus levels, play versus computers, a pieces editor, and many other options.
fr: FlashTris est un jeu inspiré de "Tetris". Plusieurs joueurs peuvent s'affronter ou jouer ensemble sur internet ou en réseau local, jeu en équipes, niveaux bonus, jeu contre l'ordinateur, éditeur de pièces, et beaucoup d'autres options.

source: Mail.
fr: E-mail.

source: Many new features and bugs fixed, see WeeChat official site.
fr: Beaucoup de nouveautés et de bugs corrigés, voir le site officiel de WeeChat.

source: Bug fix and maintenance release, see WeeChat official site.
fr: Version de maintenance avec des correctifs, voir le site officiel de WeeChat.

source: Complete rewrite of FlashTux.org
fr: Réécriture complète de FlashTux.org

source: FlashTux.org (formerly the "FlashCode's webpage") is turning 20! The site has been completely rewritten from scratch, in Python, with the Django framework and PostgreSQL database. It is now fully responsive, using Bootstrap toolkit. Source code is available on GitHub: <a href="https://github.com/flashtux/flashtux.org">https://github.com/flashtux/flashtux.org</a>.
fr: FlashTux.org (anciennement "La page de FlashCode") fête ses 20 ans ! Le site a été complètement réécrit depuis zéro, en Python, avec le framework Django et la base de données PostgreSQL. Il est désormais complètement « responsive », en utilisant le framework Bootstrap. Le code source est disponible sur GitHub : <a href="https://github.com/flashtux/flashtux.org">https://github.com/flashtux/flashtux.org</a>.

source: Sites flashtux.org and weechat.org are now accessible via IPv6.
fr: Les sites flashtux.org et weechat.org sont désormais accessibles en IPv6.

source: Version 0.3.0 is released, after 2 years of work and more than 1000 commits! This is a major upgrade since last stable, please read files UPGRADE_0.3 and ChangeLog for list of changes. For this important release, site has moved to weechat.org, with a new look! Enjoy WeeChat!
fr: La version 0.3.0 est disponible, après deux ans de travail et plus de 1000 commits ! C'est une évolution importante depuis la dernière stable, merci de lire les fichiers UPGRADE_0.3 et ChangeLog pour la liste des changements. Pour cette version importante, le site a déménagé vers weechat.org, avec un nouveau look ! Bon WeeChat !

source: Third release candidate (version 0.3.0-rc3) for future version 0.3.0 is available. &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: La troisième "release candidate" (version 0.3.0-rc3) pour la future version 0.3.0 est disponible. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>

source: Second release candidate (version 0.3.0-rc2) for future version 0.3.0 is available. &bull; <a href="/weechat/download/">WeeChat download page</a>
fr: La seconde "release candidate" (version 0.3.0-rc2) pour la future version 0.3.0 est disponible. &bull; <a href="/weechat/download/">Page téléchargement WeeChat</a>
