Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: *** Updated on 2003-11-25 *** Fast change from the webmaster, problem is partially fixed. But the browser detection is still there and based on the browser name. A solution based on browser features (GetElementById, document.all, document.layers) has been sent to the webmaster, waiting for an answer. *** Updated on 2004-12-01 *** Site is OK with Mozilla and Opera, still not working with Konqueror (3.3.1): "Stop" sign showing the supported browsers. *** Updated on 2005-12-11 *** Website fixed.
fr: *** Mise à jour le 25/11/2003 *** Réaction rapide du webmaster qui corrige en partie le problème. Seulement, la détection navigateur est toujours présente et se base sur le nom du navigateur. Une solution basée sur la détection par les capacités technologiques des navigateurs (GetElementById, document.all, document.layers) a été soumise au webmaster. En attente de réponse favorable. *** Mise à jour le 01/12/2004 *** Le site est OK avec Mozilla et Opera, toujours KO avec konqueror (3.3.1) : panneau "Stop" indiquant les navigateurs supportés. *** Mise à jour le 11/12/2005 *** Site corrigé.

source: Dynamic menu does not work
fr: Le menu dynamique ne fonctionne pas

source: With Mozilla, dynamic menus "Plans", "Les lignes", "Bien voyager", "Sorties" and "Entreprises" don't show their submenus and their links are not working (menus "Accueil", "Horaires", "Itinéraires" and "Contacts" are working fine). Cause: use of non-standard JavaScript. Conclusion: part of the website is not accessible.
fr: Avec Mozilla, les menus déroulants "Plans", "Les lignes", "Bien voyager", "Sorties" et "Entreprises" n'affichent pas leurs sous-menus et leurs liens ne fonctionnent pas (les menus "Accueil", "Horaires", "Itinéraires" et "Contacts" fonctionnent correctement). Cause : utilisation de JavaScript non-conforme. Conclusion : une partie du site est donc inaccessible.

source: Flash plugin required, text overlap in Flash content
fr: Plug-in Flash obligatoire, textes superposés dans le contenu Flash

source: *** Updated on 2005-01-17 *** Even with the Flash plugin installed, most texts overlap (tested with Mozilla/Firefox 1.0 on Linux). *** Updated on 2006-09-21 *** Website fixed.
fr: *** Mise à jour le 17/01/2005 *** Même avec le plugin Flash installé, la plupart des textes sont superposés (testé avec Mozilla/Firefox 1.0 sous Linux). *** Mise à jour le 21/09/2006 *** Site corrigé.

source: HTML pages are empty.
fr: Les pages HTML sont vides.

source: Top menus are not accessible
fr: Menus en haut inaccessibles

source: Dynamic top menus are not accessible with Mozilla. No workaround. Reason: the JavaScript code is not conform: based on the proprietary extension "document.all" which is specific to Internet Explorer. The menu is OK with Opera and Konqueror. *** Updated on 2004-12-01 *** Website fixed.
fr: Les menus dynamiques en haut de page ne sont pas accessibles avec mozilla. Aucune solution de contournement. Raison : le code JavaScript sur lequel repose le menu dynamique est non-conforme : basé sur l'extension propriétaire "document.all", spécifique à Internet Explorer. Le menu fonctionne cependant avec Opera et Konqueror. *** Mise à jour le 01/12/2004 *** Site corrigé.

source: Infinite reload loop
fr: Boucle infinie avec le rechargement

source: The site enters an infinite reload loop when accessed with Gecko-based browsers. Plus, the dynamic menu is rendered unusable by the infinite reload loop. *** Updated on 2004-12-06 *** Website fixed.
fr: Le site présente une boucle infinie lorsqu'on y accède avec un navigateur basé sur Gecko. Le menu dynamique est donc inaccessible à cause de la boucle infinie. *** Mise à jour le 06/12/2004 *** Site corrigé.

source: No e-mail address to contact the webmaster. *** Updated on 2004-12-06 *** Site corrigé.
fr: Aucune adresse e-mail n'est disponible pour contacter le webmaster. *** Mise à jour le 06/12/2004 *** Site corrigé.

source: Problème avec les sous-menus
fr: Problem with submenus

source: The array submenus are not displayed.
fr: Les sous-menus du tableau ne sont pas affichés.

source: Message displayed: "To view the site, please, use Internet Explorer 6.x or Netscape 6.x or higher!" *** Updated on 2003-10-28 *** The detection script now allows Mozilla to access the site. *** Updated on 2009-05-02 *** Website fixed.
fr: Message affiché : "To view the site, please, use Internet Explorer 6.x or Netscape 6.x or higher!" *** Mise à jour le 28/10/2003 *** Le script de détection autorise désormais Mozilla. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Page layout broken with Mozilla
fr: Mise en page catastrophique sous Mozilla

source: Links overlap
fr: Les liens se chevauchent

source: On some pages, secondary links on red banner overlap and are therefore not readable. Mozilla, Konqueror and Opera are affected by the problem. Only Internet Explorer works.
fr: Sur certaines pages, les liens secondaires placés sur le bandeau rouge se chevauchent et sont donc illisibles. Mozilla, Konqueror et Opera sont affectés par ce problème. Seul Internet Explorer fonctionne.

source: Selection impossible with Mozilla
fr: Sélection impossible avec Mozilla

source: http://www.fnaim.fr/recherche/default.aspx Selection is impossible with Mozilla. *** Updated on 2005-02-05 *** Website fixed.
fr: http://www.fnaim.fr/recherche/default.aspx La sélection est impossible avec Mozilla. *** Mise à jour le 05/02/2005 *** Site corrigé.

source: Impossible to buy the online magazine
fr: Impossible d'acheter la revue en ligne

source: Submenus are not accessible
fr: Les sous-menus sont inaccessibles

source: When clicking on a topic, a box is displayed with clickable links. When moving the mouse, the menu disappears. Problem affects browsers based on Gecko (Mozilla, Netscape6+, Camino, etc.).
fr: Quand on clique sur une rubrique, il s'affiche un cadre avec des liens cliquables. Cependant, au moindre mouvement de souris, le menu disparaît. Ce problème affecte les navigateurs basés sur Gecko (Mozilla, Netscape6+, Camino, etc.).

source: Part of website not accessible
fr: Une partie du site n'est pas accessible

source: Part of website is visible only with Internet Explorer or Netscape 4.x. Problem is caused by non-conform dynamic submenus, without any workaround. Not reachable links are: "Mon Airfrance", "Infos pratiques", "Infos Produits", "Voyageurs fréquents" et "Offres Partenaires" dans le menu de gauche. The website admins were contacted 4 times since September 2002. Only one answer was received, saying that the website is only compatible with Internet Explorer 4+ and Netscape 4. *** Updated on 2004-12-12 *** Website OK, even if page layout is not perfect with Konqueror.
fr: Certaines parties du site ne sont visibles qu'avec Internet Explorer ou Netscape 4.x. Le problème est dû à l'utilisation de sous-menus dynamiques non conformes, sans qu'aucune solution de contournement ne soit fournie. Les liens inaccessibles sont : "Mon Airfrance", "Infos pratiques", "Infos Produits", "Voyageurs fréquents" et "Offres Partenaires" dans le menu de gauche. Les administrateurs du site ont été contactés à 4 reprises depuis septembre 2002. Seule une réponse a été reçue, disant que le site n'est compatible qu'avec Internet Explorer 4+ et Netscape 4. *** Mise à jour le 12/12/2004 *** Le site est OK, même si la mise en page laisse à désirer sous Konqueror.

source: Search requires Internet Explorer
fr: Recherche limitée à Internet Explorer

source: When searching, if you use a browser different from Internet Explorer, you'll see HTML page source… Reason: page is sent as text/plain instead of text/html. 3 mails sent since 2002, october, no answer today, and problems persists. A full solution was sent: add this line in <IfModule mod_mime.c> part or Apache setup file: AddType text/html .WMVeritySearch This take 30 seconds. 11 months later, nothing was done… You are encouraged to contact webmaster. *** Updated on 2005-03-12 *** Website fixed.
fr: Lors d'une recherche, si vous utilisez un navigateur autre que Internet Explorer, vous avez le droit uniquement au source HTML de la page… Raison : la page est envoyée en tant que text/plain au lieu de text/html. Contacté à 3 reprises depuis octobre 2002, aucune réponse à ce jour, ni aucune amélioration du problème. Une solution clé-en-main leur à pourtant été donnée : ajouter la ligne suivante dans la partie <IfModule mod_mime.c> du fichier de configuration Apache : AddType text/html .WMVeritySearch Ça prend 30sec montre en main. 11 mois plus tard, rien n'a été fait… Pression sur le webmaster souhaitée. *** Mise à jour le 12/03/2005 *** Site corrigé.

source: Form can not be validated
fr: Le formulaire ne peut pas être validé

source: *** Updated on 2004-12-12 *** Website does not exist any more.
fr: *** Mise à jour le 12/12/2004 *** Le site n'existe plus.

source: No images
fr: Aucune image

source: Website has been made with Word. URLs to images use the Windows convention, with backslashs for directories. Contacted many times, they didn't reply nor fixed the website.
fr: Le site a été fait avec Word. Les URLs pour les images utilisent la convention Windows, avec des backslashs pour séparer les répertoires. Contacté à ce sujet à plusieurs reprises, ils n'ont jamais répondu ou corrigé le problème.

source: Navigation issues
fr: Problèmes de navigation

source: *** Updated on 2004-11-29 *** All is now OK, with Firefox, Konqueror and Opera.
fr: *** Mise à jour le 29/11/2004 *** Tout est désormais OK, avec Firefox, Konqueror et Opera.

source: Some pages are not accessible
fr: Certaines pages sont inaccessibles

source: Impossible to reach the pages from the main menu: the JavaScript code used by the menu works only with Netscape or Internet Explorer. *** Updated on 2003-09-11 *** Problem has been fixed, but not on all pages: - Dynamic menu is now working with Mozilla, Opera and Konqueror. No more error, but all pages have not been updated, and therefore the menu is not working on a large part of the website. - The English version, available from URL http://www.tourrettessurloup.com/indexus.htm has not been updated: redirection to the error page (http://www.tourrettessurloup.com/pagerefus.htm) with Opera et Konqueror. No redirection with Mozilla, but the menu is not working.
fr: Impossible d'accéder aux différentes pages du site depuis le menu principal : le code JavaScript utilisé par le menu ne fonctionne qu'avec Netscape ou Internet Explorer. *** Mise à jour le 11/09/2003 *** Le problème a été corrigé, mais pas encore sur toutes les pages : - Le menu dynamique fonctionne maintenant avec Mozilla, Opera et Konqueror. Il n'y a plus de messages de refus non plus, mais toutes les pages n'ont pas été mises à jour, donc le menu ne fonctionne pas sur une bonne partie du site. - La version anglaise, disponible depuis l'adresse http://www.tourrettessurloup.com/indexus.htm n'a pas été modifiée : redirection vers la page d'erreur (http://www.tourrettessurloup.com/pagerefus.htm) avec Opera et Konqueror. Pas de redirection pour Mozilla, mais le menu ne fonctionne pas.

source: BuyMusic.com is only accessible to Internet Explorer running on top of Microsoft Windows (you get redirected to http://www.buymusic.com/ierequired.htm otherwise) *** Updated on 2004-12-22 *** Website fixed.
fr: BuyMusic.com est accessible seulement avec Internet Explorer sous Windows. *** Mise à jour le 22/12/2004 *** Site corrigé.

source: Search does not work with Mozilla
fr: La recherche ne fonctionne pas avec Mozilla

source: Netscape browser is forbidden
fr: Le navigateur Netscape est interdit

source: Deliberately blocks browsers with the word "Netscape" as user agent name. *** Updated on 2005-04-06 *** Website fixed.
fr: Blocage délibéré de tout navigateur ayant le mot "Netscape" dans le "user agent". *** Mise à jour le 06/04/2005 *** Site corrigé.

source: Many browsers are blocked
fr: De nombreux navigateurs sont bloqués

source: The site blocks Mozilla-based, KHTML-based and Opera browsers through a JavaScript detection.
fr: Le site bloque les navigateurs basés sur Gecko, sur KHTML et Opera avec une détection JavaScript.

source: Menu not displayed with Konqueror
fr: Menu non affiché avec Konqueror

source: The menu is not displayed at all with Konqueror. With Opera, menu is displayed as raw on top of page. If the user agent is set to Internet Explorer, the menu is working fine.
fr: Le menu ne s'affiche pas du tout sous Konqueror. Avec Opera, le contenu du menu s'affiche de manière brute en haut de la page. Avec un "user agent" défini à Internet Explorer, le menu fonctionne correctement.

source: All browsers except Internet Explorer 5.0+ are banned. *** Updated on 2009-05-02 *** Website fixed.
fr: Tous les navigateurs sauf Internet Explorer 5.0+ sont bannis. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: When using Mozilla or Netscape Communicator on Windows, the site doesn't allow access and reports "This web site is designed for Microsoft Internet Explorer versions 4 and above on Microsoft Windows." *** Updated on 2009-05-02 *** Website no longer exists.
fr: Avec Mozilla ou Netscape Communicator sous Windows, l'accès au site n'est pas possible et affiche : "This web site is designed for Microsoft Internet Explorer versions 4 and above on Microsoft Windows." *** Mise à jour le 02/05/2009 *** Le site n'existe plus.

source: Gecko based browsers are banned
fr: Les navigateurs basés sur Gecko sont bannis

source: The site pretends to support Internet Explorer 5+ and Netscape 6+ but refuses entrance to Gecko browsers and any other browser: redirection to to http://oca.microsoft.com/en/browserinfo.asp
fr: Le site prétend supporter Internet Explorer 5+ et Netscape 6+ mais refuse l'entrée à tout navigateur basé sur Gecko : redirection vers http://oca.microsoft.com/en/browserinfo.asp

source: Mention "This site is Internet Explorer only", which is the case.
fr: Mention "This site is Internet Explorer only", ce qui est effectivement le cas.

source: Unusable menu
fr: Menu inutilisable

source: No pages are accessible because the menu doesn't work correctly. *** Updated on 2005-02-05 *** Website fixed.
fr: Aucune page accessible car le menu ne fonctionne pas. *** Mise à jour le 05/02/2005 *** Site corrigé.

source: Redirection to http://chapter3.net/wrongbrowser.html "This website is not available for Netscape users. Please download Internet Explorer if you would like to view this site. If you have been redirected to this page in error and want to enter anyway - Click here." *** Updated on 2009-05-02 *** Website fixed.
fr: Redirection vers http://chapter3.net/wrongbrowser.html "This website is not available for Netscape users. Please download Internet Explorer if you would like to view this site. If you have been redirected to this page in error and want to enter anyway - Click here." *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Some pages are empty
fr: Certaines pages sont vides

source: The page with main menu displays correctly but half of pages in this menu are not displayed because of a JavaScript bug.
fr: La page du menu principal s'affiche sans problème mais ensuite la moitié des pages présentées dans ce menu ne s'affichent pas à cause d'un bug JavaScript.

source: All browsers except Internet Explorer and Netscape 4 are refused
fr: Tous les navigateurs sauf Internet Explorer et Netscape 4 sont refusés

source: *** Updated on 2005-03-08 *** Website is closed since 2005-03-04.
fr: *** Mise à jour le 08/03/2005 *** Le site est fermé depuis le 04/03/2005.

source: Page layout broken with Mozilla and Konqueror
fr: Mise en page cassée avec Mozilla et Konqueror

source: Page layout is broken with Mozilla 1.x and Konqueror. Buttons in navigation bar are not working with Mozilla 1.2.1 (and Phoenix 0.5). With Konqueror, the search seems not possible.
fr: Affichage détérioré avec Mozilla 1.x et Konqueror. Les boutons de la barre de navigation ne répondent pas avec Mozilla 1.2.1 (et Phoenix 0.5). Avec Konqueror, la recherche semble impossible.

source: Topics not accessible
fr: Rubriques inaccessibles

source: Drop-down menus are not working with Mozilla.
fr: Les menus déroulants ne fonctionnent pas avec Mozilla.

source: Videos not accessible on alternate systems
fr: Vidéos non accessibles sur les systèmes alternatifs

source: Browser and OS detection with JavaScript, delivering a specific code for each configuration. Accepted: Windows and Mac with 3 browsers: Internet Explorer, Netscape 4 and Netscape 6.
fr: Détection du navigateur et du système d'exploitation par JavaScript, délivrant un code specifique pour chaque configuration. Acceptés : Windows et Mac avec 3 navigateurs : Internet Explorer, Netscape 4 et Netscape 6.

source: Search does not work with Mozilla and Konqueror
fr: La recherche ne fonctionne pas avec Mozilla et Konqueror

source: Redirection to a red page telling you, that you can not visit the site if you do not have the Flash plugin installed. There is no pages available without Flash or even a posibility to skip Flash. You can bypass the faulty detection script by accessing this page directly: http://www.bcb.gov.bo/kindex.html *** Updated on 2009-05-02 *** Website fixed.
fr: Redirection vers une page rouge disant que vous ne pouvez pas visiter le site si vous n'avez pas le plug-in Flash installé. Il n'y a aucune page visible sans Flash et pas la possibilité de sauter Flash. Vous pouvez passer le script de détection en accédant directement à cette page : http://www.bcb.gov.bo/kindex.html *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Message: "Le site Oodrive est optimisé à partir de Internet Explorer 5.0 et n'est plus accessible sous Netscape". *** Updated on 2003-10-27 *** After a new contact, the Oodrive.fr site is accessible only on Windows.
fr: Message : "Le site Oodrive est optimisé à partir de Internet Explorer 5.0 et n'est plus accessible sous Netscape". *** Mise à jour le 27/10/2003 *** Après avoir été contacté une nouvelle fois, le site Oodrive.fr n'est accessible que depuis Windows.

source: JavaScript not accessible
fr: JavaScript inaccessible

source: With Mozilla, not possible to reach most of pages from links in the side menu.
fr: Avec Mozilla, impossibilite d'atteindre la plupart des pages depuis les liens fournis dans le menu latéral.

source: "Unfortunately you can not further access this address because this site uses newer technologies than your current browser supports. This site can be accessed with Microsoft Internet Explorer 4 or higher. We do not support the older Netscape browsers any more. For viewing presentations in this site, availability of a Macromedia flash and Adobe Acrobat Reader plug-in is recommended." *** Updated on 2009-05-02 *** Website fixed.
fr: "Unfortunately you can not further access this address because this site uses newer technologies than your current browser supports. This site can be accessed with Microsoft Internet Explorer 4 or higher. We do not support the older Netscape browsers any more. For viewing presentations in this site, availability of a Macromedia flash and Adobe Acrobat Reader plug-in is recommended." *** Mise à jour le 02/05/2009 *** Site corrigé.

source: *** Updated on 2009-05-02 *** Website fixed.
fr: *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Site accessible only on Windows with Internet Explorer version 5 or higher.
fr: Le site n'est accessible que sous Windows avec Internet Explorer version 5 ou supérieure.

source: The dynamic menu is partially broken with Gecko-based browsers. The "sub-links" are not clickabled. *** Updated on 2009-05-02 *** Website fixed.
fr: Le menu dynamique est partiellement cassé avec les navigateurs basés sur Gecko. Les sous-liens ne sont pas cliquables. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Page layout broken with Mozilla, Konqueror and Opera
fr: Mise en page cassée avec Mozilla, Konqueror et Opera

source: Website works well in Internet Explorer 5.5 for Windows and Netscape Communicator 4.79, but the layout is completely messed up in other, standard-compliant browsers such as Mozilla, Konqueror and Opera. *** Updated on 2009-05-02 *** Website fixed.
fr: Le site fonctionne correctement avec Internet Explorer 5.5 pour Windows et Netscape Communicator 4.79, mais la mise en page est complètement cassée dans les autres navigateurs respectueux des standards comme Mozilla, Konqueror et Opera. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: A popup window asks to change the browser and use "Internet Explorer". But the site is OK anyway.
fr: Une fenêtre popup demande explicitement de changer de navigateur pour "Internet Explorer". Mais le site est OK de toutes façons.

source: Error 302
fr: Erreur 302

source: Some browsers can't access the site at all, getting errors 302 Object moved.
fr: Quelques navigateurs ne peuvent pas accéder du tout au site : erreur 302 "Object moved".

source: It is not possible to access the website after the registration page with a browser based on Gecko.
fr: On ne peut accéder au contenu du site au delà de la page d'inscription avec un navigateur basé sur Gecko.

source: Flight search not possible
fr: Recherche de vols impossible

source: The "search" link does not work with browsers based on Gecko, Konqueror and Opera. Same for the advanced search, flight schedules, interactive maps and airport guides. Moreover, date selection does not work with Opera. *** Updated on 2003-12-05 *** "Après un échange de mails avec les services techniques d'opodo, les remarques ont été prises en compte et corrigées. Seules les applets calendar sont inopérantes, le site devenant tout à fait exploitable avec Mozilla." -- Plucho Problem with interactive maps and airport guides is not fixed.
fr: Le lien "Rechercher" ne fonctionne pas avec les navigateurs basés sur Gecko, Konqueror et Opera. Idem pour la recherche avancée, l'horaire des vols, les cartes interactives et le guide des aéroports. De plus, la sélection des dates ne fonctionne pas avec Opera. *** Mise à jour le 05/12/2003 *** "Après un échange de mails avec les services techniques d'opodo, les remarques ont été prises en compte et corrigées. Seules les applets calendar sont inopérantes, le site devenant tout à fait exploitable avec Mozilla." -- Plucho Le problème avec les cartes interactives et le guide des aéroports n'est pas corrigé.

source: Problem with links
fr: Problème avec les liens

source: Links on top menu are not working with Opera, Gecko-based browsers and Netscape 4.
fr: Les liens du menu du haut ne fonctionnent pas avec Opera, les navigateurs basés sur Gecko et Netscape 4.

source: Source code displayed
fr: Code source affiché

source: Server sends the source code of HTML page.
fr: Le serveur envoie le code source de la page HTML.

source: The dynamic menu does not work with browsers based on Gecko and Konqueror. No problems with Opera.
fr: Le menu dynamique ne fonctionne pas avec les navigateurs basés sur Gecko et Konqueror. Pas de problèmes avec Opera.

source: *** Updated on 2003-11-20 *** The DHTML has been replaced by Flash. No more problems with browsers, but Flash is required.
fr: *** Mise à jour le 20/11/2003 *** Le DHTML a été remplacé par du Flash. Il n'y a donc plus d'incompatibilités entre les navigateurs, mais Flash est obligatoire.

source: Workaround URL: http://www.feb.be/vbosite/home.asp
fr: URL de contournement : http://www.feb.be/vbosite/home.asp

source: Gecko based browsers and Netscape are banned
fr: Les navigateurs basés sur Gecko et Netscape sont bannis

source: Message: "Ce site ne fonctionne pas avec NetScape". *** Updated on 2004-12-12 *** Le site n'existe plus.
fr: Message : "Ce site ne fonctionne pas avec NetScape". *** Mise à jour le 12/12/2004 *** Le site n'existe plus.

source: Broken display
fr: Affichage bancal
