Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: CVS has been created on Savannah page. &bull; <a href="/weewm/download/">Download page</a>
fr: Le CVS a été créé sur la page Savannah. &bull; <a href="/weewm/download/">Page téléchargement</a>

source: New EciAdsl documentation
fr: Nouvelle documentation EciAdsl

source: New EciAdsl documentation has been written ("EciAdsl installation guide"), available in many formats (PDF, html, text, and Texinfo source). Warning: this doc doesn't replace files provided with driver package (Readme, Install and Troubleshooting). Doc is available in French, English and Italian. Portuguese and Spanish versions will be available soon. All suggestions about this doc are welcome. Hoping this doc will be useful ;) &bull; <a href="/eciadsl/doc/">EciAdsl installation guide</a>
fr: Une nouvelle documentation EciAdsl a été écrite ("Guide d'installation EciAdsl"), disponible en différents formats (PDF, html, texte, et au format source Texinfo). Attention : cette documentation ne remplace pas les fichiers fournis avec le driver (Readme, Install et Troubleshooting). Elle est disponible en Français, Anglais et Italien. Les versions en Portugais et Espagnol sont en cours de traduction. Toutes suggestions d'amélioration de la doc sont les bienvenues. En espérant que cette documentation soit utile ;) &bull; <a href="/eciadsl/doc/">Guide d'installation EciAdsl</a>

source: Doc about USB sniffer (Snoopy)
fr: Documentation sur le sniffeur USB (Snoopy)

source: Benoit Papillault has written a doc about Snoopy sniffer. Don't forget: in order to creat your own synch .bin file, you've to read the doc about .bin creation. &bull; <a href="/eciadsl/download/&amp;view=sync">Detail about synchronization</a> &bull; <a href="/eciadsl/doc/">Doc about synch .bin creation</a> &bull; <a href="http://benoit.papillault.free.fr/usbsnoop/doc.en.php">Snoopy documentation</a>
fr: Benoit Papillault a écrit une documentation sur l'utilisation du sniffeur Snoopy. Rappel : pour créer son .bin de synchronisation il faut également consulter la doc de création des .bin. &bull; <a href="/eciadsl/download/">Page de détails de la synchronisation</a> &bull; <a href="/eciadsl/doc/">Doc sur la création de .bin de synchro</a> &bull; <a href="http://benoit.papillault.free.fr/usbsnoop/doc.fr.php">Documentation sur Snoopy</a>

source: New synch .bin has been added (synch32.bin), created in Italy (Pisa). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch32.bin), créé en Italie (Pisa). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin has been added (synch31.bin), created in Italy (Turin). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch31.bin), créé en Italie (Turin). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Gmemo version 0.1.1 is available. New in this version: - CVS created on Savannah page, - "gmemo-support" mailing list created, - Debian package available. &bull; <a href="/gmemo/download/">Gmemo download page</a>
fr: La version 0.1.1 de Gmemo est disponible. Au menu : - création du CVS sur la page Savannah, - création d'une mailing list "gmemo-support", - package Debian disponible. &bull; <a href="/gmemo/download/">Page téléchargement Gmemo</a>

source: New synch .bin has been added (synch30.bin), created in Canada (Montreal). &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch30.bin), créé au Canada (Montreal). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin has been added (synch29.bin), created in Switzerland. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch29.bin), créé en Suisse. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin has been added (synch28.bin), created in UK. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch28.bin), créé en Angleterre. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: External contributions
fr: Contributions externes

source: A graphical launcher for startmodem (EcX) has been added to external contributions (thanks to Michel Le Foulgoc). Development team does not provide any support for these tools (contact authors for any problem). &bull; <a href="/eciadsl/download/">EciAdsl download page, stable version</a>
fr: Un lanceur graphique pour startmodem (EcX) a été rajouté aux contributions externes (merci à Michel Le Foulgoc). L'équipe de développement n'assure aucun support pour ces outils (contacter directement les auteurs pour tout problème). &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl, version stable</a>

source: New synch .bin has been added (synch27.bin), created in Italy. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch27.bin), créé en Italie. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin has been added (synch26.bin), created in Italy. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Un nouveau .bin de synchro a été rajouté (synch26.bin), créé en Italie. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: FAQ in Spanish
fr: FAQ en espagnol

source: FAQ has been translated to spanish (special thanks to Eduardo Gonzalez). &bull; <a href="/eciadsl/faq/">Spanish FAQ</a>
fr: La FAQ a été traduite en espagnol (un grand merdi à Eduardo Gonzalez). &bull; <a href="/eciadsl/faq/">FAQ en espagnol</a>

source: April 1st ;)
fr: 1er Avril ;)

source: I've received a lot of mails about last news. Please look at today's date and you'll understand the news, it is an april joke! :-) How many people has already uninstalled the driver?
fr: Au vu du nombre importants de réponses reçues au sujet de la nouvelle sur l'arrêt du projet, je vous serai reconnaissant de regarder la date du jour et d'interpréter l'info en conséquence, il s'agit bien évidemment d'un poisson d'avril ! :-) Allez avouez, combien ont déjà désinstallé le driver ?

source: EciAdsl project is stopped :-(
fr: Arrêt du projet EciAdsl :-(

source: Due to the lawsuit from XXXXXXXX company (hidden name) about .bin files (copyrighted), we must stop the EciAdsl project. All driver versions will be deleted from this page as soon as possible. We suggest you to remove the driver from your disk, to remain in rule. Temporary solution is to use Windows™. We want to thank all people who help us during these months. EciAdsl development team.
fr: Suite au procès intenté par XXXXXXXX (nom masqué) au sujet des droits sur les fichiers .bin, nous sommes dans l'obligation de mettre fin au projet EciAdsl. Toutes les versions du driver vont être retirées du site dans les heures qui viennent. Nous invitons chaque utilisateur à désinstaller le driver pour rester en règle. La solution provisoire est donc de repasser à Windows™. Nous tenons à remercier les nombreuses personnes qui nous ont aidé durant ces nombreux mois. L'équipe de développement EciAdsl.

source: Beginners tutorial
fr: Tutoriel pour débutants

source: A tutorial has been added for beginners with Linux. This is only for installation of RPM version. For other packages, please see the documentation. &bull; <a href="/eciadsl/tutorial/">EciAdsl tutorial</a>
fr: Un tutoriel a été ajouté pour les débutants sous Linux. Il ne concerne que l'installation de la version RPM du driver. Pour toutes les autres versions, consulter la documentation. &bull; <a href="/eciadsl/tutorial/">Tutoriel EciAdsl</a>

source: Version 0.7 is released! New in this version: - bugfixes, - doc &amp; FAQ updated, - packages for many distributions (Slackware and Gentoo coming soon, but Debian package is there :-) Feel free to contact us for any installation problem (or any other problem related to the driver). Have a nice surf ;) &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version 0.7 est disponible ! Au programme de cette version : - quelques corrections de bugs, - documentation et FAQ mises à jour, - packages pour la plupart des distributions (la Slackware et la Gentoo ne vont pas tarder, mais le package Debian est bel et bien là :-) Nous restons comme d'habitude à votre disposition pour tout problème d'installation ou d'utilisation du driver. Bon surf ;) &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Newsletter WeeWM.org
fr: Lettre de nouveautés WeeWM.org

source: WeeWM newsletter has been created, to be informed in real time about WeeWM news. To subscribe, enter your e-mail to the right of home page. E-mails are not disclosed and not visible.
fr: Une lettre de nouveautés a été mise en place, pour être informé en temps réel des nouveautés sur WeeWM. Il suffit pour s'inscrire d'indiquer un e-mail sur la droite de la page d'accueil. Les e-mails ne sont en aucun cas divulgués à des tiers et n'apparaissent nulle part.

source: News: dock is now ok, default config files automatically created if they do not exist. &bull; <a href="/weewm/download/">Download page</a>
fr: Nouveautés : le dock pleinement fonctionnel et la création automatique des fichiers de configuration s'ils n'existent pas. &bull; <a href="/weewm/download/">Page téléchargement</a>

source: Doc updated and translated in Italiano
fr: Doc mise à jour et traduite en Italien

source: Documentation is updated and now available in Italiano in the usermode CVS package. Special thanks to Roberto Inzerillo for his work. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La documentation a été mise à jour et est désormais disponible en Italien dans le package CVS usermode. Un grand merci à Roberto Inzerillo pour son travail. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: WeeWM, small and customizable window manager! First version, 0.01-alpha, is now available! &bull; <a href="http://weewm.flashtux.org/">WeeWM website</a>
fr: WeeWM, le gestionnaire de fenêtres tout petit et entièrement configurable ! La première version, 0.01-alpha, est disponible ! &bull; <a href="http://weewm.flashtux.org/">Le site de WeeWM</a>

source: First version: 0.01-alpha!
fr: Première version : 0.01-alpha !

source: First version, 0.01-alpha, has been released! Dock and some other features are still under development… Enjoy ;) &bull; <a href="/weewm/download/">Download page</a>
fr: La toute première version, 0.01-alpha, est disponible ! Le dock et quelques autres fonctionnalités sont encore en développement… Amusez-vous bien ;) &bull; <a href="/weewm/download/">Page téléchargement</a>

source: New synch .bin file, generated in Saint-Cloud (France), with provider Wanadoo. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Nouveau .bin de synchro, généré à Saint-Cloud (France), avec le fournisseur Wanadoo. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Starting WeeWM project!
fr: Démarrage du projet WeeWM !

source: WeeWM - The Wee Enhanced Environment - window manager for XFree. Fast, ultra light, all can be done with keyboard. Main features: - light windows decorations, - dock management, - smart windows placement, - virtual desktops, - all can be done with keyboard, - one key for many commands, - solid window drags, - config file for bindings, - small binary size, - hot configuration reading. WeeWM is distributed under GPL licence.
fr: WeeWM - The Wee Enhanced Environment - gestionnaire de fenêtres pour XFree. Rapide, ultra léger, tout est controlable au clavier. Principales fonctionnalités : - décorations de fenêtres légères, - gestion du dock, - placement des fenêtres intelligent, - bureaux virtuels, - tout peut être contrôlé du clavier, - une touche pour plusieurs commandes, - déplacement des fenêtres avec contenu, - fichier de config pour les touches, - exécutable tout petit, - config relue à chaud. WeeWM est distribué sous licence GPL.

source: First version of gmemo! (Linux and Windows)
fr: Première version de gmemo ! (Linux et Windows)

source: First version of gmemo is available, for Linux and Windows! Beware, this is alpha version, this mean all is not yet finished! Today gmemo can do this: - display date, time, feasts (today and tomorrow) - memos management with repeat, message, sound and customizable command for alerts. This version works fine with Gtk+ (display not yet developed for Window maker and under Gnome the time is not displayed). &bull; <a href="/gmemo/download/">Gmemo download page</a>
fr: La première version de gmemo est disponible, pour Linux et Windows ! Attention, il s'agit d'une version alpha, tout est loin d'être terminé. Pour l'instant voila ce qui est possible : - affichage de la date, heure, fetes du jour et lendemain - gestion des mémos avec répétition, message, son et commande paramétrable pour les alertes. Cette version fonctionne pleinement avec Gtk+ (pas encore d'affichage pour Window maker et sous Gnome l'heure ne s'affiche pas encore). &bull; <a href="/gmemo/download/">Page téléchargement Gmemo</a>

source: New synch .bin file, generated in Sardinia (Italy), with provider Tiscali. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Nouveau .bin de synchro, généré en Sardaigne (Italie), avec le fournisseur Tiscali. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin file, generated in Arcueil (France), with provider 9online. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Nouveau .bin de synchro, généré à Arcueil (France), avec le fournisseur 9online. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Gmemo: first version soon!
fr: Gmemo : bientôt la 1ère version !

source: Screenshots have been updated. gmemo now runs under Gnome 2, GTK+ 2 and Window Maker (or Fluxbox, etc.) &bull; <a href="/gmemo/screenshots/">Screenshots</a>
fr: Les captures d'écran ont été réactualisées. gmemo tourne désormais sous Gnome 2, GTK+ 2 et Window Maker (ou Fluxbox, etc.) &bull; <a href="/gmemo/screenshots/">Captures d'écran</a>

source: EciAdsl 0.6: 2nd version of .rpm
fr: EciAdsl 0.6 : 2ème version du .rpm

source: RPM version has been rebuild due to problem in the first one. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Le .rpm a été reconstruit suite à un problème dans la 1ère version. &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New synch .bin file added, made in Italy (synch21.bin). Reminder: everybody can try all .bin, wherever you are and with any provider. &bull; <a href="/eciadsl/download/">Synch .bin package</a>
fr: Un nouveau .bin a été ajouté, fabriqué en Italie (synch21.bin) Rappel : vous pouvez essayer tous les .bin, quelque soit le lieu géographique ou le fournisseur. &bull; <a href="/eciadsl/download/">Package des fichiers .bin de synchro</a>

source: EciAdsl 0.6 - RPM version
fr: EciAdsl 0.6 - Version RPM

source: RPM version of EciAdsl 0.6 is out! Any takers? :) &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version RPM du driver EciAdsl 0.6 est disponible. Avis aux amateurs :) &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: Stable 0.6 version: Christmas present!
fr: Version 0.6 stable : le cadeau de Noël !

source: Expected 0.6 is now out! Main news added since version 0.5: - 28 supported modems, - many ppp encapsulations, - configuration/compilation/installation mode updated (see INSTALL file), - new config tool eciconftxt.sh (for console/terminal), - doc updated (README, INSTALL, TROUBLESHOOTING) and available in French and English, - a lot of bug fixes, - online FAQ (TROUBLESHOOTING file), - etc. (see Changelog file for further detail) .rpm and .deb packages will be available ASAP. EciAdsl developers wish you a nice surf! Merry Christmas! &bull; <a href="/eciadsl/download/">EciAdsl download page</a> &bull; <a href="/eciadsl/faq/">EciAdsl FAQ</a>
fr: La version 0.6 tant attendue est donc dans les bacs ! Les principales nouveautés par rapport à la version 0.5 : - 28 modems supportés, - plusieurs encapsulations ppp, - mode de configuration/compilation/installation modifié (voir le fichier INSTALL.fr), - outil de configuration eciconftxt.sh (pour la console/terminal), - documentation mise à jour (README, INSTALL, TROUBLESHOOTING) et disponible en français comme en anglais, - un stock de bugs chassés, - FAQ consultable en ligne (correspondant au TROUBLESHOOTING), - etc. (voir le Changelog pour les détails) Les versions .rpm et .deb seront disponibles très prochainement. Tous les développeurs EciAdsl vous souhaitent un excellent surf ! Joyeux Noël ! &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a> &bull; <a href="/eciadsl/faq/">FAQ EciAdsl</a>

source: Major documentation update, now the docs are installed (default in /usr/local/doc/eciadsl). &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Mise à jour de la documentation, désormais installée (par défaut dans /usr/local/doc/eciadsl). &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: Eci-load2 fixes issue getting the synch under Gnome. Minor changes, doc update. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Correction dans eci-load2 (pour des problèmes de synchro sous Gnome). Corrections mineures, mise à jour de la documentation. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: Release Candidate 3 is out. Some bugfixes and documentation updates. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: La Release Candidate 3 est disponible. Quelques corrections et une mise à jour de la documentation. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: As planned, Release Candidate 2 is out. Mainly bugfixes. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Comme prévu, la Release Candidate 2 est disponible. Principalement des corrections de bugs. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: New EciAdsl FAQ page
fr: Nouvelle page FAQ EciAdsl

source: Driver's FAQ page has been rewritten: this is now an index of TROUBLESHOOTING(.fr) file (latest version), built dynamically. &bull; <a href="/eciadsl/faq/">EciAdsl FAQ</a>
fr: La page FAQ du driver a été réécrite : désormais elle indexe dynamiquement la dernière version du fichier TROUBLESHOOTING(.fr). &bull; <a href="/eciadsl/faq/">FAQ EciAdsl</a>

source: First Release Candidate! Bugfixes, better configuration (now config scripts keep the current config if found), doc updates. &bull; <a href="/eciadsl/download/devel/">EciAdsl download page, CVS version</a>
fr: Première "Release Candidate" ! Correction de bugs, meilleure configuration (garde la configuration courante si trouvée), mise à jour de la documentation. &bull; <a href="/eciadsl/download/devel/">Page téléchargement EciAdsl, version CVS</a>

source: Bugfixes prerelease! 0.6-pre6 was unusable :-( &bull; <a href="/eciadsl/download/devel/">CVS download page</a>
fr: Nouvelle pre-release, principalement un correctif pour la 0.6-pre6 qui était inutilisable. &bull; <a href="/eciadsl/download/devel/">Page de téléchargement du CVS</a>

source: Version 0.6-pre6 is available (usermode CVS version). Changes: - official support for extra PPP encaps (PPPoE, IPoATM, etc.), - driver config rewritten (now uses /etc/eciadsl/eciadsl.conf), - many bug/stability fixes, - documentation updates. Ready for CVS?… Go! &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: La version 0.6-pre6 est disponible (version usermode CVS). Au programme : - support officiel pour les différentes encapsulations PPP (PPPoE, IPoATM, etc.), - configuration réécrite (utilisation de /etc/eciadsl/eciadsl.conf), - correction de bugs et problèmes de stabilité, - mise à jour de la documentation. À vos CVS, prêts… partez ! &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New download page
fr: Nouvelle page de téléchargement

source: All versions in one view! Detail of each version are visible by clicking on "Detail" buttons. &bull; <a href="/eciadsl/download/">EciAdsl download page</a>
fr: Toutes les versions sont visibles en un coup d'oeil ! Les détails de chaque version sont accessibles via les boutons "Détails". &bull; <a href="/eciadsl/download/">Page téléchargement EciAdsl</a>

source: New modems page
fr: Nouvelle page modems

source: Modems page has been rewritten: - modems are now in a database, - one page for each modem with photo, - list of modems and search engine by modem or country. &bull; <a href="/eciadsl/modems/">Modems page</a>
fr: La page modems a été totalement réécrite : - les modems sont désormais stockés en base de donnée, - pages dédiées à chaque modem avec photo, - fonctions de liste et de recherche par modem ou pays. &bull; <a href="/eciadsl/modems/">La page modems</a>

source: This week-end news!
fr: Nouvelles du week-end !

source: A new synch .bin has been added. Current usermode CVS now includes a script that try all the installed synch .bin's (it stops at the first .bin found OK, run probe_synch.sh --try-all to try all the .bin). Plus some fixes and doc updates. The reco script (cnx) has been updated too (fixes). A new patch for extra encapsulation protocols has been added. &bull; <a href="/eciadsl/download/">The synch .bin package</a> &bull; <a href="/eciadsl/download/devel/">The usermode CVS snapshot</a> &bull; <a href="/eciadsl/download/">The reco script (cnx)</a> &bull; <a href="http://sourceforge.net/tracker/index.php?group_id=30043&amp;atid=398083">The official patch tracker</a>
fr: Un nouveau .bin de synchro a éte ajouté. Le CVS du usermode contient maintenant un script qui permet de tester tous les /bin de synchro sans avoir a se fatiguer :-) (par défaut il s'arrête au 1er .bin OK, probe_synch.sh --try-all pour tous les tester). Plus quelques correctifs et mises à jour de la doc. Le script de reco (cnx) a été mis a jour (correctif). Un patch ajoutant le support pour de nouvelles encapsulations a été ajouté. &bull; <a href="/eciadsl/download/">Les .bin de synchro</a> &bull; <a href="/eciadsl/download/devel/">Le CVS du usermode</a> &bull; <a href="/eciadsl/download/">Le script de reco (cnx)</a> &bull; <a href="http://sourceforge.net/tracker/index.php?group_id=30043&amp;atid=398083">La page des patchs</a>
