Repository: flashtux/flashtux.org
Catalog: flashtux/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Website content is shifted, there's a long empty space. Contact is not possible due to a broken JavaScript function.
fr: Le contenu du site est décalé, il y a un long espace vide. Le contact n'est pas possible à cause d'une fonction JavaScript cassée.

source: Infinite loop
fr: Boucle infinie

source: A semicolon is missing in redirection code, so there's an infinite loop. Workaround: www.tmpw.be
fr: Il manque un point-virgule dans le code de redirection, donc il y a une boucle infinie. Contournement : www.tmpw.be

source: B&O updated their detection script and now allows IE5+ Mac, IE5.5+ for Windows and all Gecko-based browsers to enter the site. Unfortunately, Konqueror 3 is still banned although it's fully capable to display the website (spoofing it as Mozilla or Internet Explorer allows you to access any part of the site). Safari is not blocked. Probably thanks to its "Gecko" string in its user agent name. Opera is still banned.
fr: B&O a mis à jour le script de détection et autorise désormais Internet Explorer 5+ pour Mac, Internet Explorer 5.5+ pour Windows et tous les navigateurs basés sur Gecko à entrer sur le site. Malheureusement, Konqueror 3 est toujours banni bien qu'il soit capable d'afficher le site (en se faisait passer pour Mozilla ou Internet Explorer, on accède à tout le site). Safari n'est pas bloqué. Probablement grâce à la chaîne de caractères "Gecko" dans son "user agent". Opera est toujours banni.

source: Advertising sometimes break display
fr: La publicité casse parfois l'affichage

source: Some advertising banners prevent the website to display correctly pages.
fr: Des problèmes liés aux bandeaux publicitaires empêchent de manière intermittente l'accès aux pages du site.

source: *** Updated on 2005-01-14 *** Website is OK with Mozilla Firefox 1.0.
fr: *** Mis à jour le 14/01/2005 *** Le site est OK avec Mozilla Firefox 1.0.

source: Access not possible with Netscape, Konqueror or Opera
fr: Accès impossible avec Netscape, Konqueror ou Opera

source: If the browser is Netscape 4 or based on Gecko, there is this message: "Désolé, Netscape n'est pas très stable", et on nous propose de télécharger Internet Explorer. With Konqueror or Opera, there is this message: "Tu as un vieux navigateur ou tu as désactivé le javascript.", et on nous propose de télécharger Internet Explorer and Netscape. Webmaster is aware of the problem and doesn't want to block visitors. But he doesn't want to update script neither remove it. *** Updated on 2005-09-24 *** Website fixed.
fr: Si le navigateur est Netscape 4 ou basé sur Gecko, on a le message : "Désolé, Netscape n'est pas très stable", et on nous propose de télécharger Internet Explorer. Avec Konqueror ou Opera, on obtient le message : "Tu as un vieux navigateur ou tu as désactivé le javascript.", et on nous propose de télécharger Internet Explorer et Netscape. Contacté à ce sujet, le webmaster semble conscient du problème et ne souhaite pas bloquer ses visiteurs. Il n'a cependant pas l'intention de modifier son script, ni de le supprimer. *** Mise à jour le 24/09/2005 *** Le site est corrigé.

source: Menu does not work with Konqueror or Opera
fr: Le menu ne fonctionne pas avec Konqueror ou Opera

source: Website is OK only with Internet Explorer. With Mozilla, Opera or Konqueror, the page layout is broken. *** Updated on 2004-12-22 *** Website fixed.
fr: Le site ne s'affiche convenablement qu'avec Internet Explorer. Avec Mozilla, Opera ou Konqueror, la mise en page est cassée. *** Mise à jour le 22/12/2004 *** Site corrigé.

source: Problems with texts position and links
fr: Problèmes avec la position des textes et les liens

source: Graphical elements and texts are not well placed, links are not working with Konqueror or Opera.
fr: Éléments graphiques et textes mal positionnés, les liens ne fonctionnent pas avec Konqueror ou Opera.

source: The dynamic menu does not work with browsers based on Gecko. *** Updated on 2005-01-08 *** Le site est désormais OK avec Mozilla Firefox 1.0.
fr: Le menu dynamique ne fonctionne pas avec les navigateurs Gecko. *** Mis à jour le 08/01/2005 *** Le site est désormais OK avec Mozilla Firefox 1.0.

source: The dynamic menu does not work with browsers based on Gecko. *** Updated on 2005-09-24 *** Website fixed.
fr: Le menu dynamique ne fonctionne pas avec les navigateurs Gecko. *** Mise à jour le 24/09/2005 *** Le site est corrigé.

source: Access is refused because the browser doesn't have Flash (which is false); it is caused by a broken detection script. No content displayed with browsers based on Gecko.
fr: Le site refuse de démarrer en prétextant que le navigateur n'a pas de Flash (ce qui est faux) ; ceci est causé par un script de détection cassé. Aucun contenu ne s'affiche avec les navigateurs basés sur Gecko.

source: Drop-down menus are not working with Mozilla or Opera
fr: Les menus déroulants ne fonctionnent pas avec Mozilla ou Opera

source: WMP format only for the radio
fr: Format WMP seulement pour la radio

source: WMP format only for videos
fr: Format WMP seulement pour les vidéos

source: Page layout troubles
fr: Problèmes de mise en page

source: Website seems to be optimized for Internet Explorer. Other browsers (Mozilla, Konqueror, Opera) output a quite different layout (blank space due to bad JavaScript menu) The site stays fully accessible though. *** Updated on 2009-05-02 *** Website fixed.
fr: Le site semble optimisé pour Internet Explorer. Les autres navigateurs (Mozilla, Konqueror, Opera) affichent une mise en page différente (un espace vide à cause d'un mauvais menu JavaScript). Le site reste complètement accessible cependant. *** Mise à jour le 02/05/2009 *** Site corrigé.

source: Videos not accessible
fr: Vidéos non accessibles

source: Some videos (for example the journal) are available only in Windows Media Player format, so not readable with Linux/Unix. Other videos are available in RealPlayer format.
fr: Certaines vidéos (le journal par exemple) sont disponibles uniquement en format Windows Media Player, donc illisibles avec Linux/Unix. D'autres vidéos sont accessible au format RealPlayer.

source: The website has been updated and is more accessible, but some dynamic menus require Internet Explorer.
fr: Le site a été mis à jour et l'accessibilité est meilleure, mais certains menus dynamiques nécessitent Internet Explorer.

source: Annoying popup window
fr: Fenêtre popup ennuyeuse

source: A popup window is displayed for each click on a link: "Le site web de Packard Bell a été optimisé pour les versions 4 à 6 d'Internet Explorer et pour les versions 4 et 5 de Netscape…" But the menu works fine on almost all browsers.
fr: Une fenête pop-up est affiché à chaque clic sur un lien : "Le site web de Packard Bell a été optimisé pour les versions 4 à 6 d'Internet Explorer et pour les versions 4 et 5 de Netscape…" Cependant, le menu fonctionne correctement sur la plupart des navigateurs.

source: Menus not working
fr: Les menus ne fonctionnent pas

source: Dialog box to inform that some features are not present for Netscape 6. The menu on the main page doesn't work well with Mozilla and not at all with Konqueror and Opera. *** Updated on 2006-09-21 *** Website fixed.
fr: Boîte de dialogue pour informer de l'indisponibilité de certaines fonctionnalités pour Netscape 6. Le menu de la page principale ne fonctionne pas correctement sous Mozilla, et pas du tout sous Konqueror et Opera. *** Mise à jour le 21/09/2006 *** Site corrigé.

source: Menu problems with Konqueror and Opera
fr: Problèmes de menu avec Konqueror et Opera

source: Menus are not working well with Mozilla and not at all with Konqueror 3.
fr: Les menus fonctionnent mal avec Mozilla et pas du tout avec Konqueror 3.

source: Menus not working with Mozilla, Konqueror and Opera
fr: Les menus ne fonctionnent pas avec Mozilla, Konqueror et Opera

source: *** Updated on 2004-12-01 *** Website fixed.
fr: *** Mise à jour le 01/12/2004 *** Site corrigé.

source: *** Updated on 2004-12-01 *** OK with FIrefox 1.0, still problem with Konqueror and Opera.
fr: *** Mise à jour le 01/12/2004 *** OK avec Firefox 1.0, toujours le problème avec Konqueror et Opera.

source: Production selection is not possible
fr: Impossible de sélectionner un produit

source: The button to increase quantity does nothing. Opera, Konqueror and all browsers except Netscape 4+ and Internet Explorer 4+ are refused. Gecko-based browsers are accepted but the website don't work with them.
fr: Le bouton pour augmenter la quantité achetée n'a aucun effet. Opera, Konqueror et tous les navigateurs autre que Netscape 4+ et Internet Explorer 4+ sont refusés. Les navigateurs basés sur Gecko sont acceptés, mais le sit ne fonctionne pas avec.

source: JavaScript menus from hiring part (http://www.rh.apside.fr/) are accessible only with Internet Explorer or Konqueror 3. Available e-formation on the website require Shockwave plugin, not available on Linux.
fr: Les menus en JavaScript de la partie recrutement (http://www.rh.apside.fr/) ne sont accessibles qu'avec Internet Explorer ou Konqueror 3. Les e-formations disponibles sur le site nécessitent le plugin Shockwave, non-disponible sur Unix.

source: Left menus are not working with Mozilla; they are OK with Konqueror 3 and Opera.
fr: Les menus de gauche ne fonctionnent pas avec Mozilla ; ils fonctionnent avec Konqueror 3 et Opera.

source: Left menu not visible
fr: Le menu de gauche n'est pas visible

source: With Mozilla, Konqueror or Opera, the left menu is not visible. *** Updated on 2005-03-12 *** Website fixed.
fr: Avec Mozilla, Konqueror et Opera, le menu de gauche n'apparaît pas. *** Mise à jour le 12/03/2005 *** Site corrigé.

source: Problem with scrollbar
fr: Problème avec la barre de défilement

source: In the central panel, the scrollbar works only with Internet Explorer or Mozilla. *** Updated on 2004-11-28 *** Website is OK with Konqueror and Opera.
fr: Dans le panneau central, la barre de defilement ne fonctionne que sous Internet Explorer ou Mozilla. *** Mise à jour le 28/11/2004 *** Le site est OK avec Konqueror et Opera.

source: Scrollbar problem: list of concerts is not entirely visible or overflow all over the page, according to the browser used.
fr: Problème de barre de défilement : la liste de tous les concerts n'est pas visible entièrement ou déborde sur toute la page selon le navigateur utilisé.

source: The menu "Vous etes" works only with Internet Explorer, Konqueror 3 or Opera 7.54.
fr: Le menu "Vous etes" ne fonctionne qu'avec Internet Explorer, Konqueror 3 ou Opera 7.54.

source: *** Updated on 2004-12-08 *** Part of e-mail received from VirginMega: "Le site Internet www.virginmega.fr est accessible à ce jour avec Internet Explorer 5. Si vous êtes sur Mac vous pouvez surfer sur le site avec Internet Explorer 5.2 mais vous ne pouvez pas effectuer d'achats. D'ici peu, les utilisateurs des navigateurs Netscape7.1 et les utilisateurs Mozilla 5.0 pourront découvrir la nouvelle offre VirginMega.fr (400 000 titres à télécharger)." *** Updated on 2005-06-18 *** On Linux, the website still does not work (OK on Windows with Firefox).
fr: *** Mise à jour le 08/12/2004 *** Extrait du courrier reçu de VirginMega : "Le site Internet www.virginmega.fr est accessible à ce jour avec Internet Explorer 5. Si vous êtes sur Mac vous pouvez surfer sur le site avec Internet Explorer 5.2 mais vous ne pouvez pas effectuer d'achats. D'ici peu, les utilisateurs des navigateurs Netscape7.1 et les utilisateurs Mozilla 5.0 pourront découvrir la nouvelle offre VirginMega.fr (400 000 titres à télécharger)." *** Mise à jour le 18/06/2005 *** Sous Linux, le site ne fonctionne toujours pas (OK sous Windows avec Firefox).

source: Very restrictive detection script
fr: Script de détection très restrictif

source: *** Updated on 2003-07-01 *** The detection script elvolved and now accepts Mozilla-based browsers on Unix platforms but still blocks Opera and Konqueror for wrong reasons: according to the script, both cookies and JavaScript support were disabled but that's not the case. *** Updated on 2009-09-16 *** Website fixed.
fr: *** Mise à jour le 01/07/2003 *** Le script de détection a évolué et accepte maintenant les navigateurs basés sur Mozilla sur plateforme Unix mais bloque toujours Opera et Konqueror pour de mauvaises raisons : selon le script, les cookies et JavaScript sont désactivés, mais ce n'est pas le cas. *** Mise à jour le 16/09/2009 *** Site corrigé.

source: Menus are working only with Internet Explorer.
fr: Les menus ne fonctionnent qu'avec Internet Explorer.

source: rejected
fr: rejeté

source: waiting for approval
fr: en attente d'approbation

source: blacklisted
fr: sur liste noire

source: fixed
fr: corrigé

source: display issues
fr: problèmes d'affichage

source: partially broken
fr: partiellement cassé

source: entirely broken
fr: complètement cassé

source: WeeWM users guide
fr: Guide utilisateur WeeWM
